[{"type": "text", "content": "\n"}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "\nCopyright (c) 1997,1998,2002,2007 Adobe Systems Incorporated\n"}], "pattern": ".{0,5000}"}, {"type": "text", "content": "\nPermission is hereby granted, free of charge, to any person obtaining a copy of this documentation file\nto use, copy, publish, distribute, sublicense, and/or sell copies of the documentation, and to permit\nothers to do the same, provided that:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "-"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNo modification, editing or other alteration of this document is allowed; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "-"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe above copyright notice and this permission notice shall be included in all copies of the\ndocumentation.\nPermission is hereby granted, free of charge, to any person obtaining a copy of this documentation file,\nto create their own derivative works from the content of this document to use, copy, publish,\ndistribute, sublicense, and/or sell the derivative works, and to permit others to do the same,\nprovided that the derived work is not represented as being a copy or version of this document.\nAdobe shall not be liable to any party for any loss of revenue or profit or for indirect, incidental,\nspecial, consequential, or other similar damages, whether based on tort (including without limitation\nnegligence or strict liability), contract or other legal or equitable grounds even if Adobe has been\nadvised or had reason to know of the possibility of such damages. "}, {"type": "var", "name": "eCircumflex1", "content": [], "pattern": "Ê?"}, {"type": "text", "content": " The Adobe\nmaterials are provided on an \"AS IS\" basis. "}, {"type": "var", "name": "eCircumflex2", "content": [], "pattern": "Ê?"}, {"type": "text", "content": " Adobe specifically disclaims all\nexpress, statutory, or implied warranties relating to the Adobe materials, including but not limited\nto those concerning merchantability or fitness for a particular purpose or non-infringement of any\nthird party rights regarding the Adobe materials.\n"}]