[{"type": "optional", "content": {"type": "text", "content": "Adobe Systems Incorporated(r) Source Code License Agreement"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright(c) 2006 Adobe Systems Incorporated. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Please read this Source Code License Agreement carefully before using the source code.\n      Adobe Systems Incorporated grants to you a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\n         irrevocable copyright license, to reproduce, prepare derivative works of, publicly display, publicly\n         perform, and distribute this source code and such derivative works in source or object code form without\n         any attribution requirements.\n      The name \"Adobe Systems Incorporated\" must not be used to endorse or promote products derived from the source\n         code without prior written permission.\n      You agree to indemnify, hold harmless and defend Adobe Systems Incorporated from and against any loss,\n         damage, claims or lawsuits, including attorney's fees that arise or result from your use or distribution\n         of the source code.\n      THIS SOURCE CODE IS PROVIDED \"AS IS\" AND \"WITH ALL FAULTS\", WITHOUT ANY TECHNICAL SUPPORT OR ANY EXPRESSED OR\n         IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n         FOR A PARTICULAR PURPOSE ARE DISCLAIMED. ALSO, THERE IS NO WARRANTY OF NON-INFRINGEMENT, TITLE OR QUIET\n         ENJOYMENT. IN NO EVENT SHALL MACROMEDIA OR ITS SUPPLIERS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n         SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\n         GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n         THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n         ARISING IN ANY WAY OUT OF THE USE OF THIS SOURCE CODE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\n         DAMAGE."}]