[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nAladdin Free Public License\n(Version 8, November 18, 1999)\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nCopyright (C) 1994, 1995, 1997, 1998, 1999 Aladdin Enterprises,\nMenlo Park, California, U.S.A. All rights reserved.\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nNOTE: This License is not the same as any of the GNU Licenses published by the Free Software Foundation.\nIts terms are substantially different from those of the GNU Licenses. If you are familiar with the GNU\nLicenses, please read this license with extra care.\nAladdin Enterprises hereby grants to anyone the permission to apply this License to their own work, as\nlong as the entire License (including the above notices and this paragraph) is copied with no changes,\nadditions, or deletions except for changing the first paragraph of Section 0 to include a suitable\ndescription of the work to which the license is being applied and of the person or entity that holds\nthe copyright in the work, and, if the License is being applied to a work created in a country other\nthan the United States, replacing the first paragraph of Section 6 with an appropriate reference to\nthe laws of the appropriate country.\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "0."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject Matter\nThis License applies to the computer program known as \"Aladdin Ghostscript.\" The \"Program\",\nbelow, refers to such program. The Program is a copyrighted work whose copyright is\nheld by Aladdin Enterprises (the \"Licensor\"). Please note that Aladdin Ghostscript is\nneither the program known as \"GNU Ghostscript\" nor the version of Ghostscript\navailable for commercial licensing from Artifex Software Inc.\nA \"work based on the Program\" means either the Program or any derivative work of the Program, as\ndefined in the United States Copyright Act of 1976, such as a translation or a\nmodification.\nBY MODIFYING OR DISTRIBUTING THE PROGRAM (OR ANY WORK BASED ON THE PROGRAM), YOU INDICATE YOUR\nACCEPTANCE OF THIS LICENSE TO DO SO, AND ALL ITS TERMS AND CONDITIONS FOR COPYING,\nDISTRIBUTING OR MODIFYING THE PROGRAM OR WORKS BASED ON IT. NOTHING OTHER THAN THIS LICENSE\nGRANTS YOU PERMISSION TO MODIFY OR DISTRIBUTE THE PROGRAM OR ITS DERIVATIVE WORKS. THESE\nACTIONS ARE PROHIBITED BY LAW. IF YOU DO NOT ACCEPT THESE TERMS AND CONDITIONS, DO NOT MODIFY\nOR DISTRIBUTE THE PROGRAM.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicenses.\nLicensor hereby grants you the following rights, provided that you comply with all of the\nrestrictions set forth in this License and provided, further, that you distribute an\nunmodified copy of this License with the Program:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may copy and distribute literal (i.e., verbatim) copies of the Program's source code as\nyou receive it throughout the world, in any medium.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may modify the Program, create works based on the Program and distribute copies of such\nthroughout the world, in any medium.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRestrictions.\nThis license is subject to the following restrictions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of the Program or any work based on the Program by a commercial organization to\nany third party is prohibited if any payment is made in connection with such distribution,\nwhether directly (as in payment for a copy of the Program) or indirectly (as in payment\nfor some service related to the Program, or payment for some product or service that\nincludes a copy of the Program \"without charge\"; these are only examples, and not an\nexhaustive enumeration of prohibited activities). The following methods of distribution\ninvolving payment shall not in and of themselves be a violation of this restriction:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPosting the Program on a public access information storage and retrieval service for\nwhich a fee is received for retrieving information (such as an on-line service),\nprovided that the fee is not content-dependent (i.e., the fee would be the same for\nretrieving the same volume of information consisting of random data) and that access\nto the service and to the Program is available independent of any other product or\nservice. An example of a service that does not fall under this section is an on-line\nservice that is operated by a company and that is only available to customers of that\ncompany. (This is not an exhaustive enumeration.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistributing the Program on removable computer-readable media, provided that the files\ncontaining the Program are reproduced entirely and verbatim on such media, that all\ninformation on such media be redistributable for non-commercial purposes without\ncharge, and that such media are distributed by themselves (except for accompanying\ndocumentation) independent of any other product or service. Examples of such media\ninclude CD-ROM, magnetic tape, and optical storage media. (This is not intended to be\nan exhaustive list.) An example of a distribution that does not fall under this\nsection is a CD-ROM included in a book or magazine. (This is not an exhaustive\nenumeration.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nActivities other than copying, distribution and modification of the Program are not subject\nto this License and they are outside its scope. Functional use (running) of the Program is\nnot restricted, and any output produced through the use of the Program is subject to this\nlicense only if its contents constitute a work based on the Program (independent of having\nbeen made by running the Program).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must meet all of the following conditions with respect to any work that you distribute or\npublish that in whole or in part contains or is derived from the Program or any part\nthereof (\"the Work\"):\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf you have modified the Program, you must cause the Work to carry prominent notices\nstating that you have modified the Program's files and the date of any change. In each\nsource file that you have modified, you must include a prominent notice that you have\nmodified the file, including your name, your e-mail address (if any), and the date and\npurpose of the change;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must cause the Work to be licensed as a whole and at no charge to all third parties\nunder the terms of this License;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(iii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf the Work normally reads commands interactively when run, you must cause it, at each\ntime the Work commences operation, to print or display an announcement including an\nappropriate copyright notice and a notice that there is no warranty (or else, saying\nthat you provide a warranty). Such notice must also state that users may redistribute\nthe Work only under the conditions of this License and tell the user how to view the\ncopy of this License included with the Work. (Exceptions: if the Program is\ninteractive but normally prints or displays such an announcement only at the request\nof a user, such as in an \"About box\", the Work is required to print or display the\nnotice only under the same circumstances; if the Program itself is interactive but\ndoes not normally print such an announcement, the Work is not required to print an\nannouncement.);\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(iv)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must accompany the Work with the complete corresponding machine-readable source code,\ndelivered on a medium customarily used for software interchange. The source code for a\nwork means the preferred form of the work for making modifications to it. For an\nexecutable work, complete source code means all the source code for all modules it\ncontains, plus any associated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable code. If you distribute with\nthe Work any component that is normally distributed (in either source or binary form)\nwith the major components (compiler, kernel, and so on) of the operating system on\nwhich the executable runs, you must also distribute the source code of that component\nif you have it and are allowed to do so;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(v)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf you distribute any written or printed material at all with the Work, such material\nmust include either a written copy of this License, or a prominent written indication\nthat the Work is covered by this License and written instructions for printing and/or\ndisplaying the copy of the License on the distribution medium;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(vi)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may not impose any further restrictions on the recipient's exercise of the rights\ngranted herein.\nIf distribution of executable or object code is made by offering the equivalent ability\nto copy from a designated place, then offering equivalent ability to copy the source\ncode from the same place counts as distribution of the source code, even though third\nparties are not compelled to copy the source code along with the object code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nReservation of Rights.\nNo rights are granted to the Program except as expressly set forth herein. You may not\ncopy, modify, sublicense, or distribute the Program except as expressly provided under\nthis License. Any attempt otherwise to copy, modify, sublicense or distribute the\nProgram is void, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under this License will\nnot have their licenses terminated so long as such parties remain in full compliance.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOther Restrictions.\nIf the distribution and/or use of the Program is restricted in certain countries for any\nreason, Licensor may add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among countries not thus\nexcluded. In such case, this License incorporates the limitation as if written in the\nbody of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitations.\nTHE PROGRAM IS PROVIDED TO YOU \"AS IS,\" WITHOUT WARRANTY. THERE IS NO WARRANTY FOR THE\nPROGRAM, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\nOF THIRD PARTY RIGHTS. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\nPROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL\nNECESSARY SERVICING, REPAIR OR CORRECTION.\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL LICENSOR, OR ANY OTHER\nPARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR\nDAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF\nTHE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA\nBEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE\nPROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN\nADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral.\nThis License is governed by the laws of the State of California, U.S.A., excluding choice of law rules.\nIf any part of this License is found to be in conflict with the law, that part shall be\ninterpreted in its broadest meaning consistent with the law, and no other parts of the License\nshall be affected.\nFor United States Government users, the Program is provided with RESTRICTED RIGHTS. If you are a\nunit or agency of the United States Government or are acquiring the Program for any such unit\nor agency, the following apply:\nIf the unit or agency is the Department of Defense (\"DOD\"), the Program and its documentation are\nclassified as \"commercial computer software\" and \"commercial computer software documentation\"\nrespectively and, pursuant to DFAR Section 227.7202, the Government is acquiring the Program\nand its documentation in accordance with the terms of this License. If the unit or agency is\nother than DOD, the Program and its documentation are classified as \"commercial computer\nsoftware\" and \"commercial computer software documentation\" respectively and, pursuant to FAR\nSection 12.212, the Government is acquiring the Program and its documentation in accordance\nwith the terms of this License.\n"}]