[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nApache License\nVersion 2.0, January 2004\nhttp://www.apache.org/licenses/\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nTERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\n\"License\" shall mean the terms and conditions for use, reproduction, and distribution\nas defined by Sections 1 through 9 of this document.\n\"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner\nthat is granting the License.\n\"Legal Entity\" shall mean the union of the acting entity and all other entities that\ncontrol, are controlled by, or are under common control with that entity. For the purposes of\nthis definition, \"control\" means (i) the power, direct or indirect, to cause the\ndirection or management of such entity, whether by contract or otherwise, or (ii) ownership of\nfifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such\nentity.\n\"You\" (or \"Your\") shall mean an individual or Legal Entity exercising\npermissions granted by this License.\n\"Source\" form shall mean the preferred form for making modifications, including but not\nlimited to software source code, documentation source, and configuration files.\n\"Object\" form shall mean any form resulting from mechanical transformation or\ntranslation of a Source form, including but not limited to compiled object code, generated\ndocumentation, and conversions to other media types.\n\"Work\" shall mean the work of authorship, whether in Source or Object form, made\navailable under the License, as indicated by a copyright notice that is included in or\nattached to the work (an example is provided in the Appendix below).\n\"Derivative Works\" shall mean any work, whether in Source or Object form, that is based\non (or derived from) the Work and for which the editorial revisions, annotations,\nelaborations, or other modifications represent, as a whole, an original work of authorship.\nFor the purposes of this License, Derivative Works shall not include works that remain\nseparable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative\nWorks thereof.\n\"Contribution\" shall mean any work of authorship, including the original version of the\nWork and any modifications or additions to that Work or Derivative Works thereof, that is\nintentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an\nindividual or Legal Entity authorized to submit on behalf of the copyright owner. For the\npurposes of this definition, \"submitted\" means any form of electronic, verbal, or\nwritten communication sent to the Licensor or its representatives, including but not limited\nto communication on electronic mailing lists, source code control systems, and issue tracking\nsystems that are managed by, or on behalf of, the Licensor for the purpose of discussing and\nimproving the Work, but excluding communication that is conspicuously marked or otherwise\ndesignated in writing by the copyright owner as \"Not a Contribution.\"\n\"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom\na Contribution has been received by Licensor and subsequently incorporated within the\nWork.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of Copyright License. Subject to the terms and conditions of this License, each Contributor\nhereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable copyright license to reproduce, prepare Derivative Works of, publicly display,\npublicly perform, sublicense, and distribute the Work and such Derivative Works in Source or\nObject form.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of Patent License. Subject to the terms and conditions of this License, each Contributor\nhereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable (except as stated in this section) patent license to make, have made, use, offer\nto sell, sell, import, and otherwise transfer the Work, where such license applies only to\nthose patent claims licensable by such Contributor that are necessarily infringed by their\nContribution(s) alone or by combination of their Contribution(s) with the Work to which such\nContribution(s) was submitted. If You institute patent litigation against any entity\n(including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a\nContribution incorporated within the Work constitutes direct or contributory patent\ninfringement, then any patent licenses granted to You under this License for that Work shall\nterminate as of the date such litigation is filed.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRedistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof\nin any medium, with or without modifications, and in Source or Object form, provided that You\nmeet the following conditions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must give any other recipients of the Work or Derivative Works a copy of this License; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must cause any modified files to carry prominent notices stating that You changed the files; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must retain, in the Source form of any Derivative Works that You distribute, all\ncopyright, patent, trademark, and attribution notices from the Source form of the Work,\nexcluding those notices that do not pertain to any part of the Derivative Works; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf the Work includes a \"NOTICE\" text file as part of its distribution, then any\nDerivative Works that You distribute must include a readable copy of the attribution\nnotices contained within such NOTICE file, excluding those notices that do not pertain to\nany part of the Derivative Works, in at least one of the following places: within a NOTICE\ntext file distributed as part of the Derivative Works; within the Source form or\ndocumentation, if provided along with the Derivative Works; or, within a display generated\nby the Derivative Works, if and wherever such third-party notices normally appear. The\ncontents of the NOTICE file are for informational purposes only and do not modify the\nLicense. You may add Your own attribution notices within Derivative Works that You\ndistribute, alongside or as an addendum to the NOTICE text from the Work, provided that\nsuch additional attribution notices cannot be construed as modifying the License.\nYou may add Your own copyright statement to Your modifications and may provide additional or\ndifferent license terms and conditions for use, reproduction, or distribution of Your\nmodifications, or for any such Derivative Works as a whole, provided Your use,\nreproduction, and distribution of the Work otherwise complies with the conditions stated\nin this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubmission of Contributions. Unless You explicitly state otherwise, any Contribution\nintentionally submitted for inclusion in the Work by You to the Licensor shall be under the\nterms and conditions of this License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify the terms of any separate\nlicense agreement you may have executed with Licensor regarding such Contributions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademarks. This License does not grant permission to use the trade names, trademarks, service\nmarks, or product names of the Licensor, except as required for reasonable and customary use\nin describing the origin of the Work and reproducing the content of the NOTICE file.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor\nprovides the Work (and each Contributor provides its Contributions) on an \"AS IS\"\nBASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including,\nwithout limitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY,\nor FITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Work and assume any risks associated with Your\nexercise of permissions under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability. In no event and under no legal theory, whether in tort (including\nnegligence), contract, or otherwise, unless required by applicable law (such as deliberate and\ngrossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for\ndamages, including any direct, indirect, special, incidental, or consequential damages of any\ncharacter arising as a result of this License or out of the use or inability to use the Work\n(including but not limited to damages for loss of goodwill, work stoppage, computer failure or\nmalfunction, or any and all other commercial damages or losses), even if such Contributor has\nbeen advised of the possibility of such damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAccepting Warranty or Additional Liability. While redistributing the Work or Derivative Works\nthereof, You may choose to offer, and charge a fee for, acceptance of support, warranty,\nindemnity, or other liability obligations and/or rights consistent with this License. However,\nin accepting such obligations, You may act only on Your own behalf and on Your sole\nresponsibility, not on behalf of any other Contributor, and only if You agree to indemnify,\ndefend, and hold each Contributor harmless for any liability incurred by, or claims asserted\nagainst, such Contributor by reason of your accepting any such warranty or additional\nliability.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEND OF TERMS AND CONDITIONS\nAPPENDIX: How to apply the Apache License to your work.\nTo apply the Apache License to your work, attach the following boilerplate notice, with the fields\nenclosed by brackets \"[]\" replaced with your own identifying information. (Don't\ninclude the brackets!) The text should be enclosed in the appropriate comment syntax for the file\nformat. We also recommend that a file or class name and description of purpose be included on the same\n\"printed page\" as the copyright notice for easier identification within third-party\narchives.\nCopyright "}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "[yyyy] [name of copyright owner]"}], "pattern": ".+"}, {"tag": "text", "content": "\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\nhttp://www.apache.org/licenses/LICENSE-2.0\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n"}]}, {"tag": "text", "content": "\n"}]