[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nADAPTIVE PUBLIC LICENSE\nVersion 1.0\n"}]}, {"tag": "text", "content": "\nTHE LICENSED WORK IS PROVIDED UNDER THE TERMS OF THIS ADAPTIVE PUBLIC LICENSE (\"LICENSE\"). ANY USE,\nREPRODUCTION OR DISTRIBUTION OF THE LICENSED WORK CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS LICENSE\nAND ITS TERMS, WHETHER OR NOT SUCH RECIPIENT READS THE TERMS OF THIS LICENSE. \"LICENSED WORK\" AND\n\"RECIPIENT\" ARE DEFINED BELOW.\nIMPORTANT NOTE: This License is \"adaptive\", and the generic version or another version of an Adaptive\nPublic License should not be relied upon to determine your rights and obligations under this License.\nYou must read the specific Adaptive Public License that you receive with the Licensed Work, as certain\nterms are defined at the outset by the Initial Contributor.\nSee Section 2.2 below, Exhibit A attached, and any Suppfile.txt accompanying this License to determine\nthe specific adaptive features applicable to this License. For example, without limiting the\nforegoing, (a) for selected choice of law and jurisdiction see Part 3 of Exhibit A; (b) for the\nselected definition of Third Party see Part 4 of Exhibit A; and (c) for selected patent licensing\nterms (if any) see Section 2.2 below and Part 6 of Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDEFINITIONS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"CONTRIBUTION\" means:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the case of the Initial Contributor, the Initial Work distributed under this License by\nthe Initial Contributor; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the case of each Subsequent Contributor, the Subsequent Work originating from and\ndistributed by such Subsequent Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"DESIGNATED WEB SITE\" means the web site having the URL identified in Part 1 of Exhibit A, which\nURL may be changed by the Initial Contributor by posting on the current Designated Web Site\nthe new URL for at least sixty (60) days.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"DISTRIBUTOR\" means any Person that distributes the Licensed Work or any portion thereof to at\nleast one Third Party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"ELECTRONIC DISTRIBUTION MECHANISM\" means any mechanism generally accepted in the software\ndevelopment community for the electronic transfer of data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"EXECUTABLE\" means the Licensed Work in any form other than Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"GOVERNING JURISDICTION\" means the state, province or other legal jurisdiction identified in Part\n3 of Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"INDEPENDENT MODULE\" means a separate module of software and/or data that is not a derivative\nwork of or copied from the Licensed Work or any portion thereof. In addition, a module does\nnot qualify as an Independent Module but instead forms part of the Licensed Work if the\nmodule: (a) is embedded in the Licensed Work; (b) is included by reference in the Licensed\nWork other than by a function call or a class reference; or (c) must be included or contained,\nin whole or in part, within a file directory or subdirectory actually containing files making\nup the Licensed Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"INITIAL CONTRIBUTOR\" means the Person or entity identified as the Initial Contributor in the\nnotice required by Part 1 of Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"INITIAL WORK\" means the initial Source Code, object code (if any) and documentation for the\ncomputer program identified in Part 2 of Exhibit A, as such Source Code, object code and\ndocumentation is distributed under this License by the Initial Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"LARGER WORK\" means a work that combines the Licensed Work or portions thereof with code not\ngoverned by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"LICENSED WORK\" means the Initial Work and/or any Subsequent Work, in each case including\nportions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"LICENSE NOTICE\" has the meaning assigned in Part 5 of Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"MODIFICATION\" or \"MODIFICATIONS\" means any change to and/or addition to the Licensed Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"PERSON\" means an individual or other legal entity, including a corporation, partnership or other body.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.15."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"RECIPIENT\" means any Person who receives or obtains the Licensed Work under this License (by way\nof example, without limiting the foregoing, any Subsequent Contributor or Distributor).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.16."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"SOURCE CODE\" means the source code for a computer program, including the source code for all\nmodules and components of the computer program, plus any associated interface definition\nfiles, and scripts used to control compilation and installation of an executable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.17."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"SUBSEQUENT CONTRIBUTOR\" means any Person that makes or contributes to the making of any\nSubsequent Work and that distributes that Subsequent Work to at least one Third Party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.18."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"SUBSEQUENT WORK\" means a work that has resulted or arises from changes to and/or additions to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe Initial Work;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany other Subsequent Work; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto any combination of the Initial Work and any such other Subsequent Work;\nwhere such changes and/or additions originate from a Subsequent Contributor. A\nSubsequent Work will \"originate\" from a Subsequent Contributor if the Subsequent\nWork was a result of efforts by such Subsequent Contributor (or anyone acting on\nsuch Subsequent Contributor's behalf, such as, a contractor or other entity that\nis engaged by or under the direction of the Subsequent Contributor). For greater\ncertainty, a Subsequent Work expressly excludes and shall not capture within its\nmeaning any Independent Module.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.19."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"SUPPLEMENT FILE\" means a file distributed with the Licensed Work having a file name \"suppfile.txt\".\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.20."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"THIRD PARTY\" has the meaning assigned in Part 4 of Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLICENSE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOPYRIGHT LICENSE FROM INITIAL AND SUBSEQUENT CONTRIBUTORS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the terms of this License, the Initial Contributor hereby grants each Recipient a\nworld-wide, royalty-free, non-exclusive copyright license to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nreproduce, prepare derivative works of, publicly display, publicly perform, distribute\nand sublicense the Initial Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nreproduce, publicly display, publicly perform, distribute, and sublicense any derivative\nworks (if any) prepared by Recipient;\nin Source Code and Executable form, either with other Modifications, on an\nunmodified basis, or as part of a Larger Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the terms of this License, each Subsequent Contributor hereby grants each\nRecipient a world-wide, royalty-free, non-exclusive copyright license to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nreproduce, prepare derivative works of, publicly display, publicly perform, distribute\nand sublicense the Subsequent Work of such Subsequent Contributor; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nreproduce, publicly display, publicly perform, distribute, and sublicense any derivative\nworks (if any) prepared by Recipient;\nin Source Code and Executable form, either with other Modifications, on an\nunmodified basis, or as part of a Larger Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPATENT LICENSE FROM INITIAL AND SUBSEQUENT CONTRIBUTORS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License does not include or grant any patent license whatsoever from the Initial\nContributor, Subsequent Contributor, or any Distributor unless, at the time the Initial\nWork is first distributed or made available under this License (as the case may be), the\nInitial Contributor has selected pursuant to Part 6 of Exhibit A the patent terms in\nparagraphs A, B, C, D and E from Part 6 of Exhibit A. If this is not done then the Initial\nWork and any other Subsequent Work is made available under the License without any patent\nlicense (the \"PATENTS-EXCLUDED LICENSE\").\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nHowever, the Initial Contributor may subsequently distribute or make available (as the case\nmay be) future copies of: (1) the Initial Work; or (2) any Licensed Work distributed by\nthe Initial Contributor which includes the Initial Work (or any portion thereof) and/or\nany Modification made by the Initial Contributor; available under a License which includes\na patent license (the \"PATENTS-INCLUDED LICENSE\") by selecting pursuant to Part 6 of\nExhibit A the patent terms in paragraphs A, B, C, D and E from Part 6 of Exhibit A, when\nthe Initial Contributor distributes or makes available (as the case may be) such future\ncopies under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf any Recipient receives or obtains one or more copies of the Initial Work or any other\nportion of the Licensed Work under the Patents-Included License, then all licensing of\nsuch copies under this License shall include the terms in paragraphs A, B, C, D and E from\nPart 6 of Exhibit A and that Recipient shall not be able to rely upon the Patents-Excluded\nLicense for any such copies. However, all Recipients that receive one or more copies of\nthe Initial Work or any other portion of the Licensed Work under a copy of the License\nwhich includes the Patents-Excluded License shall have no patent license with respect to\nsuch copies received under the Patents-Excluded License and availability and distribution\nof such copies, including Modifications made by such Recipient to such copies, shall be\nunder a copy of the License without any patent license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWhere a Recipient uses in combination or combines any copy of the Licensed Work (or portion\nthereof) licensed under a copy of the License having a Patents-Excluded License with any\ncopy of the Licensed Work (or portion thereof) licensed under a copy of the License having\na Patents-Included License, the combination (and any portion thereof) shall, from the\nfirst time such Recipient uses, makes available or distributes the combination (as the\ncase may be), be subject to only the terms of the License having the Patents-Included\nLicense which shall include the terms in paragraphs A, B, C, D and E from Part 6 of\nExhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nACKNOWLEDGEMENT AND DISCLAIMER.\nRecipient understands and agrees that although Initial Contributor and each Subsequent\nContributor grants the licenses to its Contributions set forth herein, no\nrepresentation, warranty, guarantee or assurance is provided by any Initial\nContributor, Subsequent Contributor, or Distributor that the Licensed Work does not\ninfringe the patent or other intellectual property rights of any other entity. Initial\nContributor, Subsequent Contributor, and each Distributor disclaims any liability to\nRecipient for claims brought by any other entity based on infringement of intellectual\nproperty rights or otherwise, in relation to the Licensed Works. As a condition to\nexercising the rights and licenses granted hereunder, each Recipient hereby assumes\nsole responsibility to secure any other intellectual property rights needed, if any.\nFor example, without limiting the foregoing disclaimers, if a third party patent\nlicense is required to allow Recipient to distribute the Licensed Work, it is\nRecipient's responsibility to acquire that license before distributing the Licensed\nWork.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRESERVATION.\nNothing in this License shall be deemed to grant any rights to trademarks, copyrights,\npatents, trade secrets or any other intellectual property of Initial Contributor,\nSubsequent Contributor, or Distributor except as expressly stated herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISTRIBUTION OBLIGATIONS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISTRIBUTION GENERALLY.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nA Subsequent Contributor shall make that Subsequent Contributor's Subsequent Work(s)\navailable to the public via an Electronic Distribution Mechanism for a period of at least\ntwelve (12) months. The aforesaid twelve (12) month period shall begin within a reasonable\ntime after the creation of the Subsequent Work and no later than sixty (60) days after\nfirst distribution of that Subsequent Contributor's Subsequent Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAll Distributors must distribute the Licensed Work in accordance with the terms of the\nLicense, and must include a copy of this License (including without limitation Exhibit A\nand the accompanying Supplement File) with each copy of the Licensed Work distributed. In\nparticular, this License must be prominently distributed with the Licensed Work in a file\ncalled \"license.txt.\" In addition, the License Notice in Part 5 of Exhibit A must be\nincluded at the beginning of all Source Code files, and viewable to a user in any\nexecutable such that the License Notice is reasonably brought to the attention of any\nparty using the Licensed Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEXECUTABLE DISTRIBUTIONS OF THE LICENSED WORK.\nA Distributor may choose to distribute the Licensed Work, or any portion thereof, in\nExecutable form (an \"EXECUTABLE DISTRIBUTION\") to any third party, under the terms of\nSection 2 of this License, provided the Executable Distribution is made available\nunder and accompanied by a copy of this License, AND provided at least ONE of the\nfollowing conditions is fulfilled:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Executable Distribution must be accompanied by the Source Code for the Licensed Work\nmaking up the Executable Distribution, and the Source Code must be distributed on the same\nmedia as the Executable Distribution or using an Electronic Distribution Mechanism; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Executable Distribution must be accompanied with a written offer, valid for at least\nthirty six (36) months, to give any third party under the terms of this License, for a\ncharge no more than the cost of physically performing source distribution, a complete\nmachine-readable copy of the Source Code for the Licensed Work making up the Executable\nDistribution, to be available and distributed using an Electronic Distribution Mechanism,\nand such Executable Distribution must remain available in Source Code form to any third\nparty via the Electronic Distribution Mechanism (or any replacement Electronic\nDistribution Mechanism the particular Distributor may reasonably need to turn to as a\nsubstitute) for said at least thirty six (36) months.\nFor greater certainty, the above-noted requirements apply to any Licensed Work or portion\nthereof distributed to any third party in Executable form, whether such distribution is\nmade alone, in combination with a Larger Work or Independent Modules, or in some other\ncombination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSOURCE CODE DISTRIBUTIONS.\nWhen a Distributor makes the Licensed Work, or any portion thereof, available to any Person\nin Source Code form, it must be made available under this License and a copy of this\nLicense must be included with each copy of the Source Code, situated so that the copy\nof the License is conspicuously brought to the attention of that Person. For greater\nclarification, this Section 3.3 applies to all distribution of the Licensed Work in\nany Source Code form. A Distributor may charge a fee for the physical act of\ntransferring a copy, which charge shall be no more than the cost of physically\nperforming source distribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nREQUIRED NOTICES IN SOURCE CODE.\nEach Subsequent Contributor must ensure that the notice set out in Part 5 of Exhibit A is\nincluded in each file of the Source Code for each Subsequent Work originating from\nthat particular Subsequent Contributor, if such notice is not already included in each\nsuch file. If it is not possible to put such notice in a particular Source Code file\ndue to its structure, then the Subsequent Contributor must include such notice in a\nlocation (such as a relevant directory in which the file is stored) where a user would\nbe likely to look for such a notice.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNO DISTRIBUTION REQUIREMENTS FOR INTERNALLY USED MODIFICATIONS.\nNotwithstanding Sections 3.2, 3.3 and 3.4, Recipient may, internally within its own\ncorporation or organization use the Licensed Work, including the Initial Work and\nSubsequent Works, and make Modifications for internal use within Recipient's own\ncorporation or organization (collectively, \"INTERNAL USE MODIFICATIONS\"). The\nRecipient shall have no obligation to distribute, in either Source Code or Executable\nform, any such Internal Use Modifications made by Recipient in the course of such\ninternal use, except where required below in this Section 3.5. All Internal Use\nModifications distributed to any Person, whether or not a Third Party, shall be\ndistributed pursuant to and be accompanied by the terms of this License. If the\nRecipient chooses to distribute any such Internal Use Modifications to any Third\nParty, then the Recipient shall be deemed a Subsequent Contributor, and any such\nInternal Use Modifications distributed to any Third Party shall be deemed a Subsequent\nWork originating from that Subsequent Contributor, and shall from the first such\ninstance become part of the Licensed Work that must thereafter be distributed and made\navailable to third parties in accordance with the terms of Sections 3.1 to 3.4\ninclusive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nINDEPENDENT MODULES.\nThis License shall not apply to Independent Modules of any Initial Contributor, Subsequent\nContributor, Distributor or any Recipient, and such Independent Modules may be\nlicensed or made available under one or more separate license agreements.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLARGER WORKS.\nAny Distributor or Recipient may create or contribute to a Larger Work by combining any of\nthe Licensed Work with other code not governed by the terms of this License, and may\ndistribute the Larger Work as one or more products. However, in any such case,\nDistributor or Recipient (as the case may be) must make sure that the requirements of\nthis License are fulfilled for the Licensed Work portion of the Larger Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDESCRIPTION OF DISTRIBUTED MODIFICATIONS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach Subsequent Contributor (including the Initial Contributor where the Initial Contributor\nalso qualifies as a Subsequent Contributor) must cause each Subsequent Work created or\ncontributed to by that Subsequent Contributor to contain a file documenting the changes,\nin accordance with the requirements of Part 1 of the Supplement File, that such Subsequent\nContributor made in the creation or contribution to that Subsequent Work. If no Supplement\nFile exists or no requirements are set out in Part 1 of the Supplement File, then there\nare no requirements for Subsequent Contributors to document changes that they make\nresulting in Subsequent Works.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Initial Contributor may at any time introduce requirements or add to or change earlier\nrequirements (in each case, the \"EARLIER DESCRIPTION REQUIREMENTS\") for documenting\nchanges resulting in Subsequent Works by revising Part 1 of each copy of the Supplement\nFile distributed by the Initial Contributor with future copies of the Licensed Work so\nthat Part 1 then contains new requirements (the \"NEW DESCRIPTION REQUIREMENTS\") for\ndocumenting such changes.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny Recipient receiving at any time any copy of an Initial Work or any Subsequent Work under\na copy of this License (in each case, an \"Earlier LICENSED COPY\") having the Earlier\nDescription Requirements may choose, with respect to each such Earlier Licensed Copy, to\ncomply with the Earlier Description Requirements or the New Description Requirements.\nWhere a Recipient chooses to comply with the New Description Requirements, that Recipient\nwill, when thereafter distributing any copies of any such Earlier Licensed Copy, include a\nSupplement File having a section entitled Part 1 that contains a copy of the New\nDescription Requirements.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor greater certainty, the intent of Part 1 of the Supplement File is to provide a mechanism\n(if any) by which Subsequent Contributors must document changes that they make to the\nLicensed Work resulting in Subsequent Works. Part 1 of any Supplement File shall not be\nused to increase or reduce the scope of the license granted in Article 2 of this License\nor in any other way increase or decrease the rights and obligations of any Recipient, and\nshall at no time serve as the basis for terminating the License. Further, a Recipient can\nbe required to correct and change its documentation procedures to comply with Part 1 of\nthe Supplement File, but cannot be penalised with damages. Part 1 of any Supplement File\nis only binding on each Recipient of any Licensed Work to the extent Part 1 sets out the\nrequirements for documenting changes to the Initial Work or any Subsequent Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(e)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAn example of a set of requirements for documenting changes and contributions made by\nSubsequent Contributor is set out in Part 7 of Exhibit A of this License. Part 7 is a\nsample only and is not binding on Recipients, unless (subject to the earlier paragraphs of\nthis Section 3.8) those are the requirements that the Initial Contributor includes in Part\n1 of the Supplement File with the copies of the Initial Work distributed under this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUSE OF DISTRIBUTOR NAME.\nThe name of a Distributor may not be used by any other Distributor to endorse or promote\nthe Licensed Work or products derived from the Licensed Work, without prior written\npermission.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITED RECOGNITION OF INITIAL CONTRIBUTOR.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAs a modest attribution to the Initial Contributor, in the hope that its promotional value\nmay help justify the time, money and effort invested in writing the Initial Work, the\nInitial Contributor may include in Part 2 of the Supplement File a requirement that each\ntime an executable program resulting from the Initial Work or any Subsequent Work, or a\nprogram dependent thereon, is launched or run, a prominent display of the Initial\nContributor's attribution information must occur (the \"ATTRIBUTION INFORMATION\"). The\nAttribution Information must be included at the beginning of each Source Code file. For\ngreater certainty, the Initial Contributor may specify in the Supplement File that the\nabove attribution requirement only applies to an executable program resulting from the\nInitial Work or any Subsequent Work, but not a program dependent thereon. The intent is to\nprovide for reasonably modest attribution, therefore the Initial Contributor may not\nrequire Recipients to display, at any time, more than the following Attribution\nInformation: (a) a copyright notice including the name of the Initial Contributor; (b) a\nword or one phrase (not exceeding 10 words); (c) one digital image or graphic provided\nwith the Initial Work; and (d) a URL (collectively, the \"ATTRIBUTION LIMITS\").\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf no Supplement File exists, or no Attribution Information is set out in Part 2 of the\nSupplement File, then there are no requirements for Recipients to display any Attribution\nInformation of the Initial Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach Recipient acknowledges that all trademarks, service marks and/or trade names contained\nwithin Part 2 of the Supplement File distributed with the Licensed Work are the exclusive\nproperty of the Initial Contributor and may only be used with the permission of the\nInitial Contributor, or under circumstances otherwise permitted by law, or as expressly\nset out in this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor greater certainty, any description or attribution provisions contained within a Supplement\nFile may only be used to specify the nature of the description or attribution requirements, as\nthe case may be. Any provision in a Supplement File that otherwise purports to modify, vary,\nnullify or amend any right, obligation or representation contained herein shall be deemed void\nto that extent, and shall be of no force or effect.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOMMERCIAL USE AND INDEMNITY.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOMMERCIAL SERVICES.\nA Recipient (\"COMMERCIAL RECIPIENT\") may choose to offer, and to charge a fee for,\nwarranty, support, indemnity or liability obligations (collectively, \"SERVICES\") to\none or more other Recipients or Distributors. However, such Commercial Recipient may\ndo so only on that Commercial Recipient's own behalf, and not on behalf of any other\nDistributor or Recipient, and Commercial Recipient must make it clear than any such\nwarranty, support, indemnity or liability obligation(s) is/are offered by Commercial\nRecipient alone. At no time may Commercial Recipient use any Services to deny any\nparty the Licensed Work in Source Code or Executable form when so required under any\nof the other terms of this License. For greater certainty, this Section 4.1 does not\ndiminish any of the other terms of this License, including without limitation the\nobligation of the Commercial Recipient as a Distributor, when distributing any of the\nLicensed Work in Source Code or Executable form, to make such distribution\nroyalty-free (subject to the right to charge a fee of no more than the cost of\nphysically performing Source Code or Executable distribution (as the case may be)).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nINDEMNITY.\nCommercial distributors of software may accept certain responsibilities with respect to end\nusers, business partners and the like. While this License is intended to facilitate\nthe commercial use of the Licensed Work, the Distributor who includes any of the\nLicensed Work in a commercial product offering should do so in a manner which does not\ncreate potential liability for other Distributors. Therefore, if a Distributor\nincludes the Licensed Work in a commercial product offering or offers any Services,\nsuch Distributor (\"COMMERCIAL DISTRIBUTOR\") hereby agrees to defend and indemnify\nevery other Distributor or Subsequent Contributor (in each case an \"INDEMNIFIED\nPARTY\") against any losses, damages and costs (collectively \"LOSSES\") arising from\nclaims, lawsuits and other legal actions brought by a third party against the\nIndemnified Party to the extent caused by the acts or omissions of such Commercial\nDistributor in connection with its distribution of any of the Licensed Work in a\ncommercial product offering or in connection with any Services. The obligations in\nthis section do not apply to any claims or Losses relating to any actual or alleged\nintellectual property infringement. In order to qualify, an Indemnified Party must:\n(a) promptly notify the Commercial Distributor in writing of such claim; and (b) allow\nthe Commercial Distributor to control, and co-operate with the Commercial Distributor\nin, the defense and any related settlement negotiations. The Indemnified Party may\nparticipate in any such claim at its own expense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVERSIONS OF THE LICENSE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNEW VERSIONS.\nThe Initial Contributor may publish revised and/or new versions of the License from time to\ntime. Each version will be given a distinguishing version number.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEFFECT OF NEW VERSIONS.\nOnce the Licensed Work or any portion thereof has been published by Initial Contributor\nunder a particular version of the License, Recipient may choose to continue to use it\nunder the terms of that version. However, if a Recipient chooses to use the Licensed\nWork under the terms of any subsequent version of the License published by the Initial\nContributor, then from the date of making this choice, the Recipient must comply with\nthe terms of that subsequent version with respect to all further reproduction,\npreparation of derivative works, public display of, public performance of,\ndistribution and sublicensing by the Recipient in connection with the Licensed Work.\nNo one other than the Initial Contributor has the right to modify the terms applicable\nto the Licensed Work\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISCLAIMER OF WARRANTY.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGENERAL DISCLAIMER.\nEXCEPT AS EXPRESSLY SET FORTH IN THIS LICENSE, THE LICENSED WORK IS PROVIDED UNDER THIS\nLICENSE ON AN \"AS IS\" BASIS, WITHOUT ANY REPRESENTATION, WARRANTY, GUARANTEE,\nASSURANCE OR CONDITION OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT\nLIMITATION, WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR\nFITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF\nTHE LICENSED WORK IS WITH RECIPIENT. SHOULD ANY LICENSED WORK PROVE DEFECTIVE IN ANY\nRESPECT, RECIPIENT (NOT THE INITIAL CONTRIBUTOR OR ANY SUBSEQUENT CONTRIBUTOR) ASSUMES\nTHE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS CLAUSE CONSTITUTES AN\nESSENTIAL PART OF THIS LICENSE. NO USE OF ANY LICENSED WORK IS AUTHORIZED HEREUNDER\nEXCEPT UNDER THIS LICENSE INCLUDING WITHOUT LIMITATION THIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRESPONSIBILITY OF RECIPIENTS.\nEach Recipient is solely responsible for determining the appropriateness of using and\ndistributing the Licensed Work and assumes all risks associated with its exercise of\nrights under this License, including but not limited to the risks and costs of program\nerrors, compliance with applicable laws, damage to or loss of data, programs or\nequipment, and unavailability or interruption of operations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTERMINATION.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License shall continue until terminated in accordance with the express terms herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRecipient may choose to terminate this License automatically at any time.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License, including without limitation the rights granted hereunder to a particular\nRecipient, will terminate automatically if such Recipient is in material breach of any of the\nterms of this License and fails to cure such breach within sixty (60) days of becoming aware\nof the breach. Without limiting the foregoing, any material breach by such Recipient of any\nterm of any other License under which such Recipient is granted any rights to the Licensed\nWork shall constitute a material breach of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUpon termination of this License by or with respect to a particular Recipient for any reason, all\nrights granted hereunder and under any other License to that Recipient shall terminate.\nHowever, all sublicenses to the Licensed Work which were previously properly granted by such\nRecipient under a copy of this License (in each case, an \"Other License\" and in plural, \"Other\nLicenses\") shall survive any such termination of this License, including without limitation\nthe rights and obligations under such Other Licenses as set out in their respective Sections\n2, 3, 4, 5, 6, 7 and 8, mutatis mutandis, for so long as the respective sublicensees (i.e.\nother Recipients) remain in compliance with the terms of the copy of this License under which\nsuch sublicensees received rights to the Licensed Work. Any termination of such Other Licenses\nshall be pursuant to their respective Section 7, mutatis mutandis. Provisions which, by their\nnature, must remain in effect beyond the termination of this License shall survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUpon any termination of this License by or with respect to a particular Recipient, Sections 4.1,\n4.2, 6.1, 6.2, 7.4, 7.5, 8.1, and 8.2, together with all provisions of this License necessary\nfor the interpretation and enforcement of same, shall expressly survive such termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIN NO EVENT SHALL ANY OF INITIAL CONTRIBUTOR, ITS SUBSIDIARIES, OR AFFILIATES, OR ANY OF ITS OR\nTHEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, AND/OR AGENTS (AS THE CASE MAY BE), HAVE ANY\nLIABILITY FOR ANY DIRECT DAMAGES, INDIRECT DAMAGES, PUNITIVE DAMAGES, INCIDENTAL DAMAGES,\nSPECIAL DAMAGES, EXEMPLARY DAMAGES, CONSEQUENTIAL DAMAGES OR ANY OTHER DAMAGES WHATSOEVER\n(INCLUDING WITHOUT LIMITATION LOSS OF USE, DATA OR PROFITS, OR ANY OTHER LOSS ARISING OUT OF\nOR IN ANY WAY RELATED TO THE USE, INABILITY TO USE, UNAUTHORIZED USE, PERFORMANCE, OR\nNON-PERFORMANCE OF THE LICENSED WORK OR ANY PART THEREOF OR THE PROVISION OF OR FAILURE TO\nPROVIDE SUPPORT SERVICES, OR THAT RESULT FROM ERRORS, DEFECTS, OMISSIONS, DELAYS IN OPERATION\nOR TRANSMISSION, OR ANY OTHER FAILURE OF PERFORMANCE), HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nIN RELATION TO OR ARISING IN ANY WAY OUT OF THIS LICENSE OR THE USE OR DISTRIBUTION OF THE\nLICENSED WORK OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR\nDEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW\nPROHIBITS SUCH LIMITATION. THIS CLAUSE CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE\nOF ANY LICENSED WORK IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS LICENSE INCLUDING WITHOUT\nLIMITATION THE LIMITATIONS SET FORTH IN THIS SECTION 8.1.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEXCEPT AS EXPRESSLY SET FORTH IN THIS LICENSE, EACH RECIPIENT SHALL NOT HAVE ANY LIABILITY FOR\nANY EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE\nLICENSED WORK OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR\nDEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW\nPROHIBITS SUCH LIMITATION.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGOVERNING LAW AND LEGAL ACTION.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License shall be governed by and construed in accordance with the laws of the Governing\nJurisdiction assigned in Part 3 of Exhibit A, without regard to its conflict of law\nprovisions. No party may bring a legal action under this License more than one year after the\ncause of the action arose. Each party waives its rights (if any) to a jury trial in any\nlitigation arising under this License. Note that if the Governing Jurisdiction is not assigned\nin Part 3 of Exhibit A, then the Governing Jurisdiction shall be the State of New York.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe courts of the Governing Jurisdiction shall have jurisdiction, but not exclusive jurisdiction,\nto entertain and determine all disputes and claims, whether for specific performance,\ninjunction, damages or otherwise, both at law and in equity, arising out of or in any way\nrelating to this License, including without limitation, the legality, validity, existence and\nenforceability of this License. Each party to this License hereby irrevocably attorns to and\naccepts the jurisdiction of the courts of the Governing Jurisdiction for such purposes.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nExcept as expressly set forth elsewhere herein, in the event of any action or proceeding brought\nby any party against another under this License the prevailing party shall be entitled to\nrecover all costs and expenses including the fees of its attorneys in such action or\nproceeding in such amount as the court may adjudge reasonable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMISCELLANEOUS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe obligations imposed by this License are for the benefit of the Initial Contributor and any\nRecipient, and each Recipient acknowledges and agrees that the Initial Contributor and/or any\nother Recipient may enforce the terms and conditions of this License against any\nRecipient.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License represents the complete agreement concerning subject matter hereof, and supersedes\nand cancels all previous oral and written communications, representations, agreements and\nunderstandings between the parties with respect to the subject matter hereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe application of the United Nations Convention on Contracts for the International Sale of Goods\nis expressly excluded.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe language in all parts of this License shall be in all cases construed simply according to its\nfair meaning, and not strictly for or against any of the parties hereto. Any law or regulation\nwhich provides that the language of a contract shall be construed against the drafter shall\nnot apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf any provision of this License is invalid or unenforceable under the laws of the Governing\nJurisdiction, it shall not affect the validity or enforceability of the remainder of the terms\nof this License, and without further action by the parties hereto, such provision shall be\nreformed to the minimum extent necessary to make such provision valid and enforceable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe paragraph headings of this License are for reference and convenience only and are not a part\nof this License, and they shall have no effect upon the construction or interpretation of any\npart hereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach of the terms \"including\", \"include\" and \"includes\", when used in this License, is not\nlimiting whether or not non-limiting language (such as \"without limitation\" or \"but not\nlimited to\" or words of similar import) is used with reference thereto.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe parties hereto acknowledge they have expressly required that this License and notices\nrelating thereto be drafted in the English language.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\n//***THE LICENSE TERMS END HERE (OTHER THAN AS SET OUT IN EXHIBIT A).***//\nEXHIBIT A (to the Adaptive Public License)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 1:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " INITIAL CONTRIBUTOR AND DESIGNATED WEB SITE\nThe Initial Contributor is:\n________________________________________________\n[Enter full name of Initial Contributor]\nAddress of Initial Contributor:\n________________________________________________\n________________________________________________\n________________________________________________\n[Enter address above]\nThe Designated Web Site is:\n________________________________________________\n[Enter URL for Designated Web Site of Initial Contributor]\nNOTE: The Initial Contributor is to complete this Part 1, along with Parts 2, 3, and 5, and, if\napplicable, Parts 4 and 6.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 2:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " INITIAL WORK\nThe Initial Work comprises the computer program(s) distributed by the Initial Contributor having the\nfollowing title(s): _______________________________________________.\nThe date on which the Initial Work was first available under this License: _________________\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 3:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " GOVERNING JURISDICTION\nFor the purposes of this License, the Governing Jurisdiction is\n_________________________________________________.\n[Initial Contributor to Enter Governing Jurisdiction here]\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 4:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " THIRD PARTIES\nFor the purposes of this License, \"Third Party\" has the definition set forth below in the ONE\nparagraph selected by the Initial Contributor from paragraphs A, B, C, D and E when the Initial\nWork is distributed or otherwise made available by the Initial Contributor. To select one of the\nfollowing paragraphs, the Initial Contributor must place an \"X\" or \"x\" in the selection box\nalongside the one respective paragraph selected.\nSELECTION\nBOX PARAGRAPH\n[ ] A. \"THIRD PARTY\" means any third party.\n[ ] B. \"THIRD PARTY\" means any third party except for any of the following: (a) a wholly owned\nsubsidiary of the Subsequent Contributor in question; (b) a legal entity (the \"PARENT\") that\nwholly owns the Subsequent Contributor in question; or (c) a wholly owned subsidiary of the wholly\nowned subsidiary in (a) or of the Parent in (b).\n[ ] C. \"THIRD PARTY\" means any third party except for any of the following: (a) any Person directly\nor indirectly owning a majority of the voting interest in the Subsequent Contributor or (b) any\nPerson in which the Subsequent Contributor directly or indirectly owns a majority voting\ninterest.\n[ ] D. \"THIRD PARTY\" means any third party except for any Person directly or indirectly controlled by\nthe Subsequent Contributor. For purposes of this definition, \"control\" shall mean the power to\ndirect or cause the direction of, the management and policies of such Person whether through the\nownership of voting interests, by contract, or otherwise.\n[ ] E. \"THIRD PARTY\" means any third party except for any Person directly or indirectly controlling,\ncontrolled by, or under common control with the Subsequent Contributor. For purposes of this\ndefinition, \"control\" shall mean the power to direct or cause the direction of, the management and\npolicies of such Person whether through the ownership of voting interests, by contract, or\notherwise.\nThe default definition of \"THIRD PARTY\" is the definition set forth in paragraph A, if NONE OR\nMORE THAN ONE of paragraphs A, B, C, D or E in this Part 4 are selected by the Initial\nContributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 5:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " NOTICE\nTHE LICENSED WORK IS PROVIDED UNDER THE TERMS OF THE ADAPTIVE PUBLIC LICENSE (\"LICENSE\") AS FIRST\nCOMPLETED BY: ______________________ [Insert the name of the Initial Contributor here]. ANY USE,\nPUBLIC DISPLAY, PUBLIC PERFORMANCE, REPRODUCTION OR DISTRIBUTION OF, OR PREPARATION OF DERIVATIVE\nWORKS BASED ON, THE LICENSED WORK CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS LICENSE AND ITS\nTERMS, WHETHER OR NOT SUCH RECIPIENT READS THE TERMS OF THE LICENSE. \"LICENSED WORK\" AND\n\"RECIPIENT\" ARE DEFINED IN THE LICENSE. A COPY OF THE LICENSE IS LOCATED IN THE TEXT FILE ENTITLED\n\"LICENSE.TXT\" ACCOMPANYING THE CONTENTS OF THIS FILE. IF A COPY OF THE LICENSE DOES NOT ACCOMPANY\nTHIS FILE, A COPY OF THE LICENSE MAY ALSO BE OBTAINED AT THE FOLLOWING WEB SITE:\n___________________________________________________[Insert Initial Contributor's Designated Web\nSite here]\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY\nKIND, either express or implied. See the License for the specific language governing rights and\nlimitations under the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 6:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " PATENT LICENSING TERMS\nFor the purposes of this License, paragraphs A, B, C, D and E of this Part 6 of Exhibit A are only\nincorporated and form part of the terms of the License if the Initial Contributor places an \"X\" or\n\"x\" in the selection box alongside the YES answer to the question immediately below.\nIs this a Patents-Included License pursuant to Section 2.2 of the License?\nYES [ ]\nNO [ ]\nBy default, if YES is not selected by the Initial Contributor, the answer is NO.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "A."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor the purposes of the paragraphs in this Part 6 of Exhibit A, \"LICENSABLE\" means having the\nright to grant, to the maximum extent possible, whether at the time of the initial grant\nor subsequently acquired, any and all of the rights granted herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "B."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Initial Contributor hereby grants all Recipients a world-wide, royalty-free,\nnon-exclusive license, subject to third party intellectual property claims, under patent\nclaim(s) Licensable by the Initial Contributor that are or would be infringed by the\nmaking, using, selling, offering for sale, having made, importing, exporting, transfer or\ndisposal of such Initial Work or any portion thereof. Notwithstanding the foregoing, no\npatent license is granted under this Paragraph B by the Initial Contributor: (1) for any\ncode that the Initial Contributor deletes from the Initial Work (or any portion thereof)\ndistributed by the Initial Contributor prior to such distribution; (2) for any\nModifications made to the Initial Work (or any portion thereof) by any other Person; or\n(3) separate from the Initial Work (or portions thereof) distributed or made available by\nthe Initial Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "C."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffective upon distribution by a Subsequent Contributor to a Third Party of any Modifications\nmade by that Subsequent Contributor, such Subsequent Contributor hereby grants all\nRecipients a world-wide, royalty-free, non-exclusive license, subject to third party\nintellectual property claims, under patent claim(s) Licensable by such Subsequent\nContributor that are or would be infringed by the making, using, selling, offering for\nsale, having made, importing, exporting, transfer or disposal of any such Modifications\nmade by that Subsequent Contributor alone and/or in combination with its Subsequent Work\n(or portions of such combination) to make, use, sell, offer for sale, have made, import,\nexport, transfer and otherwise dispose of:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(1)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nModifications made by that Subsequent Contributor (or portions thereof); and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(2)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe combination of Modifications made by that Subsequent Contributor with its Subsequent Work\n(or portions of such combination);\n(collectively and in each case, the \"SUBSEQUENT CONTRIBUTOR VERSION\").\nNotwithstanding the foregoing, no patent license is granted under this Paragraph C by\nsuch Subsequent Contributor: (1) for any code that such Subsequent Contributor\ndeletes from the Subsequent Contributor Version (or any portion thereof)\ndistributed by the Subsequent Contributor prior to such distribution; (2) for any\nModifications made to the Subsequent Contributor Version (or any portion thereof)\nby any other Person; or (3) separate from the Subsequent Contributor Version (or\nportions thereof) distributed or made available by the Subsequent Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "D."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffective upon distribution of any Licensed Work by a Distributor to a Third Party, such\nDistributor hereby grants all Recipients a world-wide, royalty-free, non-exclusive\nlicense, subject to third party intellectual property claims, under patent claim(s)\nLicensable by such Distributor that are or would be infringed by the making, using,\nselling, offering for sale, having made, importing, exporting, transfer or disposal of any\nsuch Licensed Work distributed by such Distributor, to make, use, sell, offer for sale,\nhave made, import, export, transfer and otherwise dispose of such Licensed Work or\nportions thereof (collectively and in each case, the \"DISTRIBUTOR VERSION\").\nNotwithstanding the foregoing, no patent license is granted under this Paragraph D by such\nDistributor: (1) for any code that such Distributor deletes from the Distributor Version\n(or any portion thereof) distributed by the Distributor prior to such distribution; (2)\nfor any Modifications made to the Distributor Version (or any portion thereof) by any\nother Person; or (3) separate from the Distributor Version (or portions thereof)\ndistributed or made available by the Distributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "E."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf Recipient institutes patent litigation against another Recipient (a \"USER\") with respect\nto a patent applicable to a computer program or software (including a cross-claim or\ncounterclaim in a lawsuit, and whether or not any of the patent claims are directed to a\nsystem, method, process, apparatus, device, product, article of manufacture or any other\nform of patent claim), then any patent or copyright license granted by that User to such\nRecipient under this License or any other copy of this License shall terminate. The\ntermination shall be effective ninety (90) days after notice of termination from User to\nRecipient, unless the Recipient withdraws the patent litigation claim before the end of\nthe ninety (90) day period. To be effective, any such notice of license termination must\ninclude a specific list of applicable patents and/or a copy of the copyrighted work of\nUser that User alleges will be infringed by Recipient upon License termination. License\ntermination is only effective with respect to patents and/or copyrights for which proper\nnotice has been given.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "PART 7:"}], "pattern": ".{0,20}"}, {"tag": "text", "content": " SAMPLE REQUIREMENTS FOR THE DESCRIPTION OF DISTRIBUTED MODIFICATIONS\nEach Subsequent Contributor (including the Initial Contributor where the Initial Contributor\nqualifies as a Subsequent Contributor) is invited (but not required) to cause each Subsequent Work\ncreated or contributed to by that Subsequent Contributor to contain a file documenting the changes\nsuch Subsequent Contributor made to create that Subsequent Work and the date of any change.\n//***EXHIBIT A ENDS HERE.***//\n"}]}, {"tag": "text", "content": "\n"}]