[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nAPPLE PUBLIC SOURCE LICENSE\nVersion 2.0 - August 6, 2003\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nPlease read this License carefully before downloading this software. By downloading or using this\nsoftware, you are agreeing to be bound by the terms of this License. If you do not or cannot agree to\nthe terms of this License, please do not download or use the software.\nApple Note: In January 2007, Apple changed its corporate name from \"Apple Computer, Inc.\" to\n\"Apple Inc.\" This change has been reflected below and copyright years updated, but no other\nchanges have been made to the APSL 2.0.\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral; Definitions. This License applies to any program or other work which Apple Inc.\n(\"Apple\") makes publicly available and which contains a notice placed by Apple\nidentifying such program or work as \"Original Code\" and stating that it is subject\nto the terms of this Apple Public Source License version 2.0 (\"License\"). As used in\nthis License:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Applicable Patent Rights\" mean: (a) in the case where Apple is the grantor of\nrights, (i) claims of patents that are now or hereafter acquired, owned by or assigned to\nApple and (ii) that cover subject matter contained in the Original Code, but only to the\nextent necessary to use, reproduce and/or distribute the Original Code without\ninfringement; and (b) in the case where You are the grantor of rights, (i) claims of\npatents that are now or hereafter acquired, owned by or assigned to You and (ii) that\ncover subject matter in Your Modifications, taken alone or in combination with Original\nCode.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means any person or entity that creates or contributes to the\ncreation of Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Covered Code\" means the Original Code, Modifications, the combination of Original\nCode and any Modifications, and/or any respective portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Externally Deploy\" means: (a) to sublicense, distribute or otherwise make Covered\nCode available, directly or indirectly, to anyone other than You; and/or (b) to use\nCovered Code, alone or as part of a Larger Work, in any way to provide a service,\nincluding but not limited to delivery of content, through electronic communication with a\nclient other than You.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work which combines Covered Code or portions thereof with\ncode not governed by the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" mean any addition to, deletion from, and/or change to, the\nsubstance and/or structure of the Original Code, any previous Modifications, the\ncombination of Original Code and any previous Modifications, and/or any respective\nportions thereof. When code is released as a series of files, a Modification is: (a) any\naddition to or deletion from the contents of a file containing Covered Code; and/or (b)\nany new file or other representation of computer program statements that contains any part\nof Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Code\" means (a) the Source Code of a program or other work as originally\nmade available by Apple under this License, including the Source Code of any updates or\nupgrades to such programs or works made available by Apple under this License, and that\nhas been expressly identified by Apple as such in the header file(s) of such work; and (b)\nthe object code compiled from such Source Code and originally made available by Apple\nunder this License\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" means the human readable form of a program or other work that is\nsuitable for making modifications to it, including all modules it contains, plus any\nassociated interface definition files, scripts used to control compilation and\ninstallation of an executable (object code).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" or \"Your\" means an individual or a legal entity exercising rights\nunder this License. For legal entities, \"You\" or \"Your\" includes any\nentity which controls, is controlled by, or is under common control with, You, where\n\"control\" means (a) the power, direct or indirect, to cause the direction or\nmanagement of such entity, whether by contract or otherwise, or (b) ownership of fifty\npercent (50%) or more of the outstanding shares or beneficial ownership of such\nentity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPermitted Uses; Conditions & Restrictions. Subject to the terms and conditions of this\nLicense, Apple hereby grants You, effective on the date You accept this License and download\nthe Original Code, a world-wide, royalty-free, non-exclusive license, to the extent of\nApple's Applicable Patent Rights and copyrights covering the Original Code, to do the\nfollowing:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUnmodified Code. You may use, reproduce, display, perform, internally distribute within Your\norganization, and Externally Deploy verbatim, unmodified copies of the Original Code, for\ncommercial or non-commercial purposes, provided that in each instance:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must retain and reproduce in all copies of Original Code the copyright and other\nproprietary notices and disclaimers of Apple as they appear in the Original Code, and\nkeep intact all notices in the Original Code that refer to this License; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must include a copy of this License with every copy of Source Code of Covered Code\nand documentation You distribute or Externally Deploy, and You may not offer or impose\nany terms on such Source Code that alter or restrict this License or the\nrecipients' rights hereunder, except as permitted under Section 6.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nModified Code. You may modify Covered Code and use, reproduce, display, perform, internally\ndistribute within Your organization, and Externally Deploy Your Modifications and Covered\nCode, for commercial or non-commercial purposes, provided that in each instance You also\nmeet all of these conditions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must satisfy all the conditions of Section 2.1 with respect to the Source Code of the\nCovered Code;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must duplicate, to the extent it does not already exist, the notice in Exhibit A in\neach file of the Source Code of all Your Modifications, and cause the modified files\nto carry prominent notices stating that You changed the files and the date of any\nchange; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You Externally Deploy Your Modifications, You must make Source Code of all Your\nExternally Deployed Modifications either available to those to whom You have\nExternally Deployed Your Modifications, or publicly available. Source Code of Your\nExternally Deployed Modifications must be released under the terms set forth in this\nLicense, including the license grants set forth in Section 3 below, for as long as you\nExternally Deploy the Covered Code or twelve (12) months from the date of initial\nExternal Deployment, whichever is longer. You should preferably distribute the Source\nCode of Your Externally Deployed Modifications electronically (e.g. download from a\nweb site).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Versions. In addition, if You Externally Deploy Covered Code\n(Original Code and/or Modifications) in object code, executable form only, You must\ninclude a prominent notice, in the code itself as well as in related documentation,\nstating that Source Code of the Covered Code is available under the terms of this License\nwith information on how and where to obtain such Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Rights. You expressly acknowledge and agree that although Apple and each\nContributor grants the licenses to their respective portions of the Covered Code set forth\nherein, no assurances are provided by Apple or any Contributor that the Covered Code does\nnot infringe the patent or other intellectual property rights of any other entity. Apple\nand each Contributor disclaim any liability to You for claims brought by any other entity\nbased on infringement of intellectual property rights or otherwise. As a condition to\nexercising the rights and licenses granted hereunder, You hereby assume sole\nresponsibility to secure any other intellectual property rights needed, if any. For\nexample, if a third party patent license is required to allow You to distribute the\nCovered Code, it is Your responsibility to acquire that license before distributing the\nCovered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYour Grants. In consideration of, and as a condition to, the licenses granted to You under this\nLicense, You hereby grant to any person or entity receiving or distributing Covered Code under\nthis License a non-exclusive, royalty-free, perpetual, irrevocable license, under Your\nApplicable Patent Rights and other intellectual property rights (other than patent) owned or\ncontrolled by You, to use, reproduce, display, perform, modify, sublicense, distribute and\nExternally Deploy Your Modifications of the same scope and extent as Apple's licenses\nunder Sections 2.1 and 2.2 above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works. You may create a Larger Work by combining Covered Code with other code not governed\nby the terms of this License and distribute the Larger Work as a single product. In each such\ninstance, You must make sure the requirements of this License are fulfilled for the Covered\nCode or any portion thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitations on Patent License. Except as expressly stated in Section 2, no other patent rights,\nexpress or implied, are granted by Apple herein. Modifications and/or Larger Works may require\nadditional patent licenses from Apple which Apple may grant in its sole discretion.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdditional Terms. You may choose to offer, and to charge a fee for, warranty, support, indemnity\nor liability obligations and/or other rights consistent with the scope of the license granted\nherein (\"Additional Terms\") to one or more recipients of Covered Code. However, You\nmay do so only on Your own behalf and as Your sole responsibility, and not on behalf of Apple\nor any Contributor. You must obtain the recipient's agreement that any such Additional\nTerms are offered by You alone, and You hereby agree to indemnify, defend and hold Apple and\nevery Contributor harmless for any liability incurred by or claims asserted against Apple or\nsuch Contributor by reason of any such Additional Terms.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License. Apple may publish revised and/or new versions of this License from time\nto time. Each version will be given a distinguishing version number. Once Original Code has\nbeen published under a particular version of this License, You may continue to use it under\nthe terms of that version. You may also choose to use such Original Code under the terms of\nany subsequent version of this License published by Apple. No one other than Apple has the\nright to modify the terms applicable to Covered Code created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNO WARRANTY OR SUPPORT. The Covered Code may contain in whole or in part pre-release, untested,\nor not fully tested works. The Covered Code may contain errors that could cause failures or\nloss of data, and may be incomplete or contain inaccuracies. You expressly acknowledge and\nagree that use of the Covered Code, or any portion thereof, is at Your sole and entire risk.\nTHE COVERED CODE IS PROVIDED \"AS IS\" AND WITHOUT WARRANTY, UPGRADES OR SUPPORT OF\nANY KIND AND APPLE AND APPLE'S LICENSOR(S) (COLLECTIVELY REFERRED TO AS \"APPLE\"\nFOR THE PURPOSES OF SECTIONS 8 AND 9) AND ALL CONTRIBUTORS EXPRESSLY DISCLAIM ALL WARRANTIES\nAND/OR CONDITIONS, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES\nAND/OR CONDITIONS OF MERCHANTABILITY, OF SATISFACTORY QUALITY, OF FITNESS FOR A PARTICULAR\nPURPOSE, OF ACCURACY, OF QUIET ENJOYMENT, AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. APPLE AND\nEACH CONTRIBUTOR DOES NOT WARRANT AGAINST INTERFERENCE WITH YOUR ENJOYMENT OF THE COVERED\nCODE, THAT THE FUNCTIONS CONTAINED IN THE COVERED CODE WILL MEET YOUR REQUIREMENTS, THAT THE\nOPERATION OF THE COVERED CODE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE\nCOVERED CODE WILL BE CORRECTED. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY APPLE, AN\nAPPLE AUTHORIZED REPRESENTATIVE OR ANY CONTRIBUTOR SHALL CREATE A WARRANTY. You acknowledge\nthat the Covered Code is not intended for use in the operation of nuclear facilities, aircraft\nnavigation, communication systems, or air traffic control machines in which case the failure\nof the Covered Code could lead to death, personal injury, or severe physical or environmental\ndamage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY. TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT SHALL APPLE OR ANY\nCONTRIBUTOR BE LIABLE FOR ANY INCIDENTAL, SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF OR RELATING TO THIS LICENSE OR YOUR USE OR INABILITY TO USE THE COVERED CODE, OR ANY\nPORTION THEREOF, WHETHER UNDER A THEORY OF CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE),\nPRODUCTS LIABILITY OR OTHERWISE, EVEN IF APPLE OR SUCH CONTRIBUTOR HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES AND NOTWITHSTANDING THE FAILURE OF ESSENTIAL PURPOSE OF ANY\nREMEDY. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OF LIABILITY OF INCIDENTAL OR\nCONSEQUENTIAL DAMAGES, SO THIS LIMITATION MAY NOT APPLY TO YOU. In no event shall Apple's\ntotal liability to You for all damages (other than as may be required by applicable law) under\nthis License exceed the amount of fifty dollars ($50.00).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademarks. This License does not grant any rights to use the trademarks or trade names\n\"Apple\", \"Mac\", \"Mac OS\", \"QuickTime\", \"QuickTime\nStreaming Server\" or any other trademarks, service marks, logos or trade names belonging\nto Apple (collectively \"Apple Marks\") or to any trademark, service mark, logo or\ntrade name belonging to any Contributor. You agree not to use any Apple Marks in or as part of\nthe name of products derived from the Original Code or to endorse or promote products derived\nfrom the Original Code other than as expressly permitted by and in strict compliance at all\ntimes with Apple's third party trademark usage guidelines which are posted at\nhttp://www.apple.com/legal/guidelinesfor3rdparties.html.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOwnership. Subject to the licenses granted under this License, each Contributor retains all\nrights, title and interest in and to any Modifications made by such Contributor. Apple retains\nall rights, title and interest in and to the Original Code and any Modifications made by or on\nbehalf of Apple (\"Apple Modifications\"), and such Apple Modifications will not be\nautomatically subject to this License. Apple may, at its sole discretion, choose to license\nsuch Apple Modifications under this License, or on different terms from those contained in\nthis License or may choose not to license them at all.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination. This License and the rights granted hereunder will terminate:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nautomatically without notice from Apple if You fail to comply with any term(s) of this\nLicense and fail to cure such breach within 30 days of becoming aware of such\nbreach;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nimmediately in the event of the circumstances described in Section 13.5(b); or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nautomatically without notice from Apple if You, at any time during the term of this\nLicense, commence an action for patent infringement against Apple; provided that Apple\ndid not first commence an action for patent infringement against You in that\ninstance.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of Termination. Upon termination, You agree to immediately stop any further use,\nreproduction, modification, sublicensing and distribution of the Covered Code. All\nsublicenses to the Covered Code which have been properly granted prior to termination\nshall survive any termination of this License. Provisions which, by their nature, should\nremain in effect beyond the termination of this License shall survive, including but not\nlimited to Sections 3, 5, 8, 9, 10, 11, 12.2 and 13. No party will be liable to any other\nfor compensation, indemnity or damages of any sort solely as a result of terminating this\nLicense in accordance with its terms, and termination of this License will be without\nprejudice to any other right or remedy of any party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGovernment End Users. The Covered Code is a \"commercial item\" as defined in FAR\n2.101. Government software and technical data rights in the Covered Code include only\nthose rights customarily provided to the public as defined in this License. This customary\ncommercial license in technical data and software is provided in accordance with FAR\n12.211 (Technical Data) and 12.212 (Computer Software) and, for Department of Defense\npurchases, DFAR 252.227-7015 (Technical Data -- Commercial Items) and 227.7202-3 (Rights\nin Commercial Computer Software or Computer Software Documentation). Accordingly, all U.S.\nGovernment End Users acquire Covered Code with only those rights set forth herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRelationship of Parties. This License will not be construed as creating an agency,\npartnership, joint venture or any other form of legal association between or among You,\nApple or any Contributor, and You will not represent to the contrary, whether expressly,\nby implication, appearance or otherwise.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIndependent Development. Nothing in this License will impair Apple's right to acquire,\nlicense, develop, have others develop for it, market and/or distribute technology or\nproducts that perform the same or similar functions as, or otherwise compete with,\nModifications, Larger Works, technology or products that You may develop, produce, market\nor distribute.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWaiver; Construction. Failure by Apple or any Contributor to enforce any provision of this\nLicense will not be deemed a waiver of future enforcement of that or any other provision.\nAny law or regulation which provides that the language of a contract shall be construed\nagainst the drafter will not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSeverability. (a) If for any reason a court of competent jurisdiction finds any provision of\nthis License, or portion thereof, to be unenforceable, that provision of the License will\nbe enforced to the maximum extent permissible so as to effect the economic benefits and\nintent of the parties, and the remainder of this License will continue in full force and\neffect. (b) Notwithstanding the foregoing, if applicable law prohibits or restricts You\nfrom fully and/or specifically complying with Sections 2 and/or 3 or prevents the\nenforceability of either of those Sections, this License will immediately terminate and\nYou must immediately discontinue any use of the Covered Code and destroy all copies of it\nthat are in your possession or control.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.6"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDispute Resolution. Any litigation or other dispute resolution between You and Apple relating\nto this License shall take place in the Northern District of California, and You and Apple\nhereby consent to the personal jurisdiction of, and venue in, the state and federal courts\nwithin that District with respect to this License. The application of the United Nations\nConvention on Contracts for the International Sale of Goods is expressly excluded.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.7"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEntire Agreement; Governing Law. This License constitutes the entire agreement between the\nparties with respect to the subject matter hereof. This License shall be governed by the\nlaws of the United States and the State of California, except that body of California law\nconcerning conflicts of law.\nWhere You are located in the province of Quebec, Canada, the following clause applies: The parties hereby\nconfirm that they have requested that this License and all related documents be drafted in English.\nLes parties ont exigé que le présent contrat et tous les documents connexes soient\nrédigés en anglais.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEXHIBIT A.\n\"Portions Copyright (c) 1999-2007 Apple Inc. All Rights Reserved.\nThis file contains Original Code and/or Modifications of Original Code as defined in and that are subject\nto the Apple Public Source License Version 2.0 (the 'License'). You may not use this file\nexcept in compliance with the License. Please obtain a copy of the License at\nhttp://www.opensource.apple.com/apsl/ and read it before using this file.\nThe Original Code and all software distributed under the License are distributed on an 'AS IS'\nbasis, WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, AND APPLE HEREBY DISCLAIMS ALL SUCH\nWARRANTIES, INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR\nPURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the License for the specific language\ngoverning rights and limitations under the License.\"\n"}]}, {"tag": "text", "content": "\n"}]