[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nBitTorrent Open Source License\nVersion 1.1\n"}]}, {"tag": "text", "content": "\nThis BitTorrent Open Source License (the \"License\") applies to the BitTorrent client and\nrelated software products as well as any updates or maintenance releases of that software\n(\"BitTorrent Products\") that are distributed by BitTorrent, Inc. (\"Licensor\"). Any\nBitTorrent Product licensed pursuant to this License is a Licensed Product. Licensed Product, in its\nentirety, is protected by U.S. copyright law. This License identifies the terms under which you may\nuse, copy, distribute or modify Licensed Product.\nPreamble\nThis Preamble is intended to describe, in plain English, the nature and scope of this License. However,\nthis Preamble is not a part of this license. The legal effect of this License is dependent only upon\nthe terms of the License and not this Preamble.\nThis License complies with the Open Source Definition and is derived from the Jabber Open Source License\n1.0 (the \"JOSL\"), which has been approved by Open Source Initiative. Sections 4(c) and\n4(f)(iii) from the JOSL have been deleted.\nThis License provides that:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may use or give away the Licensed Product, alone or as a component of an aggregate software\ndistribution containing programs from several different sources. No royalty or other fee is\nrequired.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nBoth Source Code and executable versions of the Licensed Product, including Modifications made by\nprevious Contributors, are available for your use. (The terms \"Licensed Product,\"\n\"Modifications,\" \"Contributors\" and \"Source Code\" are defined in\nthe License.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou are allowed to make Modifications to the Licensed Product, and you can create Derivative\nWorks from it. (The term \"Derivative Works\" is defined in the License.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nBy accepting the Licensed Product under the provisions of this License, you agree that any\nModifications you make to the Licensed Product and then distribute are governed by the\nprovisions of this License. In particular, you must make the Source Code of your Modifications\navailable to others free of charge and without a royalty.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may sell, accept donations or otherwise receive compensation for executable versions of a\nLicensed Product, without paying a royalty or other fee to the Licensor or any Contributor,\nprovided that such executable versions contain your or another Contributor's material\nModifications. For the avoidance of doubt, to the extent your executable version of a Licensed\nProduct does not contain your or another Contributor's material Modifications, you may\nnot sell, accept donations or otherwise receive compensation for such executable.\nYou may use the Licensed Product for any purpose, but the Licensor is not providing you any\nwarranty whatsoever, nor is the Licensor accepting any liability in the event that the\nLicensed Product doesn't work properly or causes you any injury or damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf you sublicense the Licensed Product or Derivative Works, you may charge fees for warranty or\nsupport, or for accepting indemnity or liability obligations to your customers. You cannot\ncharge for, sell, accept donations or otherwise receive compensation for the Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf you assert any patent claims against the Licensor relating to the Licensed Product, or if you\nbreach any terms of the License, your rights to the Licensed Product under this License\nautomatically terminate.\nYou may use this License to distribute your own Derivative Works, in which case the provisions of this\nLicense will apply to your Derivative Works just as they do to the original Licensed Product.\nAlternatively, you may distribute your Derivative Works under any other OSI-approved Open Source license,\nor under a proprietary license of your choice. If you use any license other than this License,\nhowever, you must continue to fulfill the requirements of this License (including the provisions\nrelating to publishing the Source Code) for those portions of your Derivative Works that consist of\nthe Licensed Product, including the files containing\nModifications.\nNew versions of this License may be published from time to time in connection with new versions of a\nLicensed Product or otherwise. You may choose to continue to use the license terms in this version of\nthe License for the Licensed Product that was originally licensed hereunder, however, the new versions\nof this License will at all times apply to new versions of the Licensed Product released by Licensor\nafter the release of the new version of this License. Only the Licensor has the right to change the\nLicense terms as they apply to the Licensed Product.\nThis License relies on precise definitions for certain terms. Those terms are defined when they are first\nused, and the definitions are repeated for your convenience in a Glossary at the end of the\nLicense.\nLicense Terms\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of License From Licensor. Subject to the terms and conditions of this License, Licensor\nhereby grants you a world-wide, royalty-free, non-exclusive license, subject to third party\nintellectual property claims, to do the following:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUse, reproduce, modify, display, perform, sublicense and distribute any Modifications created\nby a Contributor or portions thereof, in both Source Code or as an executable program,\neither on an unmodified basis or as part of Derivative Works.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUnder claims of patents now or hereafter owned or controlled by Contributor, to make, use,\nsell, offer for sale, have made, and/or otherwise dispose of Modifications or portions\nthereof, but solely to the extent that any such claim is necessary to enable you to make,\nuse, sell, offer for sale, have made, and/or otherwise dispose of Modifications or\nportions thereof or Derivative Works thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of License to Modifications From Contributor. \"Modifications\" means any additions\nto or deletions from the substance or structure of (i) a file containing a Licensed Product,\nor (ii) any new file that contains any part of a Licensed Product. Hereinafter in this\nLicense, the term \"Licensed Product\" shall include all previous Modifications that\nyou receive from any Contributor. Subject to the terms and conditions of this License, By\napplication of the provisions in Section 4(a) below, each person or entity who created or\ncontributed to the creation of, and distributed, a Modification (a \"Contributor\")\nhereby grants you a world-wide, royalty-free, non-exclusive license, subject to third party\nintellectual property claims, to do the following:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUse, reproduce, modify, display, perform, sublicense and distribute any Modifications created\nby such Contributor or portions thereof, in both Source Code or as an executable program,\neither on an unmodified basis or as part of Derivative Works.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUnder claims of patents now or hereafter owned or controlled by Contributor, to make, use,\nsell, offer for sale, have made, and/or otherwise dispose of Modifications or portions\nthereof, but solely to the extent that any such claim is necessary to enable you to make,\nuse, sell, offer for sale, have made, and/or otherwise dispose of Modifications or\nportions thereof or Derivative Works thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nExclusions From License Grant. Nothing in this License shall be deemed to grant any rights to\ntrademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor\nor any Contributor except as expressly stated herein. No patent license is granted separate\nfrom the Licensed Product, for code that you delete from the Licensed Product, or for\ncombinations of the Licensed Product with other software or hardware. No right is granted to\nthe trademarks of Licensor or any Contributor even if such marks are included in the Licensed\nProduct. Nothing in this License shall be interpreted to prohibit Licensor from licensing\nunder different terms from this License any code that Licensor otherwise would have a right to\nlicense. As an express condition for your use of the Licensed Product, you hereby agree that\nyou will not, without the prior written consent of Licensor, use any trademarks, copyrights,\npatents, trade secrets or any other intellectual property of Licensor or any Contributor\nexcept as expressly stated herein. For the avoidance of doubt and without limiting the\nforegoing, you hereby agree that you will not use or display any trademark of Licensor or any\nContributor in any domain name, directory filepath, advertisement, link or other reference to\nyou in any manner or in any media.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYour Obligations Regarding Distribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of This License to Your Modifications. As an express condition for your use of\nthe Licensed Product, you hereby agree that any Modifications that you create or to which\nyou contribute, and which you distribute, are governed by the terms of this License\nincluding, without limitation, Section 2. Any Modifications that you create or to which\nyou contribute may be distributed only under the terms of this License or a future version\nof this License released under Section 7. You must include a copy of this License with\nevery copy of the Modifications you distribute. You agree not to offer or impose any terms\non any Source Code or executable version of the Licensed Product or Modifications that\nalter or restrict the applicable version of this License or the recipients' rights\nhereunder. However, you may include an additional document offering the additional rights\ndescribed in Section 4(d).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAvailability of Source Code. You must make available, without charge, under the terms of this\nLicense, the Source Code of the Licensed Product and any Modifications that you\ndistribute, either on the same media as you distribute any executable or other form of the\nLicensed Product, or via a mechanism generally accepted in the software development\ncommunity for the electronic transfer of data (an \"Electronic Distribution\nMechanism\"). The Source Code for any version of Licensed Product or Modifications\nthat you distribute must remain available for as long as any executable or other form of\nthe Licensed Product is distributed by you. You are responsible for ensuring that the\nSource Code version remains available even if the Electronic Distribution Mechanism is\nmaintained by a third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property Matters.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "i."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Claims. If you have knowledge that a license to a third party's\nintellectual property right is required to exercise the rights granted by this\nLicense, you must include a text file with the Source Code distribution titled\n\"LEGAL\" that describes the claim and the party making the claim in\nsufficient detail that a recipient will know whom to contact. If you obtain such\nknowledge after you make any Modifications available as described in Section 4(b), you\nshall promptly modify the LEGAL file in all copies you make available thereafter and\nshall take other steps (such as notifying appropriate mailing lists or newsgroups)\nreasonably calculated to inform those who received the Licensed Product from you that\nnew knowledge has been obtained.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "ii."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor APIs. If your Modifications include an application programming interface\n(\"API\") and you have knowledge of patent licenses that are reasonably\nnecessary to implement that API, you must also include this information in the LEGAL\nfile.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "iii."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentations. You represent that, except as disclosed pursuant to 4(c)(i) above, you\nbelieve that any Modifications you distribute are your original creations and that you\nhave sufficient rights to grant the rights conveyed by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRequired Notices. You must duplicate this License in any documentation you provide along with\nthe Source Code of any Modifications you create or to which you contribute, and which you\ndistribute, wherever you describe recipients' rights relating to Licensed Product.\nYou must duplicate the notice contained in Exhibit A (the \"Notice\") in each file\nof the Source Code of any copy you distribute of the Licensed Product. If you created a\nModification, you may add your name as a Contributor to the Notice. If it is not possible\nto put the Notice in a particular Source Code file due to its structure, then you must\ninclude such Notice in a location (such as a relevant directory file) where a user would\nbe likely to look for such a notice. You may choose to offer, and charge a fee for,\nwarranty, support, indemnity or liability obligations to one or more recipients of\nLicensed Product. However, you may do so only on your own behalf, and not on behalf of the\nLicensor or any Contributor. You must make it clear that any such warranty, support,\nindemnity or liability obligation is offered by you alone, and you hereby agree to\nindemnify the Licensor and every Contributor for any liability incurred by the Licensor or\nsuch Contributor as a result of warranty, support, indemnity or liability terms you\noffer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "e."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Versions. You may distribute Licensed Product as an executable\nprogram under a license of your choice that may contain terms different from this License\nprovided (i) you have satisfied the requirements of Sections 4(a) through 4(d) for that\ndistribution, (ii) you include a conspicuous notice in the executable version, related\ndocumentation and collateral materials stating that the Source Code version of the\nLicensed Product is available under the terms of this License, including a description of\nhow and where you have fulfilled the obligations of Section 4(b), and (iii) you make it\nclear that any terms that differ from this License are offered by you alone, not by\nLicensor or any Contributor. You hereby agree to indemnify the Licensor and every\nContributor for any liability incurred by Licensor or such Contributor as a result of any\nterms you offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "f."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Derivative Works. You may create Derivative Works (e.g., combinations of some\nor all of the Licensed Product with other code) and distribute the Derivative Works as\nproducts under any other license you select, with the proviso that the requirements of\nthis License are fulfilled for those portions of the Derivative Works that consist of the\nLicensed Product or any Modifications thereto.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "g."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCompensation for Distribution of Executable Versions of Licensed Products, Modifications or\nDerivative Works. Notwithstanding any provision of this License to the contrary, by\ndistributing, selling, licensing, sublicensing or otherwise making available any Licensed\nProduct, or Modification or Derivative Work thereof, you and Licensor hereby acknowledge\nand agree that you may sell, license or sublicense for a fee, accept donations or\notherwise receive compensation for executable versions of a Licensed Product, without\npaying a royalty or other fee to the Licensor or any other Contributor, provided that such\nexecutable versions (i) contain your or another Contributor's material Modifications,\nor (ii) are otherwise material Derivative Works. For purposes of this License, an\nexecutable version of the Licensed Product will be deemed to contain a material\nModification, or will otherwise be deemed a material Derivative Work, if (a) the Licensed\nProduct is modified with your own or a third party's software programs or other code,\nand/or the Licensed Product is combined with a number of your own or a third party's\nsoftware programs or code, respectively, and (b) such software programs or code add or\ncontribute material value, functionality or features to the License Product. For the\navoidance of doubt, to the extent your executable version of a Licensed Product does not\ncontain your or another Contributor's material Modifications or is otherwise not a\nmaterial Derivative Work, in each case as contemplated herein, you may not sell, license\nor sublicense for a fee, accept donations or otherwise receive compensation for such\nexecutable. Additionally, without limitation of the foregoing and notwithstanding any\nprovision of this License to the contrary, you cannot charge for, sell, license or\nsublicense for a fee, accept donations or otherwise receive compensation for the Source\nCode.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation. If it is impossible for you to comply with any\nof the terms of this License with respect to some or all of the Licensed Product due to\nstatute, judicial order, or regulation, then you must (i) comply with the terms of this\nLicense to the maximum extent possible, (ii) cite the statute or regulation that prohibits you\nfrom adhering to the License, and (iii) describe the limitations and the code they affect.\nSuch description must be included in the LEGAL file described in Section 4(d), and must be\nincluded with all distributions of the Source Code. Except to the extent prohibited by statute\nor regulation, such description must be sufficiently detailed for a recipient of ordinary\nskill at computer programming to be able to understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of This License. This License applies to code to which Licensor or Contributor has\nattached the Notice in Exhibit A, which is incorporated herein by this reference.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of This License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions. Licensor may publish from time to time revised and/or new versions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions. Once Licensed Product has been published under a particular version\nof the License, you may always continue to use it under the terms of that version,\nprovided that any such license be in full force and effect at the time, and has not been\nrevoked or otherwise terminated. You may also choose to use such Licensed Product under\nthe terms of any subsequent version (but not any prior version) of the License published\nby Licensor. No one other than Licensor has the right to modify the terms applicable to\nLicensed Product created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDerivative Works of this License. If you create or use a modified version of this License,\nwhich you may do only in order to apply it to software that is not already a Licensed\nProduct under this License, you must rename your license so that it is not confusingly\nsimilar to this License, and must make it clear that your license contains terms that\ndiffer from this License. In so naming your license, you may not use any trademark of\nLicensor or any Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty. LICENSED PRODUCT IS PROVIDED UNDER THIS LICENSE ON AN AS IS BASIS,\nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\nWARRANTIES THAT THE LICENSED PRODUCT IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR\nPURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE LICENSED\nPRODUCT IS WITH YOU. SHOULD LICENSED PRODUCT PROVE DEFECTIVE IN ANY RESPECT, YOU (AND NOT THE\nLICENSOR OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR\nCORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE\nOF LICENSED PRODUCT IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAutomatic Termination Upon Breach. This license and the rights granted hereunder will\nterminate automatically if you fail to comply with the terms herein and fail to cure such\nbreach within ten (10) days of being notified of the breach by the Licensor. For purposes\nof this provision, proof of delivery via email to the address listed in the\n'WHOIS' database of the registrar for any website through which you distribute\nor market any Licensed Product, or to any alternate email address which you designate in\nwriting to the Licensor, shall constitute sufficient notification. All sublicenses to the\nLicensed Product that are properly granted shall survive any termination of this license\nso long as they continue to complye with the terms of this License. Provisions that, by\ntheir nature, must remain in effect beyond the termination of this License, shall\nsurvive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination Upon Assertion of Patent Infringement. If you initiate litigation by asserting a\npatent infringement claim (excluding declaratory judgment actions) against Licensor or a\nContributor (Licensor or Contributor against whom you file such an action is referred to\nherein as Respondent) alleging that Licensed Product directly or indirectly infringes any\npatent, then any and all rights granted by such Respondent to you under Sections 1 or 2 of\nthis License shall terminate prospectively upon sixty (60) days notice from Respondent\n(the \"Notice Period\") unless within that Notice Period you either agree in\nwriting (i) to pay Respondent a mutually agreeable reasonably royalty for your past or\nfuture use of Licensed Product made by such Respondent, or (ii) withdraw your litigation\nclaim with respect to Licensed Product against such Respondent. If within said Notice\nPeriod a reasonable royalty and payment arrangement are not mutually agreed upon in\nwriting by the parties or the litigation claim is not withdrawn, the rights granted by\nLicensor to you under Sections 1 and 2 automatically terminate at the expiration of said\nNotice Period.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nReasonable Value of This License. If you assert a patent infringement claim against\nRespondent alleging that Licensed Product directly or indirectly infringes any patent\nwhere such claim is resolved (such as by license or settlement) prior to the initiation of\npatent infringement litigation, then the reasonable value of the licenses granted by said\nRespondent under Sections 1 and 2 shall be taken into account in determining the amount or\nvalue of any payment or license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNo Retroactive Effect of Termination. In the event of termination under Sections 9(a) or 9(b)\nabove, all end user license agreements (excluding licenses to distributors and resellers)\nthat have been validly granted by you or any distributor hereunder prior to termination\nshall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT\n(INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE LICENSOR, ANY CONTRIBUTOR, OR ANY\nDISTRIBUTOR OF LICENSED PRODUCT, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY\nPERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER\nINCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE\nOR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL\nHAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT\nAPPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTYS NEGLIGENCE TO THE\nEXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\nOR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT\nAPPLY TO YOU.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nResponsibility for Claims. As between Licensor and Contributors, each party is responsible for\nclaims and damages arising, directly or indirectly, out of its utilization of rights under\nthis License. You agree to work with Licensor and Contributors to distribute such\nresponsibility on an equitable basis. Nothing herein is intended or shall be deemed to\nconstitute any admission of liability.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nU.S. Government End Users. The Licensed Product is a commercial item, as that term is defined in\n48 C.F.R. 2.101 (Oct. 1995), consisting of commercial computer software and commercial\ncomputer software documentation, as such terms are used in 48 C.F.R. 12.212 (Sept. 1995).\nConsistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all\nU.S. Government End Users acquire Licensed Product with only those rights set forth\nherein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous. This License represents the complete agreement concerning the subject matter\nhereof. If any provision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. This License shall be governed\nby California law provisions (except to the extent applicable law, if any, provides\notherwise), excluding its conflict-of-law provisions. You expressly agree that in any\nlitigation relating to this license the losing party shall be responsible for costs including,\nwithout limitation, court costs and reasonable attorneys fees and expenses. The application of\nthe United Nations Convention on Contracts for the International Sale of Goods is expressly\nexcluded. Any law or regulation that provides that the language of a contract shall be\nconstrued against the drafter shall not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinition of You in This License. You throughout this License, whether in upper or lower case,\nmeans an individual or a legal entity exercising rights under, and complying with all of the\nterms of, this License or a future version of this License issued under Section 7. For legal\nentities, you includes any entity that controls, is controlled by, is under common control\nwith, or affiliated with, you. For purposes of this definition, control means (i) the power,\ndirect or indirect, to cause the direction or management of such entity, whether by contract\nor otherwise, or (ii) ownership of fifty percent (50%) or more of the outstanding shares, or\n(iii) beneficial ownership of such entity. You are responsible for advising any affiliated\nentity of the terms of this License, and that any rights or privileges derived from or\nobtained by way of this License are subject to the restrictions outlined herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "15."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGlossary. All defined terms in this License that are used in more than one Section of this\nLicense are repeated here, in alphabetical order, for the convenience of the reader. The\nSection of this License in which each defined term is first used is shown in parentheses.\nContributor: Each person or entity who created or contributed to the creation of, and distributed, a\nModification. (See Section 2)\nDerivative Works: That term as used in this License is defined under U.S. copyright law. (See Section 1(b))\nLicense: This BitTorrent Open Source License. (See first paragraph of License)\nLicensed Product: Any BitTorrent Product licensed pursuant to this License. The term \"Licensed\nProduct\" includes all previous Modifications from any Contributor that you receive. (See first\nparagraph of License and Section 2)\nLicensor: BitTorrent, Inc. (See first paragraph of License)\nModifications: Any additions to or deletions from the substance or structure of (i) a file containing Licensed\nProduct, or (ii) any new file that contains any part of Licensed Product. (See Section 2)\nNotice: The notice contained in Exhibit A. (See Section 4(e))\nSource Code: The preferred form for making modifications to the Licensed Product, including all modules\ncontained therein, plus any associated interface definition files, scripts used to control compilation\nand installation of an executable program, or a list of differential comparisons against the Source\nCode of the Licensed Product. (See Section 1(a))\nYou: This term is defined in Section 14 of this License.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEXHIBIT A\nThe Notice below must appear in each file of the Source Code of any copy you distribute of the Licensed\nProduct or any hereto. Contributors to any Modifications may add their own copyright notices to\nidentify their own contributions.\nLicense:\nThe contents of this file are subject to the BitTorrent Open Source License Version "}, {"tag": "var", "name": "version", "content": [{"tag": "text", "content": "1.1"}], "pattern": "1\\.[01]"}, {"tag": "text", "content": " (the\nLicense). You may not copy or use this file, in either source code or executable form, except\nin compliance with the License. You may obtain a copy of the License at\nhttp://www.bittorrent.com/license/.\nSoftware distributed under the License is distributed on an AS IS basis, WITHOUT WARRANTY OF ANY KIND,\neither express or implied. See the License for the specific language governing rights and limitations\nunder the License.\nBitTorrent, Inc.\n"}]}, {"tag": "text", "content": "\n"}]