[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) <YEAR> <COPYRIGHT HOLDERS>"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n    \nRedistribution and use in source and binary\n      forms, with or without modification, are permitted\n      provided that the following conditions are met:\n\n    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Redistributions of source code must retain the above copyright\n        notice, this list of conditions and the following disclaimer.\n      \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Redistributions in binary form must reproduce the above copyright\n        notice, this list of conditions and the following disclaimer in the\n        documentation and/or other materials provided with the distribution.\n    \nSubject to the terms and conditions of this license, each copyright\n      holder and contributor hereby grants to those receiving rights under this\n      license a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\n      irrevocable (except for failure to satisfy the conditions of this license)\n      patent license to make, have made, use, offer to sell, sell, import,\n      and otherwise transfer this software, where such license applies only to\n      those patent claims, already acquired or hereafter acquired, licensable\n      by such copyright holder or contributor that are necessarily infringed by:\n\n    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        their Contribution(s) (the licensed copyrights of\n        copyright holders and non-copyrightable additions\n        of contributors, in source or binary form) alone; or\n      \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        combination of their Contribution(s) with the work of authorship\n        to which such Contribution(s) was added by such copyright\n        holder or contributor, if, at the time the Contribution\n        is added, such addition causes such combination to be\n        necessarily infringed. The patent license shall not apply\n        to any other combinations which include the Contribution.\n    \nExcept as expressly stated above, no rights or licenses from any\n      copyright holder or contributor is granted under this license,\n      whether expressly, by implication, estoppel or otherwise.\n\n    \nDISCLAIMER\n\n    \nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n      \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n      LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n      A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n      HOLDERS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n      SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n      LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n      DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n      THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n      (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n      OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."}]