[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 2003-2005 Sun Microsystems, Inc. All Rights Reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n      Redistribution and use in source and binary forms, with or\n         without modification, are permitted provided that the\n         following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution of source code must retain the above\n             copyright notice, this list of conditions and the\n             following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution in binary form must reproduce the above\n             copyright notice, this list of conditions and the\n             following disclaimer in the documentation and/or other\n             materials provided with the distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Neither the name of Sun Microsystems, Inc. or the names\n             of contributors may be used to endorse or promote\n             products derived from this software without specific\n             prior written permission.\n      This software is provided \"AS IS,\" without a warranty of any\n         kind. ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS AND\n         WARRANTIES, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY,\n         FITNESS FOR A PARTICULAR PURPOSE OR NON-INFRINGEMENT, ARE\n         HEREBY EXCLUDED. SUN MICROSYSTEMS, INC. (\"SUN\") AND ITS\n         LICENSORS SHALL NOT BE LIABLE FOR ANY DAMAGES SUFFERED BY\n         LICENSEE AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THIS\n         SOFTWARE OR ITS DERIVATIVES. IN NO EVENT WILL SUN OR ITS\n         LICENSORS BE LIABLE FOR ANY LOST REVENUE, PROFIT OR DATA, OR\n         FOR DIRECT, INDIRECT, SPECIAL, CONSEQUENTIAL, INCIDENTAL OR\n         PUNITIVE DAMAGES, HOWEVER CAUSED AND REGARDLESS OF THE THEORY\n         OF LIABILITY, ARISING OUT OF THE USE OF OR INABILITY TO USE\n         THIS SOFTWARE, EVEN IF SUN HAS BEEN ADVISED OF THE POSSIBILITY\n         OF SUCH DAMAGES.\n      You acknowledge that this software is not designed or intended\n         for use in the design, construction, operation or maintenance\n         of any nuclear facility."}]