[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 2003, The Regents of the University of California, through Lawrence Berkeley National\n         Laboratory (subject to receipt of any required approvals from the U.S. Dept. of Energy). All rights\n         reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n      \n      \nRedistribution and use in source and binary forms, with or without modification, are\n         permitted provided that the following conditions are met:\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the above copyright notice, this list of conditions\n             and the following disclaimer.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n             and the following disclaimer in the documentation and/or other materials provided with the\n             distribution.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            "}, {"type": "var", "name": "organizationClause3", "content": {"type": "text", "content": "Neither the name of the University of California, Lawrence Berkeley National Laboratory, U.S.\n             Dept. of Energy nor the names of its contributors may"}, "pattern": "(The name of.+may not)|(Neither the name of.+nor the names of its contributors may)"}, {"type": "text", "content": " be used to endorse or promote products\n             derived from this software without specific prior written permission.\n      \nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED\n         WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A\n         PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER"}, {"type": "optional", "content": {"type": "text", "content": ", THE UNITED STATES GOVERNMENT,"}}, {"type": "text", "content": " OR CONTRIBUTORS BE LIABLE FOR\n         ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n         LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n         INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n         LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n         SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n      \nYou are under no obligation whatsoever to provide any bug fixes, patches, or upgrades to the features,\n         functionality or performance of the source code (\"Enhancements\") to anyone; however, if you choose to\n         make your Enhancements available either publicly, or directly to \n         "}, {"type": "var", "name": "copyrightHolderEnhancements", "content": {"type": "text", "content": "Lawrence Berkeley National\n         Laboratory"}, "pattern": ".+"}, {"type": "text", "content": ",\n         without imposing a separate written license agreement for such Enhancements, then you\n         hereby grant the following license: a non-exclusive, royalty-free perpetual license to install, use,\n         modify, prepare derivative works, incorporate into other computer software, distribute, and sublicense\n         such Enhancements or derivative works thereof, in binary and source code form."}]