[{"type": "optional", "content": {"type": "text", "content": "Business Source License 1.1"}}, {"type": "text", "content": "\n      License text copyright © 2017 MariaDB Corporation Ab, All Rights Reserved.\n        “Business Source License” is a trademark of MariaDB Corporation Ab.\n      Terms\n      The Licensor hereby grants you the right to copy, modify, create derivative\n        works, redistribute, and make non-production use of the Licensed Work. The\n        Licensor may make an Additional Use Grant, above, permitting limited\n        production use.\n      Effective on the Change Date, or the fourth anniversary of the first publicly\n        available distribution of a specific version of the Licensed Work under this\n        License, whichever comes first, the Licensor hereby grants you rights under\n        the terms of the Change License, and the rights granted in the paragraph\n        above terminate.\n      If your use of the Licensed Work does not comply with the requirements\n        currently in effect as described in this License, you must purchase a\n        commercial license from the Licensor, its affiliated entities, or authorized\n        resellers, or you must refrain from using the Licensed Work.\n      All copies of the original and modified Licensed Work, and derivative works\n        of the Licensed Work, are subject to this License. This License applies\n        separately for each version of the Licensed Work and the Change Date may vary\n        for each version of the Licensed Work released by Licensor.\n      You must conspicuously display this License on each original or modified copy\n        of the Licensed Work. If you receive the Licensed Work in original or\n        modified form from a third party, the terms and conditions set forth in this\n        License apply to your use of that work.\n      Any use of the Licensed Work in violation of this License will automatically\n        terminate your rights under this License for the current and all other\n        versions of the Licensed Work.\n      This License does not grant you any right in any trademark or logo of\n        Licensor or its affiliates (provided that you may use a trademark or logo of\n        Licensor as expressly required by this License).\n      TO THE EXTENT PERMITTED BY APPLICABLE LAW, THE LICENSED WORK IS PROVIDED ON\n        AN “AS IS” BASIS. LICENSOR HEREBY DISCLAIMS ALL WARRANTIES AND CONDITIONS,\n        EXPRESS OR IMPLIED, INCLUDING (WITHOUT LIMITATION) WARRANTIES OF\n        MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT, AND\n        TITLE.\n      MariaDB hereby grants you permission to use this License’s text to license\n        your works, and to refer to it using the trademark “Business Source License”,\n        as long as you comply with the Covenants of Licensor below.\n      Covenants of Licensor\n      In consideration of the right to use this License’s text and the “Business\n        Source License” name and trademark, Licensor covenants to MariaDB, and to all\n        other recipients of the licensed work to be provided by Licensor:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": " To specify as the Change License the GPL Version 2.0 or\n         any later version, or a license that is compatible with GPL Version 2.0 or\n         a later version, where “compatible” means that software provided under the\n         Change License can be included in a program with software provided under GPL\n         Version 2.0 or a later version. Licensor may specify additional Change\n         Licenses without limitation.\n       "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": " To either: (a) specify an additional grant of rights to\n         use that does not impose any additional restriction on the right granted in\n         this License, as the Additional Use Grant; or (b) insert the text “None”.\n       "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": " To specify a Change Date.\n       "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Not to modify this License in any other way."}]