[{"type": "text", "content": "\n"}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "\nThis program, \"bzip2\", the associated library \"libbzip2\", and all documentation, are\ncopyright (C) 1996-2010 Julian R Seward. All rights reserved.\n"}], "pattern": ".{0,5000}"}, {"type": "text", "content": "\nRedistribution and use in source and binary forms, with or without modification, are permitted provided\nthat the following conditions are met:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRedistributions of source code must retain the above copyright notice, this list of\nconditions and the following disclaimer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe origin of this software must not be misrepresented; you must not claim that you wrote the\noriginal software. If you use this software in a product, an acknowledgment in the product\ndocumentation would be appreciated but is not required.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAltered source versions must be plainly marked as such, and must not be misrepresented as\nbeing the original software.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe name of the author may not be used to endorse or promote products derived from this\nsoftware without specific prior written permission.\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\nPURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGE.\nJulian Seward, jseward@bzip.org bzip2/libbzip2 version 1.0.6 of 6 September 2010\n"}]