[{"type": "optional", "content": [{"type": "optional", "content": {"type": "text", "content": "#"}}, {"type": "text", "content": "The Cryptographic Autonomy License, v. 1.0"}]}, {"type": "text", "content": "\n        "}, {"type": "var", "name": "this", "content": {"type": "text", "content": "*This"}, "pattern": "(\\*This|This)"}, {"type": "text", "content": " Cryptographic Autonomy License (the \"License\") \napplies to any Work whose owner has marked it with any of the following \nnotices, or a similar demonstration of intent:"}, {"type": "optional", "content": {"type": "text", "content": "*"}}, {"type": "text", "content": "\n\nSPDX-License-Identifier: CAL-1.0 \nLicensed under the Cryptographic Autonomy License version 1.0 \n\n"}, {"type": "var", "name": "or", "content": {"type": "text", "content": "*or*"}, "pattern": "(\\*or\\*|or)"}, {"type": "text", "content": "\n\n\nSPDX-License-Identifier: CAL-1.0-Combined-Work-Exception \nLicensed under the Cryptographic Autonomy License version 1.0, with Combined Work Exception\n"}, {"type": "optional", "content": {"type": "text", "content": "______________________________________________________________________"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Purpose\n          This License gives You unlimited permission to use and modify the software to \nwhich it applies (the \"Work\"), either as-is or in modified form, for Your \nprivate purposes, while protecting the owners and contributors to the software \nfrom liability.\n          This License also strives to protect the freedom and autonomy of third parties \nwho receive the Work from you.  If any non-affiliated third party receives any \npart, aspect, or element of the Work from You, this License requires that You \nprovide that third party all the permissions and materials needed to \nindependently use and modify the Work without that third party having a loss \nof data or capability due to your actions.\n          The full permissions, conditions, and other terms are laid out below.\n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Receiving a License\n          In order to receive this License, You must agree to its rules. The rules of \nthis License are both obligations of Your agreement with the Licensor and \nconditions to your License. You must not do anything with the Work that \ntriggers a rule You cannot or will not follow.\n          "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Application\n              The terms of this License apply to the Work as you receive it from Licensor, \nas well as to any modifications, elaborations, or implementations created by \nYou that contain any licensable portion of the Work (a \"Modified Work\"). \nUnless specified, any reference to the Work also applies to a Modified Work.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Offer and Acceptance\n              This License is automatically offered to every person and organization. You \nshow that you accept this License and agree to its conditions by taking any \naction with the Work that, absent this License, would infringe any \nintellectual property right held by Licensor.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Compliance and Remedies\n              Any failure to act according to the terms and conditions of this License \nplaces Your use of the Work outside the scope of the License and infringes the \nintellectual property rights of the Licensor. In the event of infringement, \nthe terms and conditions of this License may be enforced by Licensor under the \nintellectual property laws of any jurisdiction to which You are subject. You \nalso agree that either the Licensor or a Recipient (as an intended third-party \nbeneficiary) may enforce the terms and conditions of this License against You \nvia specific performance.\n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Permissions\n\n          "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Permissions Granted\n              Conditioned on compliance with section 4, and subject to the limitations of \nsection 3.2, Licensor grants You the world-wide, royalty-free, non-exclusive \npermission to:\n              "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "Take any action with the Work \nthat would infringe the non-patent intellectual \nproperty laws of any jurisdiction to which You are \nsubject; and\n                "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " claims that Licensor can license \nor becomes able to license, to the extent that those \nclaims are embodied in the Work as distributed by \nLicensor.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Limitations on Permissions Granted\n              The following limitations apply to the permissions granted in section 3.1:\n              "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "Licensor does not grant any \npatent license for claims that are only infringed due \nto modification of the Work as provided by Licensor, \nor the combination of the Work as provided by \nLicensor, directly or indirectly, with any other \ncomponent, including other software or hardware.\n                "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " Licensor does not grant any \nlicense to the trademarks, service marks, or logos of \nLicensor, except to the extent necessary to comply \nwith the attribution conditions in section 4.1 of \nthis License.  \n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Conditions\n          If You exercise any permission granted by this License, such that the Work, or \nany part, aspect, or element of the Work, is distributed, communicated, made \navailable, or made perceptible to a non-Affiliate third party (a \"Recipient\"), \neither via physical delivery or via a network connection to the Recipient, You \nmust comply with the following conditions:\n          "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Provide Access to Source Code\n              Subject to the exception in section 4.4, You must provide to each Recipient a \ncopy of, or no-charge unrestricted network access to, the Source Code \ncorresponding to the Work (\"Access\").\n              The \"Source Code\" of the Work means the form of the Work preferred for making \nmodifications, including any comments, configuration information, \ndocumentation, help materials, installation instructions, cryptographic seeds \nor keys, and any information reasonably necessary for the Recipient to \nindependently compile and use the Source Code and to have full access to the \nfunctionality contained in the Work.\n              "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Providing Network Access to the Source Code\n                  Network Access to the Notices and Source Code may be provided by You or by a \nthird party, such as a public software repository, and must persist during the \nsame period in which You exercise any of the permissions granted to You under \nthis License and for at least one year thereafter.\n                "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Source Code for a Modified Work\n                  Subject to the exception in section 4.5, You must provide to each Recipient of \na Modified Work Access to Source Code corresponding to those portions of the \nWork remaining in the Modified Work as well as the modifications used by You \nto create the Modified Work. The Source Code corresponding to the \nmodifications in the Modified Work must be provided to the Recipient either \na) under this License, or b) under a Compatible Open Source License.\n                   A “Compatible Open Source License” means a license accepted by the Open Source \nInitiative that allows object code created using both Source Code provided under \nthis License and Source Code provided under the other open source license to be \ndistributed together as a single work.\n                "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Coordinated Disclosure of Security Vulnerabilities\n                  You may delay providing the Source Code corresponding to a particular \nmodification of the Work for up to ninety (90) days (the \"Embargo Period\") if:\n                  "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "the modification is intended to \naddress a newly-identified vulnerability or a \nsecurity flaw in the Work,\n                    "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "disclosure of the vulnerability \nor security flaw before the end of the Embargo Period \nwould put the data, identity, or autonomy of one or \nmore Recipients of the Work at significant risk,\n                    "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "You are participating in a \ncoordinated disclosure of the vulnerability or\nsecurity flaw with one or more additional Licensees, \nand\n                    "}, {"type": "optional", "content": {"type": "text", "content": "+"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "Access to the Source Code \npertaining to the modification is provided to all\nRecipients at the end of the Embargo Period.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Maintain User Autonomy\n              In addition to providing each Recipient the opportunity to have Access to the \nSource Code, You cannot use the permissions given under this License to \ninterfere with a Recipient's ability to fully use an independent copy of the \nWork generated from the Source Code You provide with the Recipient's own User \nData.\n              \"User Data\" means any data that is an input to or an output from the Work, \nwhere the presence of the data is necessary for substantially identical use of \nthe Work in an equivalent context chosen by the Recipient, and where the \nRecipient has an existing ownership interest, an existing right to possess, or \nwhere the data has been generated by, for, or has been assigned to the \nRecipient.\n              "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "No Withholding User Data\n                  Throughout any period in which You exercise any of the permissions granted to \nYou under this License, You must also provide to any Recipient to whom you \nprovide services via the Work, a no-charge copy, provided in a commonly used \nelectronic form, of the Recipient's User Data in your possession, to the \nextent that such User Data is available to You for use in conjunction with the \nWork.\n                "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "No Technical Measures that Limit Access\n                  You may not, by means of the use cryptographic methods applied to anything \nprovided to the Recipient, by possession or control of cryptographic keys, \nseeds, hashes, by any other technological protection measures, or by any other \nmethod, limit a Recipient's ability to access any functionality present in \nRecipient's independent copy of the Work, or to deny a Recipient full control \nof the Recipient's User Data.\n                "}, {"type": "optional", "content": {"type": "text", "content": "####"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "No Legal or Contractual Measures that Limit Access\n                  You may not contractually restrict a Recipient's ability to independently \nexercise the permissions granted under this License. You waive any legal power \nto forbid circumvention of technical protection measures that include use of \nthe Work, and You waive any claim that the capabilities of the Work were \nlimited or modified as a means of enforcing the legal rights of third parties \nagainst Recipients.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Provide Notices and Attribution\n              You must retain all licensing, authorship, or attribution notices contained in \nthe Source Code (the \"Notices\"), and provide all such Notices to each \nRecipient, together with a statement acknowledging the use of the Work. \nNotices may be provided directly to a Recipient or via an easy-to-find \nhyperlink to an Internet location also providing Access to Source Code.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Scope of Conditions in this License\n              You are required to uphold the conditions of this License only relative to \nthose who are Recipients of the Work from You. Other than providing Recipients \nwith the applicable Notices, Access to Source Code, and a copy of and full \ncontrol of their User Data, nothing in this License requires You to provide \nprocessing services to or engage in network interactions with anyone.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Combined Work Exception\n              As an exception to condition that You provide Recipients Access to Source \nCode, any Source Code files marked by the Licensor as having the \"Combined \nWork Exception,\" or any object code exclusively resulting from Source Code \nfiles so marked, may be combined with other Software into a \"Larger Work.\" So \nlong as you comply with the requirements to provide Recipients the applicable \nNotices and Access to the Source Code provided to You by Licensor, and you \nprovide Recipients access to their User Data and do not limit Recipient's \nability to independently work with their User Data, any other Software in the \nLarger Work as well as the Larger Work as a whole may be licensed under the \nterms of your choice.\n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Term and Termination\n          The term of this License begins when You receive the Work, and continues until \nterminated for any of the reasons described herein, or until all Licensor's \nintellectual property rights in the Software expire, whichever comes first \n(\"Term\"). This License cannot be revoked, only terminated for the reasons \nlisted below.\n          "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Effect of Termination\n              If this License is terminated for any reason, all permissions granted to You \nunder Section 3 by any Licensor automatically terminate. You will immediately \ncease exercising any permissions granted in this License relative to the Work, \nincluding as part of any Modified Work.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Termination for Non-Compliance; Reinstatement\n              This License terminates automatically if You fail to comply with any of the \nconditions in section 4. As a special exception to termination for \nnon-compliance, Your permissions for the Work under this License will \nautomatically be reinstated if You come into compliance with all the \nconditions in section 2 within sixty (60) days of being notified by Licensor \nor an intended third-party beneficiary of Your noncompliance. You are eligible \nfor reinstatement of permissions for the Work one time only, and only \nfor the sixty days immediately after becoming aware of noncompliance. Loss of \npermissions granted for the Work under   this License due to either a) \nsustained noncompliance lasting  more than sixty days or b) subsequent \ntermination for  noncompliance after reinstatement, is permanent, unless \nrights are specifically restored by Licensor in writing.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Termination Due to Litigation\n              If You initiate litigation against Licensor, or any Recipient of the Work, \neither direct or indirect, asserting that the Work directly or indirectly \ninfringes any patent, then all permissions granted to You by this License \nshall terminate. In the event of termination due to litigation, all \npermissions validly granted by You under this License, directly or indirectly, \nshall survive termination. Administrative review procedures, declaratory \njudgment actions, counterclaims in response to patent litigation, and \nenforcement actions against former Licensees terminated under this section do \nnot cause termination due to litigation.\n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Disclaimer of Warranty and Limit on Liability\n          As far as the law allows, the Work comes AS-IS, without any warranty of any \nkind, and no Licensor or contributor will be liable to anyone for any damages \nrelated to this software or this license, under any kind of legal claim, or \nfor any type of damages, including indirect, special, incidental, or \nconsequential damages of any type arising as a result of this License or the \nuse of the Work including, without limitation, damages for loss of goodwill, \nwork stoppage, computer failure or malfunction, loss of profits, revenue, or \nany and all other commercial damages or losses.\n        "}, {"type": "optional", "content": {"type": "text", "content": "##"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Other Provisions\n\n          "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Affiliates\n              An \"Affiliate\" means any other entity that, directly or indirectly through one \nor more intermediaries, controls, is controlled by, or is under common control \nwith, the Licensee. Employees of a Licensee and natural persons acting as \ncontractors exclusively providing services to Licensee are also Affiliates.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Choice of Jurisdiction and Governing Law\n              A Licensor may require that any action or suit by a Licensee relating to a \nWork provided by Licensor under this License may be brought only in the courts \nof a particular jurisdiction and under the laws of a particular jurisdiction \n(excluding its conflict-of-law provisions), if Licensor provides conspicuous \nnotice of the particular jurisdiction to all Licensees.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "No Sublicensing\n              This License is not sublicensable. Each time You provide the Work or a \nModified Work to a Recipient, the Recipient automatically receives a license \nunder the terms described in this License. You may not impose any further \nreservations, conditions, or other provisions on any Recipients' exercise of \nthe permissions granted herein.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Attorneys' Fees\n              In any action to enforce the terms of this License, or seeking damages \nrelating thereto, including by an intended third-party beneficiary, the \nprevailing party shall be entitled to recover its costs and expenses, \nincluding, without limitation, reasonable attorneys' fees and costs incurred \nin connection with such action, including any appeal of such action. A \n\"prevailing party\" is the party that achieves, or avoids, compliance with this \nLicense, including through settlement. This section shall survive the \ntermination of this License.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "No Waiver\n              Any failure by Licensor to enforce any provision of this License will not \nconstitute a present or future waiver of such provision nor limit Licensor's \nability to enforce such provision at a later time.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "Severability\n              If any provision of this License is held to be unenforceable, such provision \nshall be reformed only to the extent necessary to make it enforceable. Any \ninvalid or unenforceable portion will be interpreted to the effect and intent \nof the original portion. If such a construction is not possible, the invalid \nor unenforceable portion will be severed from this License but the rest of \nthis License will remain in full force and effect.\n            "}, {"type": "optional", "content": {"type": "text", "content": "###"}}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "License for the Text of this License\n              The text of this license is released under the Creative Commons \nAttribution-ShareAlike 4.0 International License, with the caveat that any \nmodifications of this license may not use the name \"Cryptographic Autonomy \nLicense\" or any name confusingly similar thereto to describe any derived work \nof this License."}]