[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nCreative Commons Attribution - Share-Alike 2.0 England and Wales\n"}]}, {"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF\nTHIS LICENCE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\nINFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION\nPROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\nLicence\n"}]}, {"type": "text", "content": "\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENCE (\"CCPL\"\nOR \"LICENCE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER\nTHAN AS AUTHORIZED UNDER THIS LICENCE OR COPYRIGHT LAW IS PROHIBITED. BY EXERCISING ANY RIGHTS TO THE\nWORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENCE. THE LICENSOR GRANTS\nYOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\nThis Creative Commons England and Wales Public Licence enables You (all capitalised terms defined below)\nto view, edit, modify, translate and distribute Works worldwide, under the terms of this licence,\nprovided that You credit the Original Author.\n'The Licensor' [one or more legally recognised persons or entities offering the Work under the terms and\nconditions of this Licence]\nand\n'You'\nagree as follows:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Definitions\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Attribution\" means acknowledging all the parties who have contributed to and have rights in the Work\nor Collective Work under this Licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Collective Work\" means the Work in its entirety in unmodified form along with a number of other\nseparate and independent works, assembled into a collective whole.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Derivative Work\" means any work created by the editing, modification, adaptation or translation of the\nWork in any media (however a work that constitutes a Collective Work will not be considered a\nDerivative Work for the purpose of this Licence). For the avoidance of doubt, where the Work is a\nmusical composition or sound recording, the synchronization of the Work in timed-relation with a\nmoving image (\"synching\") will be considered a Derivative Work for the purpose of this Licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Licence\" means this Creative Commons England and Wales Public Licence agreement.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Licence Elements\" means the following high-level licence attributes indicated in the title of this Licence:\nAttribution, Share-Alike.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "f."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Original Author\" means the individual (or entity) who created the Work.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "g."}], "pattern": ".{0,20}"}, {"type": "text", "content": " \"Work\" means the work protected by copyright which is offered under the terms of this Licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "h."}], "pattern": ".{0,20}"}, {"type": "text", "content": " For the purpose of this Licence, when not inconsistent with the context, words in the singular number\ninclude the plural number.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Licence Terms\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": " The Licensor hereby grants to You a worldwide, royalty-free, non-exclusive, Licence for use and for the\nduration of copyright in the Work.\nYou may:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " copy the Work;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " create one or more derivative Works;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " incorporate the Work into one or more Collective Works;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " copy Derivative Works or the Work as incorporated in any Collective Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " publish, distribute, archive, perform or otherwise disseminate the Work or the\nWork as incorporated in any Collective Work, to the public in any material form in any media whether\nnow known or hereafter created.\nHOWEVER,\nYou must not:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " impose any terms on the use to be made of the Work, the Derivative Work or the\nWork as incorporated in a Collective Work that alter or restrict the terms of this Licence or any\nrights granted under it or has the effect or intent of restricting the ability to exercise those\nrights;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " impose any digital rights management technology on the Work or the Work as\nincorporated in a Collective Work that alters or restricts the terms of this Licence or any rights\ngranted under it or has the effect or intent of restricting the ability to exercise those rights;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " sublicense the Work;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " subject the Work to any derogatory treatment as defined in the Copyright,\nDesigns and Patents Act 1988.\nFINALLY,\nYou must:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " make reference to this Licence (by Uniform Resource Identifier (URI), spoken\nword or as appropriate to the media used) on all copies of the Work and Collective Works published,\ndistributed, performed or otherwise disseminated or made available to the public by You;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " recognise the Licensor's / Original Author's right of attribution in any Work and\nCollective Work that You publish, distribute, perform or otherwise disseminate to the public and\nensure that You credit the Licensor / Original Author as appropriate to the media used; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " to the extent reasonably practicable, keep intact all notices that refer to this\nLicence, in particular the URI, if any, that the Licensor specifies to be associated with the Work,\nunless such URI does not refer to the copyright notice or licensing information for the Work.\nAdditional Provisions for third parties making use of the Work\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Further licence from the Licensor\nEach time You publish, distribute, perform or otherwise disseminate\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " the Work; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " any Derivative Work; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " the Work as incorporated in a Collective Work\nthe Licensor agrees to offer to the relevant third party making use of the Work (in any of the\nalternatives set out above) a licence to use the Work on the same terms and conditions as granted to You\nhereunder.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Further licence from You\nEach time You publish, distribute, perform or otherwise disseminate\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " a Derivative Work; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " a Derivative Work as incorporated in a Collective Work\nYou agree to offer to the relevant third party making use of the Work (in either of the alternatives\nset out above) a licence to use the Derivative Work on any of the following premises:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " a licence to the Derivative Work on the same terms and conditions as the\nlicence granted to You hereunder; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " a later version of the licence granted to You hereunder; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "*"}], "pattern": ".{0,20}"}, {"type": "text", "content": " any other Creative Commons licence with the same Licence Elements.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": " This Licence does not affect any rights that the User may have under any applicable\nlaw, including fair use, fair dealing or any other legally recognised limitation or exception to\ncopyright infringement.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.5."}], "pattern": ".{0,20}"}, {"type": "text", "content": " All rights not expressly granted by the Licensor are hereby reserved, including but\nnot limited to, the exclusive right to collect, whether individually or via a licensing body, such as a\ncollecting society, royalties for any use of the Work which results in commercial advantage or private\nmonetary compensation.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Warranties and Disclaimer\nExcept as required by law, the Work is licensed by the Licensor on an \"as is\" and \"as available\" basis and\nwithout any warranty of any kind, either express or implied.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Limit of Liability\nSubject to any liability which may not be excluded or limited by law the Licensor shall not be liable and\nhereby expressly excludes all liability for loss or damage howsoever and whenever caused to You.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": " Termination\nThe rights granted to You under this Licence shall terminate automatically upon any breach by You of the\nterms of this Licence. Individuals or entities who have received Collective Works from You under this\nLicence, however, will not have their Licences terminated provided such individuals or entities remain in\nfull compliance with those Licences.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": " General\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.1. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "The validity or enforceability of the remaining terms of this agreement is not\naffected by the holding of any provision of it to be invalid or unenforceable.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.2. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "This Licence constitutes the entire Licence Agreement between the parties with\nrespect to the Work licensed here. There are no understandings, agreements or representations with\nrespect to the Work not specified here. The Licensor shall not be bound by any additional provisions\nthat may appear in any communication in any form.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.3. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "A person who is not a party to this Licence shall have no rights under the\nContracts (Rights of Third Parties) Act 1999 to enforce any of its terms.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.4. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "This Licence shall be governed by the law of England and Wales and the parties\nirrevocably submit to the exclusive jurisdiction of the Courts of England and Wales.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": " On the role of Creative Commons\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.1. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "Neither the Licensor nor the User may use the Creative Commons logo except to\nindicate that the Work is licensed under a Creative Commons Licence. Any permitted use has to be in\ncompliance with the Creative Commons trade mark usage guidelines at the time of use of the Creative\nCommons trade mark. These guidelines may be found on the Creative Commons website or be otherwise\navailable upon request from time to time.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.2. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "Creative Commons Corporation does not profit financially from its role in\nproviding this Licence and will not investigate the claims of any Licensor or user of the Licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.3. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "One of the conditions that Creative Commons Corporation requires of the Licensor\nand You is an acknowledgement of its limited role and agreement by all who use the Licence that the\nCorporation is not responsible to anyone for the statements and actions of You or the Licensor or\nanyone else attempting to use or using this Licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.4. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "Creative Commons Corporation is not a party to this Licence, and makes no\nwarranty whatsoever in connection to the Work or in connection to the Licence, and in all events is not\nliable for any loss or damage resulting from the Licensor's or Your reliance on this Licence or on its\nenforceability.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.5. "}], "pattern": ".{0,20}"}, {"type": "text", "content": "USE OF THIS LICENCE MEANS THAT YOU AND THE LICENSOR EACH ACCEPTS THESE CONDITIONS\nIN SECTION 7.1, 7.2, 7.3, 7.4 AND EACH ACKNOWLEDGES CREATIVE COMMONS CORPORATION'S VERY LIMITED ROLE AS\nA FACILITATOR OF THE LICENCE FROM THE LICENSOR TO YOU.\nCreative Commons is not a party to this Licence, and makes no warranty whatsoever in connection with the Work.\nCreative Commons will not be liable to You or any party on any legal theory for any damages whatsoever, including\nwithout limitation any general, special, incidental or consequential damages arising in connection to this licence.\nNotwithstanding the foregoing two (2) sentences, if Creative Commons has expressly identified itself as the Licensor\nhereunder, it shall have all rights and obligations of Licensor.\nExcept for the limited purpose of indicating to the public that the Work is licensed under the CCPL, neither party will\nuse the trademark \"Creative Commons\" or any related trademark or logo of Creative Commons without the prior written\nconsent of Creative Commons. Any permitted use will be in compliance with Creative Commons' then-current trademark\nusage guidelines, as may be published on its website or otherwise made available upon request from time to time.\nCreative Commons may be contacted at https://creativecommons.org/.\n"}]