[{"type": "text", "content": "CREATIVE COMMONS IST KEINE RECHTSANWALTSKANZLEI UND LEISTET KEINE\n            RECHTSBERATUNG. DIE BEREITSTELLUNG DIESER LIZENZ FÜHRT ZU KEINEM\n            MANDATSVERHÄLTNIS. CREATIVE COMMONS STELLT DIESE INFORMATIONEN OHNE\n            GEWÄHR ZUR VERFÜGUNG. CREATIVE COMMONS ÜBERNIMMT KEINE GEWÄHRLEISTUNG\n            FÜR DIE GELIEFERTEN INFORMATIONEN UND SCHLIEßT DIE HAFTUNG FÜR SCHÄDEN\n            AUS, DIE SICH AUS DEREN GEBRAUCH ERGEBEN.\n            "}, {"type": "optional", "content": {"type": "text", "content": "Lizenz"}}, {"type": "text", "content": "\n            DER GEGENSTAND DIESER LIZENZ (WIE UNTER „SCHUTZGEGENSTAND“ DEFINIERT)\n            WIRD UNTER DEN BEDINGUNGEN DIESER CREATIVE COMMONS PUBLIC LICENSE\n            (\"CCPL\", „LIZENZ“ ODER \"LIZENZVERTRAG\") ZUR VERFÜGUNG GESTELLT. DER\n            SCHUTZGEGENSTAND IST DURCH DAS URHEBERRECHT UND/ODER ANDERE GESETZE\n            GESCHÜTZT. JEDE FORM DER NUTZUNG DES SCHUTZGEGENSTANDES, DIE NICHT\n            AUFGRUND DIESER LIZENZ ODER DURCH GESETZE GESTATTET IST, IST UNZULÄSSIG.\n            DURCH DIE AUSÜBUNG EINES DURCH DIESE LIZENZ GEWÄHRTEN RECHTS AN DEM\n            SCHUTZGEGENSTAND ERKLÄREN SIE SICH MIT DEN LIZENZBEDINGUNGEN\n            RECHTSVERBINDLICH EINVERSTANDEN. SOWEIT DIESE LIZENZ ALS LIZENZVERTRAG\n            ANZUSEHEN IST, GEWÄHRT IHNEN DER LIZENZGEBER DIE IN DER LIZENZ GENANNTEN\n            RECHTE UNENTGELTLICH UND IM AUSTAUSCH DAFÜR, DASS SIE DAS GEBUNDENSEIN\n            AN DIE LIZENZBEDINGUNGEN AKZEPTIEREN.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Definitionen\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der Begriff \"Bearbeitung\" im Sinne dieser Lizenz bezeichnet das Ergebnis\n                            jeglicher Art von Veränderung des Schutzgegenstandes, solange dieses\n                            erkennbar vom Schutzgegenstand abgeleitet wurde. Dies kann insbesondere\n                            auch eine Umgestaltung, Änderung, Anpassung, Übersetzung oder\n                            Heranziehung des Schutzgegenstandes zur Vertonung von Laufbildern sein.\n                            Nicht als Bearbeitung des Schutzgegenstandes gelten seine Aufnahme in eine\n                            Sammlung oder ein Sammelwerk und die freie Nutzung des\n                            Schutzgegenstandes.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der Begriff \"Sammelwerk\" im Sinne dieser Lizenz meint eine\n                            Zusammenstellung von literarischen, künstlerischen oder wissenschaftlichen\n                            Inhalten zu einem einheitlichen Ganzen, sofern diese Zusammenstellung\n                            aufgrund von Auswahl und Anordnung der darin enthaltenen selbständigen\n                            Elemente eine eigentümliche geistige Schöpfung darstellt, unabhängig davon,\n                            ob die Elemente systematisch oder methodisch angelegt und dadurch einzeln\n                            zugänglich sind oder nicht.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            \"Verbreiten\" im Sinne dieser Lizenz bedeutet, den Schutzgegenstand oder\n                            Bearbeitungen im Original oder in Form von Vervielfältigungsstücken, mithin in\n                            körperlich fixierter Form der Öffentlichkeit zugänglich zu machen oder in\n                            Verkehr zu bringen.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Unter \"Lizenzelementen\" werden im Sinne dieser Lizenz die folgenden\n                            übergeordneten Lizenzcharakteristika verstanden, die vom Lizenzgeber\n                            ausgewählt wurden und in der Bezeichnung der Lizenz zum Ausdruck kommen:\n                            \"Namensnennung\", \"Weitergabe unter gleichen Bedingungen\".\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der \"Lizenzgeber\" im Sinne dieser Lizenz ist diejenige natürliche oder\n                            juristische Person oder Gruppe, die den Schutzgegenstand unter den\n                            Bedingungen dieser Lizenz anbietet und insoweit als Rechteinhaberin auftritt.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            \"Rechteinhaber\" im Sinne dieser Lizenz ist der Urheber des\n                            Schutzgegenstandes oder jede andere natürliche oder juristische Person, die\n                            am Schutzgegenstand ein Immaterialgüterrecht erlangt hat, welches die in\n                            Abschnitt 3 genannten Handlungen erfasst und eine Erteilung, Übertragung\n                            oder Einräumung von Nutzungsbewilligungen bzw Nutzungsrechten an Dritte\n                            erlaubt.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "g."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der Begriff \"Schutzgegenstand\" bezeichnet in dieser Lizenz den literarischen,\n                            künstlerischen oder wissenschaftlichen Inhalt, der unter den Bedingungen\n                            dieser Lizenz angeboten wird. Das kann insbesondere eine eigentümliche\n                            geistige Schöpfung jeglicher Art oder ein Werk der kleinen Münze, ein\n                            nachgelassenes Werk oder auch ein Lichtbild oder anderes Objekt eines\n                            verwandten Schutzrechts sein, unabhängig von der Art seiner Fixierung und\n                            unabhängig davon, auf welche Weise jeweils eine Wahrnehmung erfolgen kann,\n                            gleichviel ob in analoger oder digitaler Form. Soweit Datenbanken oder\n                            Zusammenstellungen von Daten einen immaterialgüterrechtlichen Schutz\n                            eigener Art genießen, unterfallen auch sie dem Begriff „Schutzgegenstand“ im\n                            Sinne dieser Lizenz.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "h."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Mit \"Sie\" bzw. \"Ihnen\" ist die natürliche oder juristische Person gemeint, die in\n                            dieser Lizenz im Abschnitt 3 genannte Nutzungen des Schutzgegenstandes\n                            vornimmt und zuvor in Hinblick auf den Schutzgegenstand nicht gegen\n                            Bedingungen dieser Lizenz verstoßen oder aber die ausdrückliche Erlaubnis des\n                            Lizenzgebers erhalten hat, die durch diese Lizenz gewährte\n                            Nutzungsbewilligung trotz eines vorherigen Verstoßes auszuüben.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Unter \"Öffentlich Wiedergeben\" im Sinne dieser Lizenz sind\n                            Wahrnehmbarmachungen des Schutzgegenstandes in unkörperlicher Form zu\n                            verstehen, die für eine Mehrzahl von Mitgliedern der Öffentlichkeit bestimmt\n                            sind und mittels öffentlicher Wiedergabe in Form von Vortrag, Aufführung,\n                            Vorführung, Darbietung, Sendung, Weitersendung oder zeit- und\n                            ortsunabhängiger Zurverfügungstellung erfolgen, unabhängig von den zum\n                            Einsatz kommenden Techniken und Verfahren, einschließlich drahtgebundener\n                            oder drahtloser Mittel und Einstellen in das Internet.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "j."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            \"Vervielfältigen\" im Sinne dieser Lizenz bedeutet, gleichviel in welchem\n                            Verfahren, auf welchem Träger, in welcher Menge und ob vorübergehend oder\n                            dauerhaft, Vervielfältigungsstücke des Schutzgegenstandes herzustellen,\n                            insbesondere durch Ton- oder Bildaufzeichnungen, und umfasst auch das\n                            erstmalige Festhalten des Schutzgegenstandes oder dessen\n                            Wahrnehmbarmachung auf Mitteln der wiederholbaren Wiedergabe sowie das\n                            Herstellen von Vervielfältigungsstücken dieser Festhaltung, sowie die\n                            Speicherung einer geschützten Darbietung oder eines Bild- und/oder\n                            Schallträgers in digitaler Form oder auf einem anderen elektronischen Medium.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "k."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            \"Mit Creative Commons kompatible Lizenz\" bezeichnet eine Lizenz, die unter https://creativecommons.org/compatiblelicenses aufgelistet ist und die durch Creative Commons als grundsätzlich zur vorliegenden Lizenz äquivalent akzeptiert wurde, da zumindest folgende Voraussetzungen erfüllt sind:\n                            Diese mit Creative Commons kompatible Lizenz\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    enthält Bestimmungen, welche die gleichen Ziele verfolgen, die gleiche\n                                    Bedeutung haben und die gleichen Wirkungen erzeugen wie die\n                                    Lizenzelemente der vorliegenden Lizenz; und\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    erlaubt ausdrücklich das Lizenzieren von ihr unterstellten Abwandlungen\n                                    unter vorliegender Lizenz, unter einer anderen rechtsordnungsspezifisch\n                                    angepassten Creative-Commons-Lizenz mit denselben Lizenzelementen\n                                    wie vorliegende Lizenz aufweist oder unter der entsprechenden\n                                    Creative-Commons-Unported-Lizenz.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Beschränkungen der Verwertungsrechte\n                    Diese Lizenz ist in keiner Weise darauf gerichtet, Befugnisse zur Nutzung des\n                    Schutzgegenstandes zu vermindern, zu beschränken oder zu vereiteln, die sich aus\n                    den Beschränkungen der Verwertungsrechte, anderen Beschränkungen der\n                    Ausschließlichkeitsrechte des Rechtsinhabers oder anderen entsprechenden\n                    Rechtsnormen oder sich aus dem Fehlen eines immaterialgüterrechtlichen Schutzes\n                    ergeben.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Lizenzierung\n                    Unter den Bedingungen dieser Lizenz erteilt Ihnen der Lizenzgeber -\n                    unbeschadet unverzichtbarer Rechte und vorbehaltlich des Abschnitts 3.e) - die\n                    vergütungsfreie, räumlich und zeitlich (für die Dauer des Urheberrechts oder\n                    verwandten Schutzrechts am Schutzgegenstand) unbeschränkte\n                    Nutzungsbewilligung, den Schutzgegenstand in der folgenden Art und Weise zu\n                    nutzen:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Den Schutzgegenstand in beliebiger Form und Menge zu vervielfältigen, ihn in\n                            Sammelwerke zu integrieren und ihn als Teil solcher Sammelwerke zu\n                            vervielfältigen;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Den Schutzgegenstand zu bearbeiten, einschließlich Übersetzungen unter\n                            Nutzung jedweder Medien anzufertigen, sofern deutlich erkennbar gemacht\n                            wird, dass es sich um eine Bearbeitung handelt;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Den Schutzgegenstand, allein oder in Sammelwerke aufgenommen, öffentlich\n                            wiederzugeben und zu verbreiten; und\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Bearbeitungen des Schutzgegenstandes zu veröffentlichen, öffentlich\n                            wiederzugeben und zu verbreiten.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Bezüglich Vergütung für die Nutzung des Schutzgegenstandes gilt Folgendes:\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    Unverzichtbare gesetzliche Vergütungsansprüche: Soweit unverzichtbare\n                                    Vergütungsansprüche im Gegenzug für gesetzliche Lizenzen vorgesehen\n                                    oder Pauschalabgabensysteme (zum Beispiel für Leermedien) vorhanden\n                                    sind, behält sich der Lizenzgeber das ausschließliche Recht vor, die\n                                    entsprechenden Vergütungsansprüche für jede Ausübung eines Rechts\n                                    aus dieser Lizenz durch Sie geltend zu machen.\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    Vergütung bei Zwangslizenzen: Soweit Zwangslizenzen außerhalb dieser\n                                    Lizenz vorgesehen sind und zustande kommen, verzichtet der\n                                    Lizenzgeber für alle Fälle einer lizenzgerechten Nutzung des\n                                    Schutzgegenstandes durch Sie auf jegliche Vergütung.\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    Vergütung in sonstigen Fällen: Bezüglich lizenzgerechter Nutzung des\n                                    Schutzgegenstandes durch Sie, die nicht unter die beiden vorherigen\n                                    Abschnitte (i) und (ii) fällt, verzichtet der Lizenzgeber auf jegliche\n                                    Vergütung, unabhängig davon, ob eine Geltendmachung der\n                                    Vergütungsansprüche durch ihn selbst oder nur durch eine\n                                    Verwertungsgesellschaft möglich wäre.\n                    Die vorgenannte Nutzungsbewilligung wird für alle bekannten sowie alle noch\n                    nicht bekannten Nutzungsarten eingeräumt. Sie beinhaltet auch das Recht, solche\n                    Änderungen am Schutzgegenstand vorzunehmen, die für bestimmte nach dieser\n                    Lizenz zulässige Nutzungen technisch erforderlich sind. Alle sonstigen Rechte, die\n                    über diesen Abschnitt hinaus nicht ausdrücklich vom Lizenzgeber eingeräumt\n                    werden, bleiben diesem allein vorbehalten. Soweit Datenbanken oder\n                    Zusammenstellungen von Daten Schutzgegenstand dieser Lizenz oder Teil dessen\n                    sind und einen immaterialgüterrechtlichen Schutz eigener Art genießen, verzichtet\n                    der Lizenzgeber auf die Geltendmachung sämtlicher daraus resultierender Rechte.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Bedingungen\n                    Die Erteilung der Nutzungsbewilligung gemäß Abschnitt 3 dieser Lizenz erfolgt\n                    ausdrücklich nur unter den folgenden Bedingungen:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Sie dürfen den Schutzgegenstand ausschließlich unter den Bedingungen dieser\n                            Lizenz verbreiten oder öffentlich wiedergeben. Sie müssen dabei stets eine\n                            Kopie dieser Lizenz oder deren vollständige Internetadresse in Form des\n                            Uniform-Resource-Identifier (URI) beifügen. Sie dürfen keine Vertrags- oder\n                            Nutzungsbedingungen anbieten oder fordern, die die Bedingungen dieser\n                            Lizenz oder die durch diese Lizenz gewährten Rechte beschränken. Sie dürfen\n                            den Schutzgegenstand nicht unterlizenzieren. Bei jeder Kopie des\n                            Schutzgegenstandes, die Sie verbreiten oder öffentlich wiedergeben, müssen\n                            Sie alle Hinweise unverändert lassen, die auf diese Lizenz und den\n                            Haftungsausschluss hinweisen. Wenn Sie den Schutzgegenstand verbreiten\n                            oder öffentlich wiedergeben, dürfen Sie (in Bezug auf den Schutzgegenstand)\n                            keine technischen Maßnahmen ergreifen, die den Nutzer des\n                            Schutzgegenstandes in der Ausübung der ihm durch diese Lizenz gewährten\n                            Rechte behindern können. Dasselbe gilt auch für den Fall, dass der\n                            Schutzgegenstand einen Bestandteil eines Sammelwerkes bildet, was jedoch\n                            nicht bedeutet, dass das Sammelwerk insgesamt dieser Lizenz unterstellt\n                            werden muss. Sofern Sie ein Sammelwerk erstellen, müssen Sie - soweit dies\n                            praktikabel ist - auf die Mitteilung eines Lizenzgebers hin aus dem\n                            Sammelwerk die in Abschnitt 4.c) aufgezählten Hinweise entfernen. Wenn Sie\n                            eine Bearbeitung vornehmen, müssen Sie – soweit dies praktikabel ist – auf\n                            die Mitteilung eines Lizenzgebers hin von der Bearbeitung die in Abschnitt 4.c)\n                            aufgezählten Hinweise entfernen.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Sie dürfen eine Bearbeitung ausschließlich unter den Bedingungen\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    dieser Lizenz,\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    einer späteren Version dieser Lizenz mit denselben Lizenzelementen,\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    einer rechtsordnungsspezifischen Creative-Commons-Lizenz mit\n                                    denselben Lizenzelementen ab Version 3.0 aufwärts (z.B.\n                                    Namensnennung - Weitergabe unter gleichen Bedingungen 3.0 US),\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iv."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    der Creative-Commons-Unported-Lizenz mit denselben Lizenzelementen\n                                    ab Version 3.0 aufwärts, oder\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "v."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    einer mit Creative Commons kompatiblen Lizenz\n                            verbreiten oder öffentlich wiedergeben.\n                            Falls Sie die Bearbeitung gemäß Abschnitt b)(v) unter einer mit Creative\n                            Commons kompatiblen Lizenz lizenzieren, müssen Sie deren\n                            Lizenzbestimmungen Folge leisten.\n                            Falls Sie die Bearbeitung unter einer der unter b)(i)-(iv) genannten\n                            Lizenzen (\"Verwendbare Lizenzen\") lizenzieren, müssen Sie deren\n                            Lizenzbestimmungen sowie folgenden Bestimmungen Folge leisten: Sie müssen\n                            stets eine Kopie der verwendbaren Lizenz oder deren vollständige\n                            Internetadresse in Form des Uniform-Resource-Identifier (URI) beifügen, wenn\n                            Sie die Bearbeitung verbreiten oder öffentlich wiedergeben. Sie dürfen keine\n                            Vertrags- oder Nutzungsbedingungen anbieten oder fordern, die die\n                            Bedingungen der verwendbaren Lizenz oder die durch sie gewährten Rechte\n                            beschränken. Bei jeder Bearbeitung, die Sie verbreiten oder öffentlich\n                            wiedergeben, müssen Sie alle Hinweise auf die verwendbare Lizenz und den\n                            Haftungsausschluss unverändert lassen. Wenn Sie die Bearbeitung verbreiten\n                            oder öffentlich wiedergeben, dürfen Sie (in Bezug auf die Bearbeitung) keine\n                            technischen Maßnahmen ergreifen, die den Nutzer der Bearbeitung in der\n                            Ausübung der ihm durch die verwendbare Lizenz gewährten Rechte behindern\n                            können. Dieser Abschnitt 4.b) gilt auch für den Fall, dass die Bearbeitung einen\n                            Bestandteil eines Sammelwerkes bildet; dies bedeutet jedoch nicht, dass das\n                            Sammelwerk insgesamt der verwendbaren Lizenz unterstellt werden muss.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Die Verbreitung und die öffentliche Wiedergabe des Schutzgegenstandes oder\n                            auf ihm aufbauender Inhalte oder ihn enthaltender Sammelwerke ist Ihnen nur\n                            unter der Bedingung gestattet, dass Sie, vorbehaltlich etwaiger Mitteilungen im\n                            Sinne von Abschnitt 4.a), alle dazu gehörenden Rechtevermerke unberührt\n                            lassen. Sie sind verpflichtet, die Urheberschaft oder die Rechteinhaberschaft in\n                            einer der Nutzung entsprechenden, angemessenen Form anzuerkennen, indem\n                            Sie selbst – soweit bekannt – Folgendes angeben:\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    Den Namen (oder das Pseudonym, falls ein solches verwendet wird) des\n                                    Rechteinhabers, und/oder falls der Lizenzgeber im Rechtevermerk, in den\n                                    Nutzungsbedingungen oder auf andere angemessene Weise eine\n                                    Zuschreibung an Dritte vorgenommen hat (z.B. an eine Stiftung, ein\n                                    Verlagshaus oder eine Zeitung) („Zuschreibungsempfänger“), Namen\n                                    bzw. Bezeichnung dieses oder dieser Dritten;\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    den Titel des Inhaltes;\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    in einer praktikablen Form den Uniform-Resource-Identifier (URI, z.B.\n                                    Internetadresse), den der Lizenzgeber zum Schutzgegenstand angegeben\n                                    hat, es sei denn, dieser URI verweist nicht auf den Rechtevermerk oder\n                                    die Lizenzinformationen zum Schutzgegenstand;\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iv."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    und im Falle einer Bearbeitung des Schutzgegenstandes in\n                                    Übereinstimmung mit Abschnitt 3.b) einen Hinweis darauf, dass es sich\n                                    um eine Bearbeitung handelt.\n                            Die nach diesem Abschnitt 4.c) erforderlichen Angaben können in jeder\n                            angemessenen Form gemacht werden; im Falle einer Bearbeitung des\n                            Schutzgegenstandes oder eines Sammelwerkes müssen diese Angaben das\n                            Minimum darstellen und bei gemeinsamer Nennung aller Beitragenden\n                            dergestalt erfolgen, dass sie zumindest ebenso hervorgehoben sind wie die\n                            Hinweise auf die übrigen Rechteinhaber. Die Angaben nach diesem Abschnitt\n                            dürfen Sie ausschließlich zur Angabe der Rechteinhaberschaft in der oben\n                            bezeichneten Weise verwenden. Durch die Ausübung Ihrer Rechte aus dieser\n                            Lizenz dürfen Sie ohne eine vorherige, separat und schriftlich vorliegende\n                            Zustimmung des Urhebers, des Lizenzgebers und/oder des\n                            Zuschreibungsempfängers weder implizit noch explizit irgendeine Verbindung\n                            mit dem oder eine Unterstützung oder Billigung durch den Lizenzgeber oder\n                            den Zuschreibungsempfänger andeuten oder erklären.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Die oben unter 4.a) bis c) genannten Einschränkungen gelten nicht für solche\n                            Teile des Schutzgegenstandes, die allein deshalb unter den\n                            Schutzgegenstandsbegriff fallen, weil sie als Datenbanken oder\n                            Zusammenstellungen von Daten einen immaterialgüterrechtlichen Schutz\n                            eigener Art genießen.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            (Urheber)Persönlichkeitsrechte bleiben - soweit sie bestehen - von dieser\n                            Lizenz unberührt.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Gewährleistung\n                    SOFERN KEINE ANDERS LAUTENDE, SCHRIFTLICHE VEREINBARUNG ZWISCHEN\n                    DEM LIZENZGEBER UND IHNEN GESCHLOSSEN WURDE UND SOWEIT MÄNGEL\n                    NICHT ARGLISTIG VERSCHWIEGEN WURDEN, BIETET DER LIZENZGEBER DEN\n                    SCHUTZGEGENSTAND UND DIE ERTEILUNG DER NUTZUNGSBEWILLIGUNG UNTER\n                    AUSSCHLUSS JEGLICHER GEWÄHRLEISTUNG AN UND ÜBERNIMMT WEDER\n                    AUSDRÜCKLICH NOCH KONKLUDENT GARANTIEN IRGENDEINER ART. DIES UMFASST\n                    INSBESONDERE DAS FREISEIN VON SACH- UND RECHTSMÄNGELN, UNABHÄNGIG\n                    VON DEREN ERKENNBARKEIT FÜR DEN LIZENZGEBER, DIE VERKEHRSFÄHIGKEIT\n                    DES SCHUTZGEGENSTANDES, SEINE VERWENDBARKEIT FÜR EINEN BESTIMMTEN\n                    ZWECK SOWIE DIE KORREKTHEIT VON BESCHREIBUNGEN.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Haftungsbeschränkung\n                    ÜBER DIE IN ZIFFER 5 GENANNTE GEWÄHRLEISTUNG HINAUS HAFTET DER\n                    LIZENZGEBER IHNEN GEGENÜBER FÜR SCHÄDEN JEGLICHER ART NUR BEI GROBER\n                    FAHRLÄSSIGKEIT ODER VORSATZ, UND ÜBERNIMMT DARÜBER HINAUS KEINERLEI\n                    FREIWILLIGE HAFTUNG FÜR FOLGE- ODER ANDERE SCHÄDEN, AUCH WENN ER\n                    ÜBER DIE MÖGLICHKEIT IHRES EINTRITTS UNTERRICHTET WURDE.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Erlöschen\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Diese Lizenz und die durch sie erteilte Nutzungsbewilligung erlöschen mit\n                            Wirkung für die Zukunft im Falle eines Verstoßes gegen die Lizenzbedingungen\n                            durch Sie, ohne dass es dazu der Kenntnis des Lizenzgebers vom Verstoß oder\n                            einer weiteren Handlung einer der Vertragsparteien bedarf. Mit natürlichen oder\n                            juristischen Personen, die Bearbeitungen des Schutzgegenstandes oder diesen\n                            enthaltende Sammelwerke sowie entsprechende Vervielfältigungsstücke unter\n                            den Bedingungen dieser Lizenz von Ihnen erhalten haben, bestehen\n                            nachträglich entstandene Lizenzbeziehungen jedoch solange weiter, wie die\n                            genannten Personen sich ihrerseits an sämtliche Lizenzbedingungen halten.\n                            Darüber hinaus gelten die Ziffern 1, 2, 5, 6, 7, und 8 auch nach einem\n                            Erlöschen dieser Lizenz fort.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Vorbehaltlich der oben genannten Bedingungen gilt diese Lizenz unbefristet bis\n                            der rechtliche Schutz für den Schutzgegenstand ausläuft. Davon abgesehen\n                            behält der Lizenzgeber das Recht, den Schutzgegenstand unter anderen\n                            Lizenzbedingungen anzubieten oder die eigene Weitergabe des\n                            Schutzgegenstandes jederzeit einzustellen, solange die Ausübung dieses Rechts\n                            nicht einer Kündigung oder einem Widerruf dieser Lizenz (oder irgendeiner\n                            Weiterlizenzierung, die auf Grundlage dieser Lizenz bereits erfolgt ist bzw.\n                            zukünftig noch erfolgen muss) dient und diese Lizenz unter Berücksichtigung\n                            der oben zum Erlöschen genannten Bedingungen vollumfänglich wirksam bleibt.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sonstige Bestimmungen\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Jedes Mal wenn Sie den Schutzgegenstand für sich genommen oder als Teil\n                            eines Sammelwerkes verbreiten oder öffentlich wiedergeben, bietet der\n                            Lizenzgeber dem Empfänger eine Lizenz zu den gleichen Bedingungen und im\n                            gleichen Umfang an, wie Ihnen in Form dieser Lizenz.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Jedes Mal wenn Sie eine Bearbeitung des Schutzgegenstandes verbreiten oder\n                            öffentlich wiedergeben, bietet der Lizenzgeber dem Empfänger eine Lizenz am\n                            ursprünglichen Schutzgegenstand zu den gleichen Bedingungen und im\n                            gleichen Umfang an, wie Ihnen in Form dieser Lizenz.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Sollte eine Bestimmung dieser Lizenz unwirksam sein, so bleibt davon die\n                            Wirksamkeit der Lizenz im Übrigen unberührt.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Keine Bestimmung dieser Lizenz soll als abbedungen und kein Verstoß gegen\n                            sie als zulässig gelten, solange die von dem Verzicht oder von dem Verstoß\n                            betroffene Seite nicht schriftlich zugestimmt hat.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Diese Lizenz (zusammen mit in ihr ausdrücklich vorgesehenen Erlaubnissen,\n                            Mitteilungen und Zustimmungen, soweit diese tatsächlich vorliegen) stellt die\n                            vollständige Vereinbarung zwischen dem Lizenzgeber und Ihnen in Bezug auf\n                            den Schutzgegenstand dar. Es bestehen keine Abreden, Vereinbarungen oder\n                            Erklärungen in Bezug auf den Schutzgegenstand, die in dieser Lizenz nicht\n                            genannt sind. Rechtsgeschäftliche Änderungen des Verhältnisses zwischen dem\n                            Lizenzgeber und Ihnen sind nur über Modifikationen dieser Lizenz möglich. Der\n                            Lizenzgeber ist an etwaige zusätzliche, einseitig durch Sie übermittelte\n                            Bestimmungen nicht gebunden. Diese Lizenz kann nur durch schriftliche\n                            Vereinbarung zwischen Ihnen und dem Lizenzgeber modifiziert werden. Derlei\n                            Modifikationen wirken ausschließlich zwischen dem Lizenzgeber und Ihnen und\n                            wirken sich nicht auf die Dritten gemäß 8.a) und b) angebotenen Lizenzen aus.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Sofern zwischen Ihnen und dem Lizenzgeber keine anderweitige Vereinbarung\n                            getroffen wurde und soweit Wahlfreiheit besteht, findet auf diesen\n                            Lizenzvertrag das Recht der Republik Österreich Anwendung.\n            Creative Commons Notice\n            Creative Commons ist nicht Partei dieser Lizenz und übernimmt keinerlei Gewähr oder\n            dergleichen in Bezug auf den Schutzgegenstand. Creative Commons haftet Ihnen oder\n            einer anderen Partei unter keinem rechtlichen Gesichtspunkt für irgendwelche Schäden,\n            die - abstrakt oder konkret, zufällig oder vorhersehbar - im Zusammenhang mit dieser\n            Lizenz entstehen. Unbeschadet der vorangegangen beiden Sätze, hat Creative Commons\n            alle Rechte und Pflichten eines Lizenzgebers, wenn es sich ausdrücklich als Lizenzgeber im\n            Sinne dieser Lizenz bezeichnet.\n            Creative Commons gewährt den Parteien nur insoweit das Recht, das Logo und die\n            Marke \"Creative Commons\" zu nutzen, als dies notwendig ist, um der Öffentlichkeit\n            gegenüber kenntlich zu machen, dass der Schutzgegenstand unter einer CCPL steht. Ein\n            darüber hinaus gehender Gebrauch der Marke \"Creative Commons\" oder einer verwandten\n            Marke oder eines verwandten Logos bedarf der vorherigen schriftlichen Zustimmung von\n            Creative Commons. Jeder erlaubte Gebrauch richtet sich nach der Creative Commons\n            Marken-Nutzungs-Richtlinie in der jeweils aktuellen Fassung, die von Zeit zu Zeit auf der\n            Website veröffentlicht oder auf andere Weise auf Anfrage zugänglich gemacht wird. Zur\n            Klarstellung: Die genannten Einschränkungen der Markennutzung sind nicht Bestandteil\n            dieser Lizenz.\n            Creative Commons kann kontaktiert werden über https://creativecommons.org/."}]