[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nCreative Commons Attribution-ShareAlike 1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nCREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS\nDRAFT LICENSE DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\nINFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE\nINFORMATION PROVIDED, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\nLicense\n"}]}, {"tag": "text", "content": "\nTHE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE\n(\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE\nLAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE IS PROHIBITED.\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS\nLICENSE. THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH\nTERMS AND CONDITIONS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Collective Work\" means a work, such as a periodical issue, anthology or\nencyclopedia, in which the Work in its entirety in unmodified form, along with a number of\nother contributions, constituting separate and independent works in themselves, are\nassembled into a collective whole. A work that constitutes a Collective Work will not be\nconsidered a Derivative Work (as defined below) for the purposes of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Derivative Work\" means a work based upon the Work or upon the Work and other\npre-existing works, such as a translation, musical arrangement, dramatization,\nfictionalization, motion picture version, sound recording, art reproduction, abridgment,\ncondensation, or any other form in which the Work may be recast, transformed, or adapted,\nexcept that a work that constitutes a Collective Work will not be considered a Derivative\nWork for the purpose of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Licensor\" means the individual or entity that offers the Work under the terms of\nthis License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Author\" means the individual or entity who created the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "e."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Work\" means the copyrightable work of authorship offered under the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "f."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" means an individual or entity exercising rights under this License who has\nnot previously violated the terms of this License with respect to the Work, or who has\nreceived express permission from the Licensor to exercise rights under this License\ndespite a previous violation.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFair Use Rights. Nothing in this license is intended to reduce, limit, or restrict any rights\narising from fair use, first sale or other limitations on the exclusive rights of the\ncopyright owner under copyright law or other applicable laws.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a\nworldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable\ncopyright) license to exercise the rights in the Work as stated below:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto reproduce the Work, to incorporate the Work into one or more Collective Works, and to\nreproduce the Work as incorporated in the Collective Works;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto create and reproduce Derivative Works;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto distribute copies or phonorecords of, display publicly, perform publicly, and perform\npublicly by means of a digital audio transmission the Work including as incorporated in\nCollective Works;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto distribute copies or phonorecords of, display publicly, perform publicly, and perform\npublicly by means of a digital audio transmission Derivative Works;\nThe above rights may be exercised in all media and formats whether now known or hereafter\ndevised. The above rights include the right to make such modifications as are technically\nnecessary to exercise the rights in other media and formats. All rights not expressly\ngranted by Licensor are hereby reserved.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRestrictions. The license granted in Section 3 above is expressly made subject to and limited by\nthe following restrictions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may distribute, publicly display, publicly perform, or publicly digitally perform the\nWork only under the terms of this License, and You must include a copy of, or the Uniform\nResource Identifier for, this License with every copy or phonorecord of the Work You\ndistribute, publicly display, publicly perform, or publicly digitally perform. You may not\noffer or impose any terms on the Work that alter or restrict the terms of this License or\nthe recipients' exercise of the rights granted hereunder. You may not sublicense the\nWork. You must keep intact all notices that refer to this License and to the disclaimer of\nwarranties. You may not distribute, publicly display, publicly perform, or publicly\ndigitally perform the Work with any technological measures that control access or use of\nthe Work in a manner inconsistent with the terms of this License Agreement. The above\napplies to the Work as incorporated in a Collective Work, but this does not require the\nCollective Work apart from the Work itself to be made subject to the terms of this\nLicense. If You create a Collective Work, upon notice from any Licensor You must, to the\nextent practicable, remove from the Collective Work any reference to such Licensor or the\nOriginal Author, as requested. If You create a Derivative Work, upon notice from any\nLicensor You must, to the extent practicable, remove from the Derivative Work any\nreference to such Licensor or the Original Author, as requested.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may distribute, publicly display, publicly perform, or publicly digitally perform a\nDerivative Work only under the terms of this License, and You must include a copy of, or\nthe Uniform Resource Identifier for, this License with every copy or phonorecord of each\nDerivative Work You distribute, publicly display, publicly perform, or publicly digitally\nperform. You may not offer or impose any terms on the Derivative Works that alter or\nrestrict the terms of this License or the recipients' exercise of the rights granted\nhereunder, and You must keep intact all notices that refer to this License and to the\ndisclaimer of warranties. You may not distribute, publicly display, publicly perform, or\npublicly digitally perform the Derivative Work with any technological measures that\ncontrol access or use of the Work in a manner inconsistent with the terms of this License\nAgreement. The above applies to the Derivative Work as incorporated in a Collective Work,\nbut this does not require the Collective Work apart from the Derivative Work itself to be\nmade subject to the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf you distribute, publicly display, publicly perform, or publicly digitally perform the Work\nor any Derivative Works or Collective Works, You must keep intact all copyright notices\nfor the Work and give the Original Author credit reasonable to the medium or means You are\nutilizing by conveying the name (or pseudonym if applicable) of the Original Author if\nsupplied; the title of the Work if supplied; in the case of a Derivative Work, a credit\nidentifying the use of the Work in the Derivative Work (e.g., \"French translation of\nthe Work by Original Author,\" or \"Screenplay based on original Work by Original\nAuthor\"). Such credit may be implemented in any reasonable manner; provided, however,\nthat in the case of a Derivative Work or Collective Work, at a minimum such credit will\nappear where any other comparable authorship credit appears and in a manner at least as\nprominent as such other comparable authorship credit.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentations, Warranties and Disclaimer\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nBy offering the Work for public release under this License, Licensor represents and warrants\nthat, to the best of Licensor's knowledge after reasonable inquiry:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "i."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicensor has secured all rights in the Work necessary to grant the license rights\nhereunder and to permit the lawful exercise of the rights granted hereunder without\nYou having any obligation to pay any royalties, compulsory license fees, residuals or\nany other payments;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "ii."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Work does not infringe the copyright, trademark, publicity rights, common law rights\nor any other right of any third party or constitute defamation, invasion of privacy or\nother tortious injury to any third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEXCEPT AS EXPRESSLY STATED IN THIS LICENSE OR OTHERWISE AGREED IN WRITING OR REQUIRED BY\nAPPLICABLE LAW, THE WORK IS LICENSED ON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OF\nANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES\nREGARDING THE CONTENTS OR ACCURACY OF THE WORK.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, AND EXCEPT FOR DAMAGES\nARISING FROM LIABILITY TO A THIRD PARTY RESULTING FROM BREACH OF THE WARRANTIES IN SECTION 5,\nIN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL,\nCONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE\nWORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically upon any breach by\nYou of the terms of this License. Individuals or entities who have received Derivative\nWorks or Collective Works from You under this License, however, will not have their\nlicenses terminated provided such individuals or entities remain in full compliance with\nthose licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the above terms and conditions, the license granted here is perpetual (for the\nduration of the applicable copyright in the Work). Notwithstanding the above, Licensor\nreserves the right to release the Work under different license terms or to stop\ndistributing the Work at any time; provided, however that any such election will not serve\nto withdraw this License (or any other license that has been, or is required to be,\ngranted under the terms of this License), and this License will continue in full force and\neffect unless terminated as stated above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach time You distribute or publicly digitally perform the Work or a Collective Work, the\nLicensor offers to the recipient a license to the Work on the same terms and conditions as\nthe license granted to You under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach time You distribute or publicly digitally perform a Derivative Work, Licensor offers to\nthe recipient a license to the original Work on the same terms and conditions as the\nlicense granted to You under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf any provision of this License is invalid or unenforceable under applicable law, it shall\nnot affect the validity or enforceability of the remainder of the terms of this License,\nand without further action by the parties to this agreement, such provision shall be\nreformed to the minimum extent necessary to make such provision valid and enforceable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNo term or provision of this License shall be deemed waived and no breach consented to unless\nsuch waiver or consent shall be in writing and signed by the party to be charged with such\nwaiver or consent.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "e."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License constitutes the entire agreement between the parties with respect to the Work\nlicensed here. There are no understandings, agreements or representations with respect to\nthe Work not specified here. Licensor shall not be bound by any additional provisions that\nmay appear in any communication from You. This License may not be modified without the\nmutual written agreement of the Licensor and You.\nCreative Commons is not a party to this License, and makes no warranty whatsoever in connection with the\nWork. Creative Commons will not be liable to You or any party on any legal theory for any damages\nwhatsoever, including without limitation any general, special, incidental or consequential damages\narising in connection to this license. Notwithstanding the foregoing two (2) sentences, if Creative\nCommons has expressly identified itself as the Licensor hereunder, it shall have all rights and\nobligations of Licensor.\nExcept for the limited purpose of indicating to the public that the Work is licensed under the CCPL,\nneither party will use the trademark \"Creative Commons\" or any related trademark or logo of\nCreative Commons without the prior written consent of Creative Commons. Any permitted use will be in\ncompliance with Creative Commons' then-current trademark usage guidelines, as may be published on\nits website or otherwise made available upon request from time to time.\nCreative Commons may be contacted at http://creativecommons.org/.\n"}]