[{"type": "optional", "content": [{"type": "optional", "content": [{"type": "text", "content": "Creative Commons "}, {"type": "optional", "content": {"type": "text", "content": "Legal Code"}}]}, {"type": "text", "content": "\n          \nCC0 1.0 Universal"}]}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL SERVICES. DISTRIBUTION OF THIS\n         DOCUMENT DOES NOT CREATE AN ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION\n         ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE USE OF THIS DOCUMENT\n         OR THE INFORMATION OR WORKS PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM THE\n         USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED HEREUNDER."}}, {"type": "text", "content": "\n\n      \nStatement of Purpose\n\n      \nThe laws of most jurisdictions throughout the world automatically confer exclusive Copyright and Related\n         Rights (defined below) upon the creator and subsequent owner(s) (each and all, an \"owner\")\n         of an original work of authorship and/or a database (each, a \"Work\").\n\n      \nCertain owners wish to permanently relinquish those rights to a Work for the purpose of contributing to a\n         commons of creative, cultural and scientific works (\"Commons\") that the public can reliably\n         and without fear of later claims of infringement build upon, modify, incorporate in other works, reuse\n         and redistribute as freely as possible in any form whatsoever and for any purposes, including without\n         limitation commercial purposes. These owners may contribute to the Commons to promote the ideal of a\n         free culture and the further production of creative, cultural and scientific works, or to gain\n         reputation or greater distribution for their Work in part through the use and efforts of others.\n\n      \nFor these and/or other purposes and motivations, and without any expectation of additional consideration\n         or compensation, the person associating CC0 with a Work (the \"Affirmer\"), to the extent that\n         he or she is an owner of Copyright and Related Rights in the Work, voluntarily elects to apply CC0 to\n         the Work and publicly distribute the Work under its terms, with knowledge of his or her Copyright and\n         Related Rights in the Work and the meaning and intended legal effect of CC0 on those rights.\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Copyright and Related Rights. A Work made available under CC0 may be protected by copyright and\n             related or neighboring rights (\"Copyright and Related Rights\"). Copyright and\n             Related Rights include, but are not limited to, the following:\n           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              the right to reproduce, adapt, distribute, perform, display, communicate, and translate a Work;\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              moral rights retained by the original author(s) and/or performer(s);\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              publicity and privacy rights pertaining to a person's image or likeness depicted in a Work;\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iv."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              rights protecting against unfair competition in regards to a Work, subject to the limitations\n                 in paragraph 4(a), below;\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "v."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              rights protecting the extraction, dissemination, use and reuse of data in a Work;\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "vi."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              database rights (such as those arising under Directive 96/9/EC of the European Parliament and\n                 of the Council of 11 March 1996 on the legal protection of databases, and under any\n                 national implementation thereof, including any amended or successor version of such\n                 directive); and\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "vii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              other similar, equivalent or corresponding rights throughout the world based on applicable\n                 law or treaty, and any national implementations thereof.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Waiver. To the greatest extent permitted by, but not in contravention of, applicable law,\n             Affirmer hereby overtly, fully, permanently, irrevocably and unconditionally waives, abandons,\n             and surrenders all of Affirmer's Copyright and Related Rights and associated claims and\n             causes of action, whether now known or unknown (including existing as well as future claims\n             and causes of action), in the Work (i) in all territories worldwide, (ii) for the maximum\n             duration provided by applicable law or treaty (including future time extensions), (iii) in any\n             current or future medium and for any number of copies, and (iv) for any purpose whatsoever,\n             including without limitation commercial, advertising or promotional purposes (the\n             \"Waiver\"). Affirmer makes the Waiver for the benefit of each member of the public at\n             large and to the detriment of Affirmer's heirs and successors, fully intending that such\n             Waiver shall not be subject to revocation, rescission, cancellation, termination, or any other\n             legal or equitable action to disrupt the quiet enjoyment of the Work by the public as\n             contemplated by Affirmer's express Statement of Purpose.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Public License Fallback. Should any part of the Waiver for any reason be judged legally invalid\n             or ineffective under applicable law, then the Waiver shall be preserved to the maximum extent\n             permitted taking into account Affirmer's express Statement of Purpose. In addition, to\n             the extent the Waiver is so judged Affirmer hereby grants to each affected person a\n             royalty-free, non transferable, non sublicensable, non exclusive, irrevocable and\n             unconditional license to exercise Affirmer's Copyright and Related Rights in the Work (i)\n             in all territories worldwide, (ii) for the maximum duration provided by applicable law or\n             treaty (including future time extensions), (iii) in any current or future medium and for any\n             number of copies, and (iv) for any purpose whatsoever, including without limitation\n             commercial, advertising or promotional purposes (the \"License\"). The License shall\n             be deemed effective as of the date CC0 was applied by Affirmer to the Work. Should any part of\n             the License for any reason be judged legally invalid or ineffective under applicable law, such\n             partial invalidity or ineffectiveness shall not invalidate the remainder of the License, and\n             in such case Affirmer hereby affirms that he or she will not (i) exercise any of his or her\n             remaining Copyright and Related Rights in the Work or (ii) assert any associated claims and\n             causes of action with respect to the Work, in either case contrary to Affirmer's express\n             Statement of Purpose.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Limitations and Disclaimers.\n           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              No trademark or patent rights held by Affirmer are waived, abandoned, surrendered, licensed\n                 or otherwise affected by this document.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Affirmer offers the Work as-is and makes no representations or warranties of any kind\n                 concerning the Work, express, implied, statutory or otherwise, including without\n                 limitation warranties of title, merchantability, fitness for a particular purpose, non\n                 infringement, or the absence of latent or other defects, accuracy, or the present or\n                 absence of errors, whether or not discoverable, all to the greatest extent permissible\n                 under applicable law.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Affirmer disclaims responsibility for clearing rights of other persons that may apply to the\n                 Work or any use thereof, including without limitation any person's Copyright and\n                 Related Rights in the Work. Further, Affirmer disclaims responsibility for obtaining any\n                 necessary consents, permissions or other rights required for any use of the Work.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Affirmer understands and acknowledges that Creative Commons is not a party to this document\n                 and has no duty or obligation with respect to this CC0 or use of the Work.\n      "}, {"type": "optional", "content": {"type": "var", "name": "upstreamLink", "content": [], "pattern": "For more information, please see <http://creativecommons.org/publicdomain/zero/1.0/>"}}]