[{"type": "optional", "content": [{"type": "optional", "content": {"type": "text", "content": "Creative Commons"}}, {"type": "text", "content": "Attribution 2.5 Australia"}]}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE LEGAL\n          SERVICES. DISTRIBUTION OF THIS LICENCE DOES NOT CREATE AN ATTORNEY-CLIENT\n          RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS INFORMATION ON AN \"AS-IS\" BASIS.\n          CREATIVE COMMONS MAKES NO WARRANTIES REGARDING THE INFORMATION PROVIDED,\n          AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM ITS USE.\n        Licence"}}, {"type": "text", "content": "\n\n      THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE\n        COMMONS PUBLIC LICENCE (\"CCPL\" OR \"LICENCE\"). THE WORK IS PROTECTED BY COPYRIGHT\n        AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORISED UNDER\n        THIS LICENCE AND/OR APPLICABLE LAW IS PROHIBITED.\n      BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE\n        BOUND BY THE TERMS OF THIS LICENCE. THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED\n        HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Collective Work\" means a work, such as a periodical issue, anthology or\n            encyclopaedia, in which the Work in its entirety in unmodified form, along with a\n            number of other contributions, constituting separate and independent works in\n            themselves, are assembled into a collective whole. A work that constitutes a\n            Collective Work will not be considered a Derivative Work (as defined below) for the\n            purposes of this Licence.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Derivative Work\" means a work that reproduces a substantial part of the Work,\n            or of the Work and other pre-existing works protected by copyright, or that is an\n            adaptation of a Work that is a literary, dramatic, musical or artistic work.\n            Derivative Works include a translation, musical arrangement, dramatisation,\n            motion picture version, sound recording, art reproduction, abridgment, condensation,\n            or any other form in which a work may be adapted, except that a\n            work that constitutes a Collective Work will not be considered a Derivative Work for\n            the purpose of this Licence. For the avoidance of doubt, where the Work is a\n            musical composition or sound recording, the synchronization of the Work in timed-relation\n            with a moving image (\"synching\") will be considered a Derivative Work for\n            the purpose of this Licence.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Licensor\" means the individual or entity that offers the Work under the terms of\n            this Licence.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Moral rights law\" means laws under which an individual who creates a work\n            protected by copyright has rights of integrity of authorship of the work, rights of\n            attribution of authorship of the work, rights not to have authorship of the work\n            falsely attributed, or rights of a similar or analogous nature in the work anywhere\n            in the world.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Original Author\" means the individual or entity who created the Work.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Work\" means the work or other subject-matter protected by copyright that is\n            offered under the terms of this Licence, which may include (without limitation) a\n            literary, dramatic, musical or artistic work, a sound recording or cinematograph\n            film, a published edition of a literary, dramatic, musical or artistic work or a\n            television or sound broadcast.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "g."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"You\" means an individual or entity exercising rights under this Licence who has\n            not previously violated the terms of this Licence with respect to the Work, or who\n            has received express permission from the Licensor to exercise rights under this\n            Licence despite a previous violation.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "h."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            \"Licence Elements\" means the following high-level licence attributes as selected\n            by Licensor and indicated in the title of this Licence: Attribution, NonCommercial,\n            NoDerivatives, ShareAlike.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Fair Dealing and Other Rights. Nothing in this Licence excludes or modifies, or is intended\n          to exclude or modify, (including by reducing, limiting, or restricting) the rights of You or others to\n          use the Work arising from fair dealings or other limitations on the rights of the copyright owner\n          or the Original Author under copyright law, moral rights law or other applicable laws.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Licence Grant. Subject to the terms and conditions of this Licence, Licensor hereby grants\n          You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable\n          copyright) licence to exercise the rights in the Work as stated below:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            to reproduce the Work, to incorporate the Work into one or more Collective Works,\n            and to reproduce the Work as incorporated in the Collective Works;\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            to create and reproduce Derivative Works;\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            to publish, communicate to the public, distribute copies or records of, exhibit or\n            display publicly, perform publicly and perform publicly by means of a digital audio\n            transmission the Work including as incorporated in Collective Works;\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            to publish, communicate to the public, distribute copies or records of, exhibit or\n            display publicly, perform publicly, and perform publicly by means of a digital audio\n            transmission Derivative Works;\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            For the avoidance of doubt, where the Work is a musical composition:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Performance Royalties Under Blanket Licences. Licensor will\n              not collect, whether individually or via a performance rights society,\n              royalties for Your communication to the public, broadcast, public\n              performance or public digital performance (e.g. webcast) of the Work.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Mechanical Rights and Statutory Royalties. Licensor will not\n              collect, whether individually or via a music rights agency, designated\n              agent or a music publisher, royalties for any record You create from\n              the Work (\"cover version\") and distribute, subject to the compulsory\n              licence created by 17 USC Section 115 of the US Copyright Act (or\n              an equivalent statutory licence under the Australian Copyright Act or\n              in other jurisdictions).\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Webcasting Rights and Statutory Royalties. For the avoidance of doubt, where\n            the Work is a sound recording, Licensor will not collect, whether individually or via\n            a performance-rights society, royalties for Your public digital performance (e.g.\n            webcast) of the Work, subject to the compulsory licence created by 17 USC Section\n            114 of the US Copyright Act (or the equivalent in other jurisdictions).\n        The above rights may be exercised in all media and formats whether now known or hereafter\n          devised. The above rights include the right to make such modifications as are technically\n          necessary to exercise the rights in other media and formats. All rights not expressly granted by\n          Licensor under this Licence are hereby reserved.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Restrictions. The licence granted in Section 3 above is expressly made subject to and limited\n          by the following restrictions:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              You may publish, communicate to the public, distribute, publicly exhibit or display,\n              publicly perform, or publicly digitally perform the Work only under the terms of this\n              Licence, and You must include a copy of, or the Uniform Resource Identifier for, this\n              Licence with every copy or record of the Work You publish, communicate to the\n              public, distribute, publicly exhibit or display, publicly perform or publicly digitally\n              perform. You may not offer or impose any terms on the Work that exclude, alter or\n              restrict the terms of this Licence or the recipients' exercise of the rights granted\n              hereunder. You may not sublicense the Work. You must keep intact all notices that\n              refer to this Licence and to the disclaimer of representations and warranties. You\n              may not publish, communicate to the public, distribute, publicly exhibit or display,\n              publicly perform, or publicly digitally perform the Work with any technological\n              measures that control access or use of the Work in a manner inconsistent with the\n              terms of this Licence. The above applies to the Work as incorporated in a Collective\n              Work, but this does not require the Collective Work apart from the Work itself to be\n              made subject to the terms of this Licence. If You create a Collective Work, upon\n              notice from any Licensor You must, to the extent practicable, remove from the\n              Collective Work any credit as required by Section 4(b), as requested. If You create\n              a Derivative Work, upon notice from any Licensor You must, to the extent\n              practicable, remove from the Derivative Work any credit as required by Section\n              4(b), as requested.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If you publish, communicate to the public, distribute, publicly exhibit or display,\n              publicly perform, or publicly digitally perform the Work or any Derivative Works or\n              Collective Works, You must keep intact all copyright notices for the Work. You must\n              also give clear and reasonably prominent credit to (i) the Original Author (by name\n              or pseudonym if applicable), if the name or pseudonym is supplied; and (ii) if\n              another party or parties (eg a sponsor institute, publishing entity or journal) is\n              designated for attribution in the copyright notice, terms of service or other\n              reasonable means associated with the Work, such party or parties. If applicable,\n              that credit must be given in the particular way made known by the Original Author\n              and otherwise as reasonable to the medium or means You are utilizing, by\n              conveying the identity of the Original Author and the other designated party or\n              parties (if applicable); the title of the Work if supplied; to the extent reasonably\n              practicable, the Uniform Resource Identifier, if any, that Licensor specifies to be\n              associated with the Work, unless such URI does not refer to the copyright notice or\n              licensing information for the Work; and in the case of a Derivative Work, a credit\n              identifying the use of the Work in the Derivative Work (e.g., \"French translation of\n              the Work by Original Author,\" or \"Screenplay based on original Work by Original\n              Author\"). Such credit may be implemented in any reasonable manner; provided,\n              however, that in the case of a Derivative Work or Collective Work, at a minimum\n              such credit will appear where any other comparable authorship credit appears and\n              in a manner at least as prominent as such other comparable authorship credit.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              False attribution prohibited. Except as otherwise agreed in writing by the\n              Licensor, if You publish, communicate to the public, distribute, publicly exhibit or\n              display, publicly perform, or publicly digitally perform the Work or any Derivative\n              Works or Collective Works in accordance with this Licence, You must not falsely\n              attribute the Work to someone other than the Original Author.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Prejudice to honour or reputation prohibited. Except as otherwise agreed in\n              writing by the Licensor, if you publish, communicate to the public, distribute,\n              publicly exhibit or display, publicly perform, or publicly digitally perform the Work\n              or any Derivative Works or Collective Works, You must not do anything that results\n              in a material distortion of, the mutilation of, or a material alteration to, the Work\n              that is prejudicial to the Original Author's honour or reputation, and You must not\n              do anything else in relation to the Work that is prejudicial to the Original Author's\n              honour or reputation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Disclaimer.\n          EXCEPT AS EXPRESSLY STATED IN THIS LICENCE OR OTHERWISE MUTUALLY AGREED TO BY THE\n            PARTIES IN WRITING, AND TO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, LICENSOR\n            OFFERS THE WORK \"AS-IS\" AND MAKES NO REPRESENTATIONS, WARRANTIES OR CONDITIONS\n            OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE,\n            INCLUDING, WITHOUT LIMITATION, ANY REPRESENTATIONS, WARRANTIES OR CONDITIONS\n            REGARDING THE CONTENTS OR ACCURACY OF THE WORK, OR OF TITLE, MERCHANTABILITY,\n            FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, THE ABSENCE OF LATENT OR\n            OTHER DEFECTS, OR THE PRESENCE OR ABSENCE OF ERRORS, WHETHER OR NOT\n            DISCOVERABLE.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Limitation on Liability.\n          TO THE FULL EXTENT PERMITTED BY APPLICABLE LAW, AND EXCEPT FOR ANY LIABILITY\n            ARISING FROM CONTRARY MUTUAL AGREEMENT AS REFERRED TO IN SECTION 5, IN NO EVENT\n            WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY (INCLUDING, WITHOUT LIMITATION,\n            NEGLIGENCE) FOR ANY LOSS OR DAMAGE WHATSOEVER, INCLUDING (WITHOUT LIMITATION)\n            LOSS OF PRODUCTION OR OPERATION TIME, LOSS, DAMAGE OR CORRUPTION OF DATA OR\n            RECORDS; OR LOSS OF ANTICIPATED SAVINGS, OPPORTUNITY, REVENUE, PROFIT OR\n            GOODWILL, OR OTHER ECONOMIC LOSS; OR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL,\n            PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF OR IN CONNECTION WITH THIS LICENCE\n            OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF\n            SUCH DAMAGES.\n          If applicable legislation implies warranties or conditions, or imposes obligations or liability on the\n            Licensor in respect of this Licence that cannot be wholly or partly excluded, restricted or\n            modified, the Licensor's liability is limited, to the full extent permitted by the applicable\n            legislation, at its option, to:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              in the case of goods, any one or more of the following:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the replacement of the goods or the supply of equivalent goods;\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the repair of the goods;\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the payment of the cost of replacing the goods or of acquiring equivalent goods;\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iv."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the payment of the cost of having the goods repaired; or\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              in the case of services:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the supplying of the services again; or\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                the payment of the cost of having the services supplied again.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Termination.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              This Licence and the rights granted hereunder will terminate automatically upon\n              any breach by You of the terms of this Licence. Individuals or entities who have\n              received Derivative Works or Collective Works from You under this Licence,\n              however, will not have their licences terminated provided such individuals or\n              entities remain in full compliance with those licences. Sections 1, 2, 5, 6, 7, and 8\n              will survive any termination of this Licence.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Subject to the above terms and conditions, the licence granted here is perpetual\n              (for the duration of the applicable copyright in the Work). Notwithstanding the\n              above, Licensor reserves the right to release the Work under different licence\n              terms or to stop distributing the Work at any time; provided, however that any\n              such election will not serve to withdraw this Licence (or any other licence that has\n              been, or is required to be, granted under the terms of this Licence), and this\n              Licence will continue in full force and effect unless terminated as stated above.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Miscellaneous.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Each time You publish, communicate to the public, distribute or publicly digitally\n              perform the Work or a Collective Work, the Licensor offers to the recipient a licence\n              to the Work on the same terms and conditions as the licence granted to You under\n              this Licence.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Each time You publish, communicate to the public, distribute or publicly digitally\n              perform a Derivative Work, Licensor offers to the recipient a licence to the original\n              Work on the same terms and conditions as the licence granted to You under this\n              Licence.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If any provision of this Licence is invalid or unenforceable under applicable law, it\n              shall not affect the validity or enforceability of the remainder of the terms of this\n              Licence, and without further action by the parties to this agreement, such provision\n              shall be reformed to the minimum extent necessary to make such provision valid\n              and enforceable.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              No term or provision of this Licence shall be deemed waived and no breach\n              consented to unless such waiver or consent shall be in writing and signed by the\n              party to be charged with such waiver or consent.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              This Licence constitutes the entire agreement between the parties with respect to\n              the Work licensed here. To the full extent permitted by applicable law, there are no\n              understandings, agreements or representations with respect to the Work not\n              specified here. Licensor shall not be bound by any additional provisions that may\n              appear in any communication from You. This Licence may not be modified without\n              the mutual written agreement of the Licensor and You.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              The construction, validity and performance of this Licence shall be governed by the\n              laws in force in New South Wales, Australia.\n      "}, {"type": "optional", "content": {"type": "text", "content": "Creative Commons is not a party to this Licence, and, to the full extent permitted by\n          applicable law, makes no representation or warranty whatsoever in connection with the Work.\n          To the full extent permitted by applicable law, Creative Commons will not be liable to You or\n          any party on any legal theory (including, without limitation, negligence) for any damages\n          whatsoever, including without limitation any general, special, incidental or consequential\n          damages arising in connection to this licence. Notwithstanding the foregoing two (2)\n          sentences, if Creative Commons has expressly identified itself as the Licensor hereunder, it\n          shall have all rights and obligations of Licensor.\n        Except for the limited purpose of indicating to the public that the Work is licensed under the\n          CCPL, neither party will use the trademark \"Creative Commons\" or any related trademark or\n          logo of Creative Commons without the prior written consent of Creative Commons. Any\n          permitted use will be in compliance with Creative Commons' then-current trademark usage\n          guidelines, as may be published on its website or otherwise made available upon request from\n          time to time.\n        Creative Commons may be contacted at https://creativecommons.org/."}}]