[{"type": "optional", "content": [{"type": "optional", "content": {"type": "text", "content": "Creative Commons"}}, {"type": "text", "content": "Attribution-NonCommercial 4.0 International"}]}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": [{"type": "text", "content": "Creative Commons Corporation (“Creative Commons”) is not a law firm and does not provide legal services\n            or legal advice. Distribution of Creative Commons public licenses does not create a lawyer-client or\n            other relationship. Creative Commons makes its licenses and related information available on an\n            “as-is” basis. Creative Commons gives no warranties regarding its licenses, any material licensed\n            under their terms and conditions, or any related information. Creative Commons disclaims all liability\n            for damages resulting from their use to the fullest extent possible.\n        Using Creative Commons Public Licenses\n        Creative Commons public licenses provide a standard set of terms and conditions that creators and other\n            rights holders may use to share original works of authorship and other material subject to copyright\n            and certain other rights specified in the public license below. The following considerations are for\n            informational purposes only, are not exhaustive, and do not form part of our licenses.\n        Considerations for licensors: Our public licenses are intended for use by those authorized to give the\n                    public permission to use material in ways otherwise restricted by copyright and certain other rights.\n                    Our licenses are irrevocable. Licensors should read and understand the terms and conditions of the\n                    license they choose before applying it. Licensors should also secure all rights necessary before\n                    applying our licenses so that the public can reuse the material as expected. Licensors should clearly\n                    mark any material not subject to the license. This includes other CC-licensed material, or material\n                    used under an exception or limitation to copyright. More considerations for licensors"}, {"type": "var", "name": "considerationsLicensors", "content": {"type": "text", "content": ": wiki.creativecommons.org/Considerations_for_licensors"}, "pattern": ": wiki.creativecommons.org/Considerations_for_licensors|\\."}, {"type": "text", "content": "\n           Considerations for the public: By using one of our public licenses, a licensor grants the public\n                    permission to use the licensed material under specified terms and conditions. If the licensor’s\n                    permission is not necessary for any reason–for example, because of any applicable exception or\n                    limitation to copyright–then that use is not regulated by the license. Our licenses grant only\n                    permissions under copyright and certain other rights that a licensor has authority to grant. Use of\n                    the licensed material may still be restricted for other reasons, including because others have\n                    copyright or other rights in the material. A licensor may make special requests, such as asking that\n                    all changes be marked or described. Although not required by our licenses, you are encouraged to\n                    respect those requests where reasonable. "}, {"type": "var", "name": "spaceUnderscore", "content": {"type": "text", "content": "More considerations"}, "pattern": "More considerations|More_considerations"}, {"type": "text", "content": " for the public"}, {"type": "var", "name": "considerationsLicensees", "content": {"type": "text", "content": ": wiki.creativecommons.org/Considerations_for_licensees"}, "pattern": ": wiki.creativecommons.org/Considerations_for_licensees|\\."}]}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "Creative Commons Attribution-NonCommercial 4.0 International Public License"}}, {"type": "text", "content": "\n\n        By exercising the Licensed Rights (defined below), You accept and agree to be bound by the terms and\n            conditions of this Creative Commons Attribution-NonCommercial 4.0 International Public License\n            (\"Public License\"). To the extent this Public License may be interpreted as a contract, You are\n            granted the Licensed Rights in consideration of Your acceptance of these terms and conditions, and the\n            Licensor grants You such rights in consideration of benefits the Licensor receives from making the\n            Licensed Material available under these terms and conditions.\n        Section 1 – Definitions.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Adapted Material means material subject to Copyright and Similar Rights that is derived from\n                           or based upon the Licensed Material and in which the Licensed Material is translated,\n                           altered, arranged, transformed, or otherwise modified in a manner requiring permission\n                           under the Copyright and Similar Rights held by the Licensor. For purposes of this Public\n                           License, where the Licensed Material is a musical work, performance, or sound recording,\n                           Adapted Material is always produced where the Licensed Material is synched in timed\n                           relation with a moving image.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Adapter's License means the license You apply to Your Copyright and Similar Rights in Your\n                           contributions to Adapted Material in accordance with the terms and conditions of this\n                           Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Copyright and Similar Rights means copyright and/or similar rights closely related to\n                           copyright including, without limitation, performance, broadcast, sound recording, and Sui\n                           Generis Database Rights, without regard to how the rights are labeled or categorized. For\n                           purposes of this Public License, the rights specified in Section 2(b)(1)-(2) are not\n                           Copyright and Similar Rights.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Effective Technological Measures means those measures that, in the absence of proper\n                           authority, may not be circumvented under laws fulfilling obligations under Article 11 of\n                           the WIPO Copyright Treaty adopted on December 20, 1996, and/or similar international\n                           agreements.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Exceptions and Limitations means fair use, fair dealing, and/or any other exception or\n                           limitation to Copyright and Similar Rights that applies to Your use of the Licensed\n                           Material.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "f."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Licensed Material means the artistic or literary work, database, or other material to which\n                           the Licensor applied this Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "g."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Licensed Rights means the rights granted to You subject to the terms and conditions of this\n                           Public License, which are limited to all Copyright and Similar Rights that apply to Your\n                           use of the Licensed Material and that the Licensor has authority to license.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "h."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Licensor means the individual(s) or entity(ies) granting rights under this Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        NonCommercial means not primarily intended for or directed towards commercial advantage or\n                           monetary compensation. For purposes of this Public License, the exchange of the Licensed\n                           Material for other material subject to Copyright and Similar Rights by digital\n                           file-sharing or similar means is NonCommercial provided there is no payment of monetary\n                           compensation in connection with the exchange.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "j."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Share means to provide material to the public by any means or process that requires\n                           permission under the Licensed Rights, such as reproduction, public display, public\n                           performance, distribution, dissemination, communication, or importation, and to make\n                           material available to the public including in ways that members of the public may access\n                           the material from a place and at a time individually chosen by them.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "k."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Sui Generis Database Rights means rights other than copyright resulting from Directive\n                           96/9/EC of the European Parliament and of the Council of 11 March 1996 on the legal\n                           protection of databases, as amended and/or succeeded, as well as other essentially\n                           equivalent rights anywhere in the world.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "l."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        You means the individual or entity exercising the Licensed Rights under this Public License.\n                           Your has a corresponding meaning.\n            Section 2 – Scope.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    License grant.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Subject to the terms and conditions of this Public License, the Licensor hereby grants\n                             You a worldwide, royalty-free, non-sublicensable, non-exclusive, irrevocable license\n                             to exercise the Licensed Rights in the Licensed Material to:\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    reproduce and Share the Licensed Material, in whole or in part, for NonCommercial\n                                        purposes only; and\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    produce, reproduce, and Share Adapted Material for NonCommercial purposes only.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Exceptions and Limitations. For the avoidance of doubt, where Exceptions and Limitations\n                                apply to Your use, this Public License does not apply, and You do not need to comply\n                                with its terms and conditions.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Term. The term of this Public License is specified in Section 6(a).\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Media and formats; technical modifications allowed. The Licensor authorizes You to\n                                exercise the Licensed Rights in all media and formats whether now known or hereafter\n                                created, and to make technical modifications necessary to do so. The Licensor waives\n                                and/or agrees not to assert any right or authority to forbid You from making technical\n                                modifications necessary to exercise the Licensed Rights, including technical\n                                modifications necessary to circumvent Effective Technological Measures. For purposes\n                                of this Public License, simply making modifications authorized by this Section 2(a)(4)\n                                never produces Adapted Material.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Downstream recipients.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    Offer from the Licensor – Licensed Material. Every recipient of the Licensed Material\n                                        automatically receives an offer from the Licensor to exercise the Licensed Rights\n                                        under the terms and conditions of this Public License.\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                    No downstream restrictions. You may not offer or impose any additional or different\n                                        terms or conditions on, or apply any Effective Technological Measures to, the\n                                        Licensed Material if doing so restricts exercise of the Licensed Rights by any\n                                        recipient of the Licensed Material.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            No endorsement. Nothing in this Public License constitutes or may be construed as\n                                permission to assert or imply that You are, or that Your use of the Licensed Material\n                                is, connected with, or sponsored, endorsed, or granted official status by, the\n                                Licensor or others designated to receive attribution as provided in Section\n                                3(a)(1)(A)(i).\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Other rights.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Moral rights, such as the right of integrity, are not licensed under this Public License,\n                                    nor are publicity, privacy, and/or other similar personality rights; however, to the\n                                    extent possible, the Licensor waives and/or agrees not to assert any such rights held\n                                    by the Licensor to the limited extent necessary to allow You to exercise the Licensed\n                                    Rights, but not otherwise.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Patent and trademark rights are not licensed under this Public License.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                To the extent possible, the Licensor waives any right to collect royalties from You for\n                                    the exercise of the Licensed Rights, whether directly or through a collecting society\n                                    under any voluntary or waivable statutory or compulsory licensing scheme. In all other\n                                    cases the Licensor expressly reserves any right to collect such royalties, including\n                                    when the Licensed Material is used other than for NonCommercial purposes.\n            Section 3 – License Conditions.\n                Your exercise of the Licensed Rights is expressly made subject to the following conditions.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Attribution.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                If You Share the Licensed Material (including in modified form), You must:\n                                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                        retain the following if it is supplied by the Licensor with the Licensed Material:\n                                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                                identification of the creator(s) of the Licensed Material and any others\n                                                    designated to receive attribution, in any reasonable manner requested by\n                                                    the Licensor (including by pseudonym if designated);\n                                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                                a copyright notice;\n                                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                                a notice that refers to this Public License;\n                                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "iv."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                                a notice that refers to the disclaimer of warranties;\n                                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "v."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                                a URI or hyperlink to the Licensed Material to the extent reasonably practicable;\n                                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                        indicate if You modified the Licensed Material and retain an indication of any\n                                            previous modifications; and\n                                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "C."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                        indicate the Licensed Material is licensed under this Public License, and include the\n                                            text of, or the URI or hyperlink to, this Public License.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                You may satisfy the conditions in Section 3(a)(1) in any reasonable manner based on the\n                                    medium, means, and context in which You Share the Licensed Material. For example, it\n                                    may be reasonable to satisfy the conditions by providing a URI or hyperlink to a\n                                    resource that includes the required information.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                If requested by the Licensor, You must remove any of the information required by Section\n                                    3(a)(1)(A) to the extent reasonably practicable.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                If You Share Adapted Material You produce, the Adapter's License You apply must not\n                                    prevent recipients of the Adapted Material from complying with this Public\n                                    License.\n            Section 4 – Sui Generis Database Rights.\n                Where the Licensed Rights include Sui Generis Database Rights that apply to Your use of\n                    the Licensed Material:\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        for the avoidance of doubt, Section 2(a)(1) grants You the right to extract, reuse,\n                            reproduce, and Share all or a substantial portion of the contents of the database for\n                            NonCommercial purposes only;\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        if You include all or a substantial portion of the database contents in a database in which\n                            You have Sui Generis Database Rights, then the database in which You have Sui Generis\n                            Database Rights (but not its individual contents) is Adapted Material; and\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        You must comply with the conditions in Section 3(a) if You Share all or a substantial portion\n                            of the contents of the database.\n                For the avoidance of doubt, this Section 4 supplements and does not replace Your\n                    obligations under this Public License where the Licensed Rights include other\n                    Copyright and Similar Rights.\n            Section 5 – Disclaimer of Warranties and Limitation of Liability.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Unless otherwise separately undertaken by the Licensor, to the extent possible, the Licensor\n                            offers the Licensed Material as-is and as-available, and makes no representations or\n                            warranties of any kind concerning the Licensed Material, whether express, implied,\n                            statutory, or other. This includes, without limitation, warranties of title,\n                            merchantability, fitness for a particular purpose, non-infringement, absence of latent or\n                            other defects, accuracy, or the presence or absence of errors, whether or not known or\n                            discoverable. Where disclaimers of warranties are not allowed in full or in part, this\n                            disclaimer may not apply to You.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        To the extent possible, in no event will the Licensor be liable to You on any legal theory\n                            (including, without limitation, negligence) or otherwise for any direct, special,\n                            indirect, incidental, consequential, punitive, exemplary, or other losses, costs,\n                            expenses, or damages arising out of this Public License or use of the Licensed Material,\n                            even if the Licensor has been advised of the possibility of such losses, costs, expenses,\n                            or damages. Where a limitation of liability is not allowed in full or in part, this\n                            limitation may not apply to You.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        The disclaimer of warranties and limitation of liability provided above shall be interpreted\n                            in a manner that, to the extent possible, most closely approximates an absolute disclaimer\n                            and waiver of all liability.\n            Section 6 – Term and Termination.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        This Public License applies for the term of the Copyright and Similar Rights licensed here.\n                            However, if You fail to comply with this Public License, then Your rights under this\n                            Public License terminate automatically.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Where Your right to use the Licensed Material has terminated under Section 6(a), it reinstates:\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                automatically as of the date the violation is cured, provided it is cured within 30 days\n                                    of Your discovery of the violation; or\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                upon express reinstatement by the Licensor.\n                        For the avoidance of doubt, this Section 6(b) does not affect any right the Licensor may have\n                            to seek remedies for Your violations of this Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        For the avoidance of doubt, the Licensor may also offer the Licensed Material under separate\n                            terms or conditions or stop distributing the Licensed Material at any time; however, doing\n                            so will not terminate this Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Sections 1, 5, 6, 7, and 8 survive termination of this Public License.\n            Section 7 – Other Terms and Conditions.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        The Licensor shall not be bound by any additional or different terms or conditions\n                            communicated by You unless expressly agreed.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Any arrangements, understandings, or agreements regarding the Licensed Material not stated\n                            herein are separate from and independent of the terms and conditions of this Public\n                            License.\n            Section 8 – Interpretation.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        For the avoidance of doubt, this Public License does not, and shall not be interpreted to,\n                            reduce, limit, restrict, or impose conditions on any use of the Licensed Material that\n                            could lawfully be made without permission under this Public License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        To the extent possible, if any provision of this Public License is deemed unenforceable, it\n                            shall be automatically reformed to the minimum extent necessary to make it enforceable. If\n                            the provision cannot be reformed, it shall be severed from this Public License without\n                            affecting the enforceability of the remaining terms and conditions.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        No term or condition of this Public License will be waived and no failure to comply consented\n                            to unless expressly agreed to by the Licensor.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Nothing in this Public License constitutes or may be interpreted as a limitation upon, or\n                            waiver of, any privileges and immunities that apply to the Licensor or You, including from\n                            the legal processes of any jurisdiction or authority.\n      "}, {"type": "optional", "content": [{"type": "text", "content": "Creative Commons is not a party to its public licenses. Notwithstanding, Creative Commons may elect to\n           apply one of its public licenses to material it publishes and in those instances will be considered\n           the “Licensor.” "}, {"type": "optional", "content": {"type": "text", "content": "The text of the Creative Commons public licenses is dedicated to the public\n           domain under the CC0 Public Domain Dedication."}}, {"type": "text", "content": " Except for the limited purpose of indicating that material is shared under a Creative\n           Commons public license or as otherwise permitted by the Creative Commons policies published at\n           creativecommons.org/policies, Creative Commons does not authorize the use of the trademark “Creative\n           Commons” or any other trademark or logo of Creative Commons without its prior written consent\n           including, without limitation, in connection with any unauthorized modifications to any of its public\n           licenses or any other arrangements, understandings, or agreements concerning use of licensed material.\n           For the avoidance of doubt, this paragraph does not form part of the public licenses.\n        Creative Commons may be contacted at creativecommons.org."}]}]