[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nCOMMON DEVELOPMENT AND DISTRIBUTION LICENSE (CDDL)\nVersion 1.1\n"}]}, {"type": "text", "content": "\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDefinitions.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Contributor” means each individual or entity that creates or contributes to the\ncreation of Modifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Contributor Version” means the combination of the Original Software, prior\nModifications used by a Contributor (if any), and the Modifications made by that particular\nContributor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Covered Software” means (a) the Original Software, or (b) Modifications, or (c)\nthe combination of files containing Original Software with files containing Modifications, in\neach case including portions thereof.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Executable” means the Covered Software in any form other than Source Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Initial Developer” means the individual or entity that first makes Original\nSoftware available under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Larger Work” means a work which combines Covered Software or portions thereof with\ncode not governed by the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“License” means this document.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Licensable” means having the right to grant, to the maximum extent possible,\nwhether at the time of the initial grant or subsequently acquired, any and all of the rights\nconveyed herein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Modifications” means the Source Code and Executable form of any of the following:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "A."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny file that results from an addition to, deletion from or modification of the contents of a\nfile containing Original Software or previous Modifications;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "B."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny new file that contains any part of the Original Software or previous Modification; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "C."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny new file that is contributed or otherwise made available under the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Original Software” means the Source Code and Executable form of computer software\ncode that is originally released under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Patent Claims” means any patent claim(s), now owned or hereafter acquired,\nincluding without limitation, method, process, and apparatus claims, in any patent Licensable\nby grantor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“Source Code” means (a) the common form of computer software code in which\nmodifications are made and (b) associated documentation included in or with such code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.13."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n“You” (or “Your”) means an individual or a legal entity exercising\nrights under, and complying with all of the terms of, this License. For legal entities,\n“You” includes any entity which controls, is controlled by, or is under common\ncontrol with You. For purposes of this definition, “control” means (a) the\npower, direct or indirect, to cause the direction or management of such entity, whether by\ncontract or otherwise, or (b) ownership of more than fifty percent (50%) of the outstanding\nshares or beneficial ownership of such entity.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLicense Grants.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Initial Developer Grant.\nConditioned upon Your compliance with Section 3.1 below and subject to third party\nintellectual property claims, the Initial Developer hereby grants You a world-wide,\nroyalty-free, non-exclusive license:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Initial\nDeveloper, to use, reproduce, modify, display, perform, sublicense and distribute the\nOriginal Software (or portions thereof), with or without Modifications, and/or as part of\na Larger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder Patent Claims infringed by the making, using or selling of Original Software, to make,\nhave made, use, practice, sell, and offer for sale, and/or otherwise dispose of the\nOriginal Software (or portions thereof).\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe licenses granted in Sections 2.1(a) and (b) are effective on the date Initial Developer\nfirst distributes or otherwise makes the Original Software available to a third party\nunder the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotwithstanding Section 2.1(b) above, no patent license is granted: (1) for code that You\ndelete from the Original Software, or (2) for infringements caused by: (i) the\nmodification of the Original Software, or (ii) the combination of the Original Software\nwith other software or devices.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nContributor Grant.\nConditioned upon Your compliance with Section 3.1 below and subject to third party\nintellectual property claims, each Contributor hereby grants You a world-wide,\nroyalty-free, non-exclusive license:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Contributor\nto use, reproduce, modify, display, perform, sublicense and distribute the Modifications\ncreated by such Contributor (or portions thereof), either on an unmodified basis, with\nother Modifications, as Covered Software and/or as part of a Larger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by that\nContributor either alone and/or in combination with its Contributor Version (or portions\nof such combination), to make, use, sell, offer for sale, have made, and/or otherwise\ndispose of: (1) Modifications made by that Contributor (or portions thereof); and (2) the\ncombination of Modifications made by that Contributor with its Contributor Version (or\nportions of such combination).\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe licenses granted in Sections 2.2(a) and 2.2(b) are effective on the date Contributor\nfirst distributes or otherwise makes the Modifications available to a third party.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotwithstanding Section 2.2(b) above, no patent license is granted: (1) for any code that\nContributor has deleted from the Contributor Version; (2) for infringements caused by: (i)\nthird party modifications of Contributor Version, or (ii) the combination of Modifications\nmade by that Contributor with other software (except as part of the Contributor Version)\nor other devices; or (3) under Patent Claims infringed by Covered Software in the absence\nof Modifications made by that Contributor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution Obligations.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAvailability of Source Code.\nAny Covered Software that You distribute or otherwise make available in Executable form\nmust also be made available in Source Code form and that Source Code form must be\ndistributed only under the terms of this License. You must include a copy of this\nLicense with every copy of the Source Code form of the Covered Software You distribute\nor otherwise make available. You must inform recipients of any such Covered Software\nin Executable form as to how they can obtain such Covered Software in Source Code form\nin a reasonable manner on or through a medium customarily used for software exchange.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nModifications.\nThe Modifications that You create or to which You contribute are governed by the terms of\nthis License. You represent that You believe Your Modifications are Your original\ncreation(s) and/or You have sufficient rights to grant the rights conveyed by this\nLicense.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequired Notices.\nYou must include a notice in each of Your Modifications that identifies You as the\nContributor of the Modification. You may not remove or alter any copyright, patent or\ntrademark notices contained within the Covered Software, or any notices of licensing\nor any descriptive text giving attribution to any Contributor or the Initial\nDeveloper.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nApplication of Additional Terms.\nYou may not offer or impose any terms on any Covered Software in Source Code form that\nalters or restricts the applicable version of this License or the recipients'\nrights hereunder. You may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered Software.\nHowever, you may do so only on Your own behalf, and not on behalf of the Initial\nDeveloper or any Contributor. You must make it absolutely clear that any such\nwarranty, support, indemnity or liability obligation is offered by You alone, and You\nhereby agree to indemnify the Initial Developer and every Contributor for any\nliability incurred by the Initial Developer or such Contributor as a result of\nwarranty, support, indemnity or liability terms You offer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution of Executable Versions.\nYou may distribute the Executable form of the Covered Software under the terms of this\nLicense or under the terms of a license of Your choice, which may contain terms\ndifferent from this License, provided that You are in compliance with the terms of\nthis License and that the license for the Executable form does not attempt to limit or\nalter the recipient's rights in the Source Code form from the rights set forth in\nthis License. If You distribute the Covered Software in Executable form under a\ndifferent license, You must make it absolutely clear that any terms which differ from\nthis License are offered by You alone, not by the Initial Developer or Contributor.\nYou hereby agree to indemnify the Initial Developer and every Contributor for any\nliability incurred by the Initial Developer or such Contributor as a result of any\nsuch terms You offer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLarger Works.\nYou may create a Larger Work by combining Covered Software with other code not governed by\nthe terms of this License and distribute the Larger Work as a single product. In such\na case, You must make sure the requirements of this License are fulfilled for the\nCovered Software.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVersions of the License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNew Versions.\nOracle is the initial license steward and may publish revised and/or new versions of this\nLicense from time to time. Each version will be given a distinguishing version number.\nExcept as provided in Section 4.3, no one other than the license steward has the right\nto modify this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEffect of New Versions.\nYou may always continue to use, distribute or otherwise make the Covered Software available\nunder the terms of the version of the License under which You originally received the\nCovered Software. If the Initial Developer includes a notice in the Original Software\nprohibiting it from being distributed or otherwise made available under any subsequent\nversion of the License, You must distribute and make the Covered Software available\nunder the terms of the version of the License under which You originally received the\nCovered Software. Otherwise, You may also choose to use, distribute or otherwise make\nthe Covered Software available under the terms of any subsequent version of the\nLicense published by the license steward.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nModified Versions.\nWhen You are an Initial Developer and You want to create a new license for Your Original\nSoftware, You may create and use a modified version of this License if You: (a) rename\nthe license and remove any references to the name of the license steward (except to\nnote that the license differs from this License); and (b) otherwise make it clear that\nthe license contains terms which differ from this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDISCLAIMER OF WARRANTY.\nCOVERED SOFTWARE IS PROVIDED UNDER THIS LICENSE ON AN “AS IS” BASIS, WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\nWARRANTIES THAT THE COVERED SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A\nPARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE COVERED SOFTWARE IS WITH YOU. SHOULD ANY COVERED SOFTWARE PROVE\nDEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR)\nASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF\nWARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED SOFTWARE\nIS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTERMINATION.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to comply\nwith terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\nProvisions which, by their nature, must remain in effect beyond the termination of this\nLicense shall survive.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You assert a patent infringement claim (excluding declaratory judgment actions) against\nInitial Developer or a Contributor (the Initial Developer or Contributor against whom You\nassert such claim is referred to as “Participant”) alleging that the Participant\nSoftware (meaning the Contributor Version where the Participant is a Contributor or the\nOriginal Software where the Participant is the Initial Developer) directly or indirectly\ninfringes any patent, then any and all rights granted directly or indirectly to You by such\nParticipant, the Initial Developer (if the Initial Developer is not the Participant) and all\nContributors under Sections 2.1 and/or 2.2 of this License shall, upon 60 days notice from\nParticipant terminate prospectively and automatically at the expiration of such 60 day notice\nperiod, unless if within such 60 day period You withdraw Your claim with respect to the\nParticipant Software against such Participant either unilaterally or pursuant to a written\nagreement with Participant.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that the Participant\nSoftware directly or indirectly infringes any patent where such claim is resolved (such as by\nlicense or settlement) prior to the initiation of patent infringement litigation, then the\nreasonable value of the licenses granted by such Participant under Sections 2.1 or 2.2 shall\nbe taken into account in determining the amount or value of any payment or license.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIn the event of termination under Sections 6.1 or 6.2 above, all end user licenses that have been\nvalidly granted by You or any distributor hereunder prior to termination (excluding licenses\ngranted to You by any distributor) shall survive termination.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT,\nOR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\nCOVERED SOFTWARE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY\nINDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT\nLIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR\nANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF\nTHE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR\nDEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE\nLAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT APPLY TO\nYOU.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nU.S. GOVERNMENT END USERS.\nThe Covered Software is a “commercial item,” as that term is defined in 48 C.F.R.\n2.101 (Oct. 1995), consisting of “commercial computer software” (as that term is\ndefined at 48 C.F.R. § 252.227-7014(a)(1)) and “commercial computer software\ndocumentation” as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent with\n48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all U.S. Government\nEnd Users acquire Covered Software with only those rights set forth herein. This U.S.\nGovernment Rights clause is in lieu of, and supersedes, any other FAR, DFAR, or other clause\nor provision that addresses Government rights in computer software under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMISCELLANEOUS.\nThis License represents the complete agreement concerning subject matter hereof. If any provision\nof this License is held to be unenforceable, such provision shall be reformed only to the\nextent necessary to make it enforceable. This License shall be governed by the law of the\njurisdiction specified in a notice contained within the Original Software (except to the\nextent applicable law, if any, provides otherwise), excluding such jurisdiction's\nconflict-of-law provisions. Any litigation relating to this License shall be subject to the\njurisdiction of the courts located in the jurisdiction and venue specified in a notice\ncontained within the Original Software, with the losing party responsible for costs,\nincluding, without limitation, court costs and reasonable attorneys' fees and expenses.\nThe application of the United Nations Convention on Contracts for the International Sale of\nGoods is expressly excluded. Any law or regulation which provides that the language of a\ncontract shall be construed against the drafter shall not apply to this License. You agree\nthat You alone are responsible for compliance with the United States export administration\nregulations (and the export control laws and regulation of any other countries) when You use,\ndistribute or otherwise make available any Covered Software.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRESPONSIBILITY FOR CLAIMS.\nAs between Initial Developer and the Contributors, each party is responsible for claims and damages\narising, directly or indirectly, out of its utilization of rights under this License and You agree to\nwork with Initial Developer and Contributors to distribute such responsibility on an equitable basis.\nNothing herein is intended or shall be deemed to constitute any admission of liability.\nNOTICE PURSUANT TO SECTION 9 OF THE COMMON DEVELOPMENT AND DISTRIBUTION LICENSE (CDDL)\nThe code released under the CDDL shall be governed by the laws of the State of California\n(excluding conflict-of-law provisions). Any litigation relating to this License shall be\nsubject to the jurisdiction of the Federal Courts of the Northern District of California and\nthe state courts of the State of California, with venue lying in Santa Clara County,\nCalifornia.\n"}]