[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nCommunity Data License Agreement - Permissive - Version 1.0\n"}]}, {"tag": "text", "content": "\nThis is the Community Data License Agreement - Permissive, Version\n1.0 (\"Agreement\"). Data is provided to You under this Agreement\nby each of the Data Providers. Your exercise of any of the rights\nand permissions granted below constitutes Your acceptance and\nagreement to be bound by the terms and conditions of this Agreement.\nThe benefits that each Data Provider receives from making\nData available and that You receive from Data or otherwise\nunder these terms and conditions shall be deemed sufficient\nconsideration for the formation of this Agreement. Accordingly,\nData Provider(s) and You (the \"Parties\") agree as follows:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Add\" means to supplement Data with Your own or someone else's Data,\nresulting in Your \"Additions.\" Additions do not include Results.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Computational Use\" means Your analysis (through the use of\ncomputational devices or otherwise) or other interpretation\nof Data. By way of example and not limitation, \"Computational\nUse\" includes the application of any computational analytical\ntechnique, the purpose of which is the analysis of any Data in\ndigital form to generate information about Data such as patterns,\ntrends, correlations, inferences, insights and attributes.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Data\" means the information (including copyrightable information,\nsuch as images or text), collectively or individually, whether\ncreated or gathered by a Data Provider or an Entity acting on\nits behalf, to which rights are granted under this Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Data Provider\" means any Entity (including any\nemployee or contractor of such Entity authorized to\nPublish Data on behalf of such Entity) that Publishes\nData under this Agreement prior to Your Receiving it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Enhanced Data\" means the subset of Data that You Publish\nand that is composed of (a) Your Additions and/or (b)\nModifications to Data You have received under this Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Entity\" means any natural person or organization that exists under\nthe laws of the jurisdiction in which it is organized, together\nwith all other entities that control, are controlled by, or are\nunder common control with that entity. For the purposes of this\ndefinition, \"control\" means (a) the power, directly or indirectly,\nto cause the direction or management of such entity, whether by\ncontract or otherwise, (b) the ownership of more than fifty percent\n(50%) of the outstanding shares or securities, (c) the beneficial\nownership of such entity or, (d) the ability to appoint, whether\nby agreement or right, the majority of directors of an Entity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modify\" means to delete, erase, correct or re-arrange Data,\nresulting in \"Modifications.\" Modifications do not include Results.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Publish\" means to make all or a subset of Data (including Your\nEnhanced Data) available in any manner which enables its Use,\nincluding by providing a copy on physical media or remote access.\nFor any form of Entity, that is to make the Data available to\nany individual who is not employed by that Entity or engaged\nas a contractor or agent to perform work on that Entity's\nbehalf. A \"Publication\" occurs each time You Publish Data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Receive\" or \"Receives\" means to have been\ngiven access to Data, locally or remotely.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Results\" means the outcomes or outputs that You obtain from Your\nComputational Use of Data. Results shall not include more than a de\nminimis portion of the Data on which the Computational Use is based.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Sui Generis Database Rights\" means rights, other than\ncopyright, resulting from Directive 96/9/EC of the European\nParliament and of the Council of 11 March 1996 on the legal\nprotection of databases, as amended and/or succeeded, as\nwell as other equivalent rights anywhere in the world.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Use\" means using Data (including accessing, copying, studying,\nreviewing, adapting, analyzing, evaluating, or making Computational\nUse of it), either by machines or humans, or a combination of both.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.13"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" or \"Your\" means any Entity that\nReceives Data under this Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRight and License to Use and to Publish\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the conditions set forth in Section 3 of this\nAgreement, Data Provider(s) hereby grant(s) to You a\nworldwide, non-exclusive, irrevocable (except as provided\nin Section 5) right to: (a) Use Data; and (b) Publish Data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTo the extent that the Data or the coordination, selection or\narrangement of Data is protected or protectable under copyright,\nSui Generis Database Rights, or other law, Data Provider(s)\nfurther agree(s) that such Data or coordination, selection or\narrangement is hereby licensed to You and to anyone else who\nReceives Data under this Agreement for Use and Publication,\nsubject to the conditions set forth in Section 3 of this Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nExcept for these rights and licenses expressly granted, no other\nintellectual property rights are granted or should be implied.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nConditions on Rights Granted\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You Publish Data You Receive or Enhanced Data:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may do so under a license of Your choice provided\nthat You give anyone who Receives the Data from You\nthe text of this Agreement, the name of this Agreement\nand/or a hyperlink or other method reasonably likely\nto provide a copy of the text of this Agreement; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must cause any Data files containing Enhanced Data to\ncarry prominent notices that You have changed those files; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You Publish Data You Receive, You must preserve all credit\nor attribution to the Data Provider(s). Such retained credit\nor attribution includes any of the following to the extent\nthey exist in Data as You have Received it: legal notices\nor metadata; identification of the Data Provider(s); or\nhyperlinks to Data to the extent it is practical to do so.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may provide additional or different license terms and conditions\nfor use, reproduction, or distribution of that Enhanced Data,\nor for any combination of Data and Enhanced Data as a whole,\nprovided that Your Use and Publication of that combined Data\notherwise complies with the conditions stated in this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou and each Data Provider agree that Enhanced Data shall not be\nconsidered a work of joint authorship by virtue of its relationship\nto Data licensed under this Agreement and shall not require either\nany obligation of accounting to or the consent of any Data Provider.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Agreement imposes no obligations or\nrestrictions on Your Use or Publication of Results.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nData Provider(s)' Representations\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach Data Provider represents that the Data Provider has\nexercised reasonable care, to assure that: (a) the Data it\nPublishes was created or generated by it or was obtained from\nothers with the right to Publish the Data under this Agreement;\nand (b) Publication of such Data does not violate any privacy\nor confidentiality obligation undertaken by the Data Provider.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAll of Your rights under this Agreement will terminate, and\nYour right to Receive, Use or Publish the Data will be revoked\nor modified if You materially fail to comply with the terms\nand conditions of this Agreement and You do not cure such\nfailure in a reasonable period of time after becoming aware\nof such noncompliance. If Your rights under this Agreement\nterminate, You agree to cease Receipt, Use and Publication of\nData. However, Your obligations and any rights and permissions\ngranted by You under this Agreement relating to Data that You\nPublished prior to such termination will continue and survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You institute litigation against a Data Provider or anyone\nelse who Receives the Data (including a cross-claim in a\nlawsuit) based on the Data, other than a claim asserting\nbreach of this Agreement, then any rights previously granted\nto You to Receive, Use and Publish Data under this Agreement\nwill terminate as of the date such litigation is filed.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranties and Limitation of Liability\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE\nDATA (INCLUDING ENHANCED DATA) IS PROVIDED ON AN \"AS\nIS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,\nEITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION,\nANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT,\nMERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNEITHER YOU NOR ANY DATA PROVIDERS SHALL HAVE ANY LIABILITY\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,\nOR CONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST\nPROFITS), HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR\nDISTRIBUTION OF THE DATA OR THE EXERCISE OF ANY RIGHTS GRANTED\nHEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "Section 7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou agree that it is solely Your responsibility to comply with all\napplicable laws with regard to Your Use or Publication of Data,\nincluding any applicable privacy, data protection, security and\nexport laws. You agree to take reasonable steps to assist a Data\nProvider fulfilling responsibilities to comply with applicable\nlaws with regard to Use or Publication of Data Received hereunder.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou and Data Provider(s), collectively and individually,\nwaive and/or agree not to assert, to the extent permitted\nby law, any moral rights You or they hold in Data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Agreement confers no rights or remedies upon\nany person or entity other than the Parties and their\nrespective heirs, executors, successors and assigns.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Data Provider(s) reserve no right or expectation of privacy,\ndata protection or confidentiality in any Data that they Publish\nunder this Agreement. If You choose to Publish Data under this\nAgreement, You similarly do so with no reservation or expectation\nof any rights of privacy or confidentiality in that Data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Community Data License Agreement workgroup under The Linux\nFoundation is the steward of this Agreement (\"Steward\"). No\none other than the Steward has the right to modify or publish\nnew versions of this Agreement. Each version will be given a\ndistinguishing version number. You may Use and Publish Data\nReceived hereunder under the terms of the version of the\nAgreement under which You originally Received the Data, or under\nthe terms of any subsequent version published by the Steward.\n"}]