[{"type": "optional", "content": {"type": "text", "content": "CONTRAT DE LICENCE DE LOGICIEL LIBRE CeCILL"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": [{"type": "text", "content": "Avertissement\n        Ce contrat est une licence de logiciel libre issue d’une concertation entre ses auteurs afin que le\n             respect de deux grands principes préside à sa rédaction:\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          d’une part, sa conformité au droit français, tant au regard du droit de la responsabilité civile\n             que du droit de la propriété intellectuelle et de la protection qu’il offre aux auteurs et\n             titulaires des droits patrimoniaux sur un logiciel.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          d’autre part, le respect des principes de diffusion des logiciels libres: accès au code source,\n             droits étendus conférés aux utilisateurs.\n         Les auteurs de la licence CeCILL1 sont:\n         Commissariat à l’Energie Atomique – CEA, établissement public de caractère scientifique technique et\n         industriel, dont le siège est situé 31-33 rue de la Fédération, 75752 PARIS cedex 15.\n         Centre National de la Recherche Scientifique – CNRS, établissement public à caractère scientifique et\n         technologique, dont le siège est situé 3 rue Michel-Ange 75794 Paris cedex 16.\n         Institut National de Recherche en Informatique et en Automatique – INRIA, établissement public à\n         caractère scientifique et technologique, dont le siège est situé Domaine de Voluceau, Rocquencourt, BP\n         105, 78153 Le Chesnay cedex."}]}, {"type": "text", "content": "\n      PREAMBULE\n      Ce contrat est une licence de logiciel libre dont l'objectif est de conférer aux utilisateurs la liberté\n         de modification et de redistribution du logiciel régi par cette licence dans le cadre d'un modèle de\n         diffusion «open source».\n      L'exercice de ces libertés est assorti de certains devoirs à la charge des utilisateurs afin de préserver\n         ce statut au cours des redistributions ultérieures.\n      L’accessibilité au code source et les droits de copie, de modification et de redistribution qui en\n         découlent ont pour contrepartie de n’offrir aux utilisateurs qu’une garantie limitée et de ne faire\n         peser sur l’auteur du logiciel, le titulaire des droits patrimoniaux et les concédants successifs\n         qu’une responsabilité restreinte.\n      A cet égard l’attention de l’utilisateur est attirée sur les risques associés au chargement, à\n         l’utilisation, à la modification et/ou au développement et à la reproduction du logiciel par\n         l’utilisateur étant donné sa spécificité de logiciel libre, qui peut le rendre complexe à manipuler et\n         qui le réserve donc à des développeurs et des professionnels avertis possédant des connaissances\n         informatiques approfondies. Les utilisateurs sont donc invités à charger et tester l’adéquation du\n         Logiciel à leurs besoins dans des conditions permettant d'assurer la sécurité de leurs systèmes et ou\n         de leurs données et, plus généralement, à l'utiliser et l'exploiter dans les même conditions de\n         sécurité. Ce contrat peut être reproduit et diffusé librement, sous réserve de le conserver en l’état,\n         sans ajout ni suppression de clauses.\n      Ce contrat est susceptible de s’appliquer à tout logiciel dont le titulaire des droits patrimoniaux\n         décide de soumettre l’exploitation aux dispositions qu’il contient.\n\n      Article 1er - DEFINITIONS\n      Dans ce contrat, les termes suivants, lorsqu’ils seront écrits avec une lettre capitale, auront la\n         signification suivante:\n      Contrat: désigne le présent contrat de licence, ses éventuelles versions postérieures et annexes.\n      Logiciel: désigne le logiciel sous sa forme de Code Objet et/ou de Code Source et le cas échéant sa\n         documentation, dans leur état au moment de l’acceptation du\n        Contrat par le Licencié.\n      Logiciel Initial: désigne le Logiciel sous sa forme de Code Source et de Code Objet et le cas échéant sa\n         documentation, dans leur état au moment de leur première diffusion sous les termes du Contrat.\n      Logiciel Modifié: désigne le Logiciel modifié par au moins une Contribution.\n      Code Source: désigne l’ensemble des instructions et des lignes de programme du Logiciel et auquel l’accès\n         est nécessaire en vue de modifier le Logiciel.\n      Code Objet: désigne les fichiers binaires issus de la compilation du Code Source.\n      Titulaire : désigne le détenteur des droits patrimoniaux d’auteur sur le Logiciel Initial.\n      Licencié(s): désigne le ou les utilisateur(s) du Logiciel ayant accepté le Contrat.\n      Contributeur: désigne le Licencié auteur d’au moins une Contribution.\n      Concédant: désigne le Titulaire ou toute personne physique ou morale distribuant le Logiciel sous le\n         Contrat.\n      Contributions: désigne l’ensemble des modifications, corrections, traductions, adaptations et/ou\n         nouvelles fonctionnalités intégrées dans le Logiciel par tout\n      Contributeur, ainsi que les Modules Statiques.\n      Module: désigne un ensemble de fichiers sources y compris leur documentation qui, une fois compilé sous\n         forme exécutable, permet de réaliser des fonctionnalités ou\n        services supplémentaires à ceux fournis par le Logiciel.\n      Module Dynamique: désigne tout Module, créé par le Contributeur, indépendant du Logiciel, tel que ce\n         Module et le Logiciel sont sous forme de deux exécutables indépendants qui s’exécutent dans un espace\n         d’adressage indépendant, l’un appelant l’autre au moment de leur exécution.\n      Module Statique: désigne tout Module créé par le Contributeur et lié au Logiciel par un lien statique\n         rendant leur code objet dépendant l'un de l'autre. Ce Module et le Logiciel auquel il est lié, sont\n         regroupés en un seul exécutable.\n      Parties: désigne collectivement le Licencié et le Concédant.\n      Ces termes s’entendent au singulier comme au pluriel.\n      Article 2 - OBJET\n      Le Contrat a pour objet la concession par le Concédant au Licencié d’une Licence non exclusive,\n         transférable et mondiale du Logiciel telle que définie ci-après à l'article 5 pour toute la durée de\n         protection des droits portant sur ce Logiciel.\n      Article 3 - ACCEPTATION\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          L’acceptation par le Licencié des termes du Contrat est réputée acquise du fait du premier des\n             faits suivants:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              (i) le chargement du Logiciel par tout moyen notamment par téléchargement à partir d’un\n                 serveur distant ou par chargement à partir d’un support physique;\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              (ii) le premier exercice par le Licencié de l’un quelconque des droits concédés par le Contrat.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Un exemplaire du Contrat, contenant notamment un avertissement relatif aux spécificités du\n             Logiciel, à la restriction de garantie et à la limitation à un usage par des utilisateurs\n             expérimentés a été mis à disposition du Licencié préalablement à son acceptation telle que\n             définie à l'article 3.1 ci dessus et le Licencié reconnaît en avoir pris connaissances.\n      Article 4 - ENTREE EN VIGUEUR ET DUREE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          ENTREE EN VIGUEUR\n          Le Contrat entre en vigueur à la date de son acceptation par le Licencié telle que définie en 3.1.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DUREE\n          Le Contrat produira ses effets pendant toute la durée légale de protection des droits\n             patrimoniaux portant sur le Logiciel.\n      Article 5 - ETENDUE DES DROITS CONCEDES\n      Le Concédant concède au Licencié, qui accepte, les droits suivants sur le Logiciel pour toutes\n         destinations et pour la durée du Contrat dans les conditions ci-après détaillées.\n      Par ailleurs, le Concédant concède au Licencié à titre gracieux les droits d’exploitation du ou\n         des brevets qu’il détient sur tout ou partie des inventions\n         implémentées dans le Logiciel.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DROITS D’UTILISATION\n          Le Licencié est autorisé à utiliser le Logiciel, sans restriction quant aux domaines\n             d’application, étant ci-après précisé que cela comporte:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              la reproduction permanente ou provisoire du Logiciel en tout ou partie par tout moyen et sous\n                 toute forme.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              le chargement, l’affichage, l’exécution, ou le stockage du Logiciel sur tout support.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              la possibilité d’en observer, d’en étudier, ou d’en tester le fonctionnement afin de\n                 déterminer les idées et principes qui sont à la base de n’importe quel élément de ce\n                 Logiciel; et ceci, lorsque le Licencié effectue toute opération de chargement,\n                 d’affichage, d’exécution, de transmission ou de stockage du Logiciel qu’il est en droit\n                 d’effectuer en vertu du Contrat.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DROIT D’APPORTER DES CONTRIBUTIONS\n          Le droit d’apporter des Contributions comporte le droit de traduire, d’adapter, d’arranger ou\n             d’apporter toute autre modification du Logiciel et le droit de reproduire le Logiciel en\n             résultant.\n            Le Licencié est autorisé à apporter toute Contribution au Logiciel sous réserve de mentionner, de\n             façon explicite, son nom en tant qu’auteur de cette Contribution et la date de création de\n             celle-ci.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DROITS DE DISTRIBUTION ET DE DIFFUSION\n          Le droit de distribution et de diffusion comporte notamment le droit de transmettre et de\n             communiquer le Logiciel au public sur tout support et par tout moyen ainsi que le droit de\n             mettre sur le marché à titre onéreux ou gratuit, un ou des exemplaires du Logiciel par tout\n             procédé.\n            Le Licencié est autorisé à redistribuer des copies du Logiciel, modifié ou non, à des tiers dans\n             les conditions ci-après détaillées.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              REDISTRIBUTION DU LOGICIEL SANS MODIFICATION\n              Le Licencié est autorisé à redistribuer des copies conformes du Logiciel, sous forme de\n                 Code Source ou de Code Objet, à condition que cette redistribution respecte les\n                 dispositions du Contrat dans leur totalité et soit accompagnée:\n                  "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  d’un exemplaire du Contrat,\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  d’un avertissement relatif à la restriction de garantie et de responsabilité du Concédant\n                     telle que prévue aux articles 8 et 9,\n                     et que, dans le cas où seul le Code Objet du Logiciel est redistribué, le Licencié\n                     permette aux futurs Licenciés d’accéder facilement au Code Source complet du\n                     Logiciel en indiquant les modalités d’accès, étant entendu que le coût additionnel\n                     d’acquisition du Code Source ne devra pas excéder le simple coût de transfert des\n                     données.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              REDISTRIBUTION DU LOGICIEL MODIFIE\n              Lorsque le Licencié apporte une Contribution au Logiciel, les conditions de\n                redistribution du Logiciel Modifié sont alors soumises à l’intégralité des\n                dispositions du Contrat.\n                Le Licencié est autorisé à redistribuer le Logiciel Modifié, sous forme de Code Source\n                ou de Code Objet, à condition que cette redistribution respecte les dispositions\n                du Contrat dans leur totalité et soit accompagnée:\n                  "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  d’un exemplaire du Contrat,\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  d’un avertissement relatif à la restriction de garantie et de responsabilité du concédant\n                     telle que prévue aux articles 8 et 9,\n                     et que, dans le cas où seul le Code Objet du Logiciel Modifié est redistribué, le\n                     Licencié permette aux futurs Licenciés d’accéder facilement au Code Source complet\n                     du Logiciel Modifié en indiquant les modalités d’accès, étant entendu que le coût\n                     additionnel d’acquisition du Code Source ne devra pas excéder le simple coût de\n                     transfert des données.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              REDISTRIBUTION DES MODULES DYNAMIQUES\n              Lorsque le Licencié a développé un Module Dynamique les conditions du Contrat ne\n                  s’appliquent pas à ce Module Dynamique, qui peut être distribué sous un contrat de\n                 licence différent.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.3.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              COMPATIBILITE AVEC LA LICENCE GPL\n              Dans le cas où le Logiciel, Modifié ou non, est intégré à un code soumis aux\n                 dispositions de la licence GPL, le Licencié est autorisé à redistribuer l’ensemble\n                 sous la licence GPL.\n                  Dans le cas où le Logiciel Modifié intègre un code soumis aux dispositions de la\n                 licence GPL, le Licencié est autorisé à redistribuer le Logiciel Modifié sous la\n                 licence GPL.\n      Article 6 - PROPRIETE INTELLECTUELLE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          SUR LE LOGICIEL INITIAL\n          Le Titulaire est détenteur des droits patrimoniaux sur le Logiciel Initial. Toute\n             utilisation du Logiciel Initial est soumise au respect des conditions dans lesquelles\n             le Titulaire a choisi de diffuser son œuvre et nul autre n’a la faculté de modifier\n             les conditions de diffusion de ce Logiciel Initial.\n             Le Titulaire s'engage à maintenir la diffusion du Logiciel initial sous les conditions du\n             Contrat et ce, pour la durée visée à l'article 4.2.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          SUR LES CONTRIBUTIONS\n          Les droits de propriété intellectuelle sur les Contributions sont attachés au titulaire de\n             droits patrimoniaux désigné par la législation applicable.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          SUR LES MODULES DYNAMIQUES\n          Le Licencié ayant développé un Module Dynamique est titulaire des droits de propriété\n             intellectuelle sur ce Module Dynamique et reste libre du choix du contrat régissant sa\n             diffusion.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DISPOSITIONS COMMUNES\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.4.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Le Licencié s’engage expressément:\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  à ne pas supprimer ou modifier de quelque manière que ce soit les mentions de propriété\n                     intellectuelle apposées sur le Logiciel;\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  à reproduire à l’identique lesdites mentions de propriété intellectuelle sur les copies du Logiciel.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.4.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Le Licencié s’engage à ne pas porter atteinte, directement ou indirectement, aux\n                 droits de propriété intellectuelle du Titulaire et/ou des Contributeurs et à\n                 prendre, le cas échéant, à l’égard de son personnel toutes les mesures nécessaires\n                 pour assurer le respect des dits droits de propriété intellectuelle du Titulaire\n                 et/ou des Contributeurs.\n      Article 7 - SERVICES ASSOCIES\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Contrat n’oblige en aucun cas le Concédant à la réalisation de prestations d’assistance\n             technique ou de maintenance du Logiciel.\n             Cependant le Concédant reste libre de proposer ce type de services. Les termes et\n             conditions d’une telle assistance technique et/ou d’une telle maintenance seront alors\n             déterminés dans un acte séparé. Ces actes de maintenance et/ou assistance technique\n             n’engageront que la seule responsabilité du Concédant qui les propose.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          De même, tout Concédant est libre de proposer, sous sa seule responsabilité, à ses licenciés une\n             garantie, qui n’engagera que lui, lors de la redistribution du Logiciel et/ou du Logiciel\n             Modifié et ce, dans les conditions qu’il souhaite. Cette garantie et les modalités financières\n             de son application feront l’objet d’un acte séparé entre le Concédant et le Licencié.\n      Article 8 - RESPONSABILITE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Sous réserve des dispositions de l’article 8.2, si le Concédant n’exécute pas tout ou partie des\n             obligations mises à sa charge par le Contrat, le Licencié a la faculté, sous réserve de\n             prouver la faute du Concédant concerné, de solliciter la réparation du préjudice direct qu’il\n             subit et dont il apportera la preuve.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          La responsabilité du Concédant est limitée aux engagements pris en application du Contrat et ne\n             saurait être engagée en raison notamment:(i) des dommages dus à l’inexécution, totale ou\n             partielle, de ses obligations par le Licencié, (ii) des dommages directs ou indirects\n             découlant de l’utilisation ou des performances du Logiciel subis par le Licencié lorsqu’il\n             s’agit d’un professionnel utilisant le Logiciel à des fins professionnelles et (iii) des\n             dommages indirects découlant de l’utilisation ou des performances du Logiciel. Les Parties\n             conviennent expressément que tout préjudice financier ou commercial (par exemple perte de\n             données, perte de bénéfices, perte d’exploitation, perte de clientèle ou de commandes, manque\n             à gagner, trouble commercial quelconque) ou toute action dirigée contre le Licencié par un\n             tiers, constitue un dommage indirect et n’ouvre pas droit à réparation par le Concédant.\n      Article 9 - GARANTIE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Licencié reconnaît que l’état actuel des connaissances scientifiques et techniques au moment\n             de la mise en circulation du Logiciel ne permet pas d’en tester et d’en vérifier toutes les\n             utilisations ni de détecter l’existence d’éventuels défauts. L’attention du Licencié a été\n             attirée sur ce point sur les risques associés au chargement, à l’utilisation, la modification\n             et/ou au développement et à la reproduction du Logiciel qui sont réservés à des utilisateurs\n             avertis.\n             Il relève de la responsabilité du Licencié de contrôler, par tous moyens, l’adéquation du\n             produit à ses besoins, son bon fonctionnement et de s'assurer qu’il ne causera pas de\n             dommages aux personnes et aux biens.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Concédant déclare de bonne foi être en droit de concéder l'ensemble des droits attachés au\n             Logiciel (comprenant notamment les droits visés à l'article 5).\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Licencié reconnaît que le Logiciel est fourni «en l'état» par le Concédant sans autre\n             garantie, expresse ou tacite, que celle prévue à l’article 9.2 et notamment sans aucune\n             garantie sur sa valeur commerciale, son caractère sécurisé, innovant ou pertinent.\n             En particulier, le Concédant ne garantit pas que le Logiciel est exempt d'erreur, qu’il\n             fonctionnera sans interruption, qu’il sera compatible avec l’équipement du Licencié et\n             sa configuration logicielle ni qu’il remplira les besoins du Licencié.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Concédant ne garantit pas, de manière expresse ou tacite, que le Logiciel ne porte pas\n             atteinte à un quelconque droit de propriété intellectuelle d’un tiers portant sur un brevet,\n             un logiciel ou sur tout autre droit de propriété. Ainsi, le Concédant exclut toute garantie au\n             profit du Licencié contre les actions en contrefaçon qui pourraient être diligentées au titre\n             de l’utilisation, de la modification, et de la redistribution du Logiciel. Néanmoins, si de\n             telles actions sont exercées contre le Licencié, le Concédant lui apportera son aide technique\n             et juridique pour sa défense. Cette aide technique et juridique est déterminée au cas par cas\n             entre le Concédant concerné et le Licencié dans le cadre d’un protocole d’accord. Le Concédant\n             dégage toute responsabilité quant à l’utilisation de la dénomination du Logiciel par le\n             Licencié. Aucune garantie n’est apportée quant à l’existence de droits antérieurs sur le nom\n             du Logiciel et sur l’existence d’une marque.\n      Article 10 - RESILIATION\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          En cas de manquement par le Licencié aux obligations mises à sa charge par le Contrat, le\n             Concédant pourra résilier de plein droit le Contrat trente (30) jours après notification\n             adressée au Licencié et restée sans effet.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Licencié dont le Contrat est résilié n’est plus autorisé à utiliser, modifier ou distribuer le\n             Logiciel. Cependant, toutes les licences qu’il aura concédées antérieurement à la résiliation\n             du Contrat resteront valides sous réserve qu’elles aient été effectuées en conformité avec le\n             Contrat.\n      Article 11 - DISPOSITIONS DIVERSES\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          CAUSE EXTERIEURE\n          Aucune des Parties ne sera responsable d’un retard ou d’une défaillance d’exécution du\n             Contrat qui serait dû à un cas de force majeure, un cas fortuit ou une cause\n             extérieure, telle que, notamment, le mauvais fonctionnement ou les interruptions du\n             réseau électrique ou de télécommunication, la paralysie du réseau liée à une attaque\n             informatique, l’intervention des autorités gouvernementales, les catastrophes\n             naturelles, les dégâts des eaux, les tremblements de terre, le feu, les explosions,\n             les grèves et les conflits sociaux, l’état de guerre…\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le fait, par l’une ou l’autre des Parties, d’omettre en une ou plusieurs occasions de se\n             prévaloir d’une ou plusieurs dispositions du Contrat, ne pourra en aucun cas impliquer\n             renonciation par la Partie intéressée à s’en prévaloir ultérieurement.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Contrat annule et remplace toute convention antérieure, écrite ou orale, entre les Parties sur\n             le même objet et constitue l’accord entier entre les Parties sur cet objet. Aucune addition ou\n             modification aux termes du Contrat n’aura d’effet à l’égard des Parties à moins d’être faite\n             par écrit et signée par leurs représentants dûment habilités.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Dans l’hypothèse où une ou plusieurs des dispositions du Contrat s’avèrerait contraire à une loi\n             ou à un texte applicable, existants ou futurs, cette loi ou ce texte prévaudrait, et les\n             Parties feraient les amendements nécessaires pour se conformer à cette loi ou à ce texte.\n             Toutes les autres dispositions resteront en vigueur. De même, la nullité, pour quelque raison\n             que ce soit, d’une des dispositions du Contrat ne saurait entraîner la nullité de l’ensemble\n             du Contrat.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          LANGUE\n          Le Contrat est rédigé en langue française et en langue anglaise. En cas de divergence\n             d’interprétation, seule la version française fait foi.\n      Article 12 - NOUVELLES VERSIONS DU CONTRAT\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Toute personne est autorisée à copier et distribuer des copies de ce Contrat.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Afin d’en préserver la cohérence, le texte du Contrat est protégé et ne peut être modifié que par\n             les auteurs de la licence, lesquels se réservent le droit de publier périodiquement des mises\n             à jour ou de nouvelles versions du Contrat, qui possèderont chacune un numéro distinct. Ces\n             versions ultérieures seront susceptibles de prendre en compte de nouvelles problématiques\n             rencontrées par les logiciels libres.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Tout Logiciel diffusé sous une version donnée du Contrat ne pourra faire l'objet d'une diffusion\n             ultérieure que sous la même version du Contrat ou une version postérieure, sous réserve des\n             dispositions de l'article 5.3.4.\n      Article 13 - LOI APPLICABLE ET COMPETENCE TERRITORIALE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Le Contrat est régi par la loi française. Les Parties conviennent de tenter de régler à l’amiable\n             les différends ou litiges qui viendraient à se produire par suite ou à l’occasion du\n             Contrat.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          A défaut d’accord amiable dans un délai de deux (2) mois à compter de leur survenance et sauf\n             situation relevant d’une procédure d’urgence, les différends ou litiges seront portés par la\n             Partie la plus diligente devant les Tribunaux compétents de Paris.\n      1 Ce: CEA, C: CNRS, I: INRIA, LL: Logiciel Libre\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "Version 1 du 21/06/2004"}}]