[{"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an\n             office at 1895 Preston White Drive, Reston, VA 20191 (\"CNRI\"), and the Individual or\n             Organization (\"Licensee\") accessing and using JPython version 1.1.x in source or binary form\n             and its associated documentation as provided herein (\"Software\").\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Subject to the terms and conditions of this License Agreement, CNRI hereby grants\n               Licensee a non-exclusive, non-transferable, royalty-free, world-wide license to reproduce,\n               analyze, test, perform and/or display publicly, prepare derivative works, distribute, and\n               otherwise use the Software alone or in any derivative version, provided, however, that\n               CNRI's License Agreement and CNRI's notice of copyright, i.e., “Copyright (c) 1996-1999\n               Corporation for National Research Initiatives; All Rights Reserved” are both retained in\n               the Software, alone or in any derivative version prepared by Licensee.\n            Alternatively, in lieu of CNRI's License Agreement, Licensee may substitute the following\n                 text (omitting the quotes), provided, however, that such text is displayed prominently\n                 in the Software alone or in any derivative version prepared by Licensee: “JPython\n                 (Version 1.1.x) is made available subject to the terms and conditions in CNRI's\n                 License Agreement. This Agreement may be located on the Internet using the following\n                 unique, persistent identifier (known as a handle): 1895.22/1006. The License may also\n                 be obtained from a proxy server on the Web using the following URL:\n                 http://hdl.handle.net/1895.22/1006.”\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          In the event Licensee prepares a derivative work that is based on or incorporates the Software or\n             any part thereof, and wants to make the derivative work available to the public as provided\n             herein, then Licensee hereby agrees to indicate in any such work, in a prominently visible\n             way, the nature of the modifications made to CNRI's Software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Licensee may not use CNRI trademarks or trade name, including JPython or CNRI, in a trademark\n             sense to endorse or promote products or services of Licensee, or any third party. Licensee may\n             use the mark JPython in connection with Licensee's derivative versions that are based on or\n             incorporate the Software, but only in the form “JPython-based ___________________,” or\n             equivalent.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          CNRI is making the Software available to Licensee on an “AS IS” basis. CNRI MAKES NO\n             REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI\n             MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY\n             PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD PARTY\n             RIGHTS.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          CNRI SHALL NOT BE LIABLE TO LICENSEE OR OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL, SPECIAL\n             OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE,\n             OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. SOME STATES DO NOT\n             ALLOW THE LIMITATION OR EXCLUSION OF LIABILITY SO THE ABOVE DISCLAIMER MAY NOT APPLY TO\n             LICENSEE.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This License Agreement may be terminated by CNRI (i) immediately upon written notice from CNRI of\n             any material breach by the Licensee, if the nature of the breach is such that it cannot be\n             promptly remedied; or (ii) sixty (60) days following notice from CNRI to Licensee of a\n             material remediable breach, if Licensee has not remedied such breach within that sixty-day\n             period.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This License Agreement shall be governed by and interpreted in all respects by the law of the\n             State of Virginia, excluding conflict of law provisions. Nothing in this Agreement shall be\n             deemed to create any relationship of agency, partnership, or joint venture between CNRI and\n             Licensee.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          By clicking on the \"ACCEPT\" button where indicated, or by installing, copying or otherwise using\n             the Software, Licensee agrees to be bound by the terms and conditions of this License\n             Agreement."}]