[{"type": "optional", "content": {"type": "text", "content": "CNRI OPEN SOURCE LICENSE AGREEMENT"}}, {"type": "text", "content": "\n      IMPORTANT: PLEASE READ THE FOLLOWING AGREEMENT CAREFULLY.\n      BY CLICKING ON \"ACCEPT\" WHERE INDICATED BELOW, OR BY COPYING, INSTALLING OR OTHERWISE USING PYTHON 1.6,\n         beta 1 SOFTWARE, YOU ARE DEEMED TO HAVE AGREED TO THE TERMS AND CONDITIONS OF THIS LICENSE\n         AGREEMENT.\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an\n             office at 1895 Preston White Drive, Reston, VA 20191 (\"CNRI\"), and the Individual or\n             Organization (\"Licensee\") accessing and otherwise using Python 1.6, beta 1 software in source\n             or binary form and its associated documentation, as released at the www.python.org Internet\n             site on August 4, 2000 (\"Python 1.6b1\").\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Subject to the terms and conditions of this License Agreement, CNRI hereby grants Licensee a\n             non-exclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or\n             display publicly, prepare derivative works, distribute, and otherwise use Python 1.6b1 alone\n             or in any derivative version, provided, however, that CNRIs License Agreement is retained in\n             Python 1.6b1, alone or in any derivative version prepared by Licensee.\n          Alternately, in lieu of CNRIs License Agreement, Licensee may substitute the following text\n             (omitting the quotes): \"Python 1.6, beta 1, is made available subject to the terms and\n             conditions in CNRIs License Agreement. This Agreement may be located on the Internet using the\n             following unique, persistent identifier (known as a handle): 1895.22/1011. This Agreement may\n             also be obtained from a proxy server on the Internet using the\n             URL:http://hdl.handle.net/1895.22/1011\".\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          In the event Licensee prepares a derivative work that is based on or incorporates Python 1.6b1 or\n             any part thereof, and wants to make the derivative work available to the public as provided\n             herein, then Licensee hereby agrees to indicate in any such work the nature of the\n             modifications made to Python 1.6b1.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          CNRI is making Python 1.6b1 available to Licensee on an \"AS IS\" basis. CNRI MAKES NO\n             REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI\n             MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY\n             PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6b1 WILL NOT INFRINGE ANY THIRD PARTY\n             RIGHTS.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL,\n             SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING\n             PYTHON 1.6b1, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This License Agreement will automatically terminate upon a material breach of its terms and conditions.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This License Agreement shall be governed by and interpreted in all respects by the law of the\n             State of Virginia, excluding conflict of law provisions. Nothing in this License Agreement\n             shall be deemed to create any relationship of agency, partnership, or joint venture between\n             CNRI and Licensee. This License Agreement does not grant permission to use CNRI trademarks or\n             trade name in a trademark sense to endorse or promote products or services of Licensee, or any\n             third party.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          By clicking on the \"ACCEPT\" button where indicated, or by copying, installing or otherwise using\n             Python 1.6b1, Licensee agrees to be bound by the terms and conditions of this License\n             Agreement.\n\n      ACCEPT"}]