[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\ncopyleft-next 0.3.1 (\"this License\")\nRelease date: 2016-04-29\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Grants; No Trademark License\nSubject to the terms of this License, I grant You:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nA non-exclusive, worldwide, perpetual, royalty-free, irrevocable\ncopyright license, to reproduce, Distribute, prepare derivative works\nof, publicly perform and publicly display My Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nA non-exclusive, worldwide, perpetual, royalty-free, irrevocable\npatent license under Licensed Patents to make, have made, use, sell,\noffer for sale, and import Covered Works.\nThis License does not grant any rights in My name, trademarks, service\nmarks, or logos.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution: General Conditions\nYou may Distribute Covered Works, provided that You (i) inform\nrecipients how they can obtain a copy of this License; (ii) satisfy the\napplicable conditions of sections 3 through 6; and (iii) preserve all\nLegal Notices contained in My Work (to the extent they remain\npertinent). \"Legal Notices\" means copyright notices, license notices,\nlicense texts, and author attributions, but does not include logos,\nother graphical images, trademarks or trademark legends.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nConditions for Distributing Derived Works; Outbound GPL Compatibility\nIf You Distribute a Derived Work, You must license the entire Derived\nWork as a whole under this License, with prominent notice of such\nlicensing. This condition may not be avoided through such means as\nseparate Distribution of portions of the Derived Work.\nIf the Derived Work includes material licensed under the GPL, You may\ninstead license the Derived Work under the GPL.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCondition Against Further Restrictions; Inbound License Compatibility\nWhen Distributing a Covered Work, You may not impose further\nrestrictions on the exercise of rights in the Covered Work granted under\nthis License. This condition is not excused merely because such\nrestrictions result from Your compliance with conditions or obligations\nextrinsic to this License (such as a court order or an agreement with a\nthird party).\nHowever, You may Distribute a Covered Work incorporating material\ngoverned by a license that is both OSI-Approved and FSF-Free as of the\nrelease date of this License, provided that compliance with such\nother license would not conflict with any conditions stated in other\nsections of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nConditions for Distributing Object Code\nYou may Distribute an Object Code form of a Covered Work, provided that\nyou accompany the Object Code with a URL through which the Corresponding\nSource is made available, at no charge, by some standard or customary\nmeans of providing network access to source code.\nIf you Distribute the Object Code in a physical product or tangible\nstorage medium (\"Product\"), the Corresponding Source must be available\nthrough such URL for two years from the date of Your most recent\nDistribution of the Object Code in the Product. However, if the Product\nitself contains or is accompanied by the Corresponding Source (made\navailable in a customarily accessible manner), You need not also comply\nwith the first paragraph of this section.\nEach direct and indirect recipient of the Covered Work from You is an\nintended third-party beneficiary of this License solely as to this\nsection 5, with the right to enforce its terms.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSymmetrical Licensing Condition for Upstream Contributions\nIf You Distribute a work to Me specifically for inclusion in or\nmodification of a Covered Work (a \"Patch\"), and no explicit licensing\nterms apply to the Patch, You license the Patch under this License, to\nthe extent of Your copyright in the Patch. This condition does not\nnegate the other conditions of this License, if applicable to the Patch.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNullification of Copyleft/Proprietary Dual Licensing\nIf I offer to license, for a fee, a Covered Work under terms other than\na license that is OSI-Approved or FSF-Free as of the release date of this\nLicense or a numbered version of copyleft-next released by the\nCopyleft-Next Project, then the license I grant You under section 1 is no\nlonger subject to the conditions in sections 3 through 5.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopyleft Sunset\nThe conditions in sections 3 through 5 no longer apply once fifteen\nyears have elapsed from the date of My first Distribution of My Work\nunder this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPass-Through\nWhen You Distribute a Covered Work, the recipient automatically receives\na license to My Work from Me, subject to the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\nYour license grants under section 1 are automatically terminated if You\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nfail to comply with the conditions of this License, unless You cure\nsuch noncompliance within thirty days after becoming aware of it, or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninitiate a patent infringement litigation claim (excluding\ndeclaratory judgment actions, counterclaims, and cross-claims)\nalleging that any part of My Work directly or indirectly infringes\nany patent.\nTermination of Your license grants extends to all copies of Covered\nWorks You subsequently obtain. Termination does not terminate the\nrights of those who have received copies or rights from You subject to\nthis License.\nTo the extent permission to make copies of a Covered Work is necessary\nmerely for running it, such permission is not terminable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLater License Versions\nThe Copyleft-Next Project may release new versions of copyleft-next,\ndesignated by a distinguishing version number (\"Later Versions\").\nUnless I explicitly remove the option of Distributing Covered Works\nunder Later Versions, You may Distribute Covered Works under any Later\nVersion.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNo Warranty\nMy Work is provided \"as-is\", without warranty. You bear the risk\nof using it. To the extent permitted by applicable law, each\nDistributor of My Work excludes the implied warranties of title,\nmerchantability, fitness for a particular purpose and\nnon-infringement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability\nTo the extent permitted by applicable law, in no event will any\nDistributor of My Work be liable to You for any damages\nwhatsoever, whether direct, indirect, special, incidental, or\nconsequential damages, whether arising under contract, tort\n(including negligence), or otherwise, even where the Distributor\nknew or should have known about the possibility of such damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSeverability\nThe invalidity or unenforceability of any provision of this License\ndoes not affect the validity or enforceability of the remainder of\nthis License. Such provision is to be reformed to the minimum extent\nnecessary to make it valid and enforceable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "15."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions\n\"Copyleft-Next Project\" means the project that maintains the source\ncode repository at <https://github.com/copyleft-next/copyleft-next.git/>\nas of the release date of this License.\n\"Corresponding Source\" of a Covered Work in Object Code form means (i)\nthe Source Code form of the Covered Work; (ii) all scripts,\ninstructions and similar information that are reasonably necessary for\na skilled developer to generate such Object Code from the Source Code\nprovided under (i); and (iii) a list clearly identifying all Separate\nWorks (other than those provided in compliance with (ii)) that were\nspecifically used in building and (if applicable) installing the\nCovered Work (for example, a specified proprietary compiler including\nits version number). Corresponding Source must be machine-readable.\n\"Covered Work\" means My Work or a Derived Work.\n\"Derived Work\" means a work of authorship that copies from, modifies,\nadapts, is based on, is a derivative work of, transforms, translates or\ncontains all or part of My Work, such that copyright permission is\nrequired. The following are not Derived Works: (i) Mere Aggregation;\n(ii) a mere reproduction of My Work; and (iii) if My Work fails to\nexplicitly state an expectation otherwise, a work that merely makes\nreference to My Work.\n\"Distribute\" means to distribute, transfer or make a copy available to\nsomeone else, such that copyright permission is required.\n\"Distributor\" means Me and anyone else who Distributes a Covered Work.\n\"FSF-Free\" means classified as 'free' by the Free Software Foundation.\n\"GPL\" means a version of the GNU General Public License or the GNU\nAffero General Public License.\n\"I\"/\"Me\"/\"My\" refers to the individual or legal entity that places My\nWork under this License. \"You\"/\"Your\" refers to the individual or legal\nentity exercising rights in My Work under this License. A legal entity\nincludes each entity that controls, is controlled by, or is under\ncommon control with such legal entity. \"Control\" means (a) the power to\ndirect the actions of such legal entity, whether by contract or\notherwise, or (b) ownership of more than fifty percent of the\noutstanding shares or beneficial ownership of such legal entity.\n\"Licensed Patents\" means all patent claims licensable royalty-free by\nMe, now or in the future, that are necessarily infringed by making,\nusing, or selling My Work, and excludes claims that would be infringed\nonly as a consequence of further modification of My Work.\n\"Mere Aggregation\" means an aggregation of a Covered Work with a\nSeparate Work.\n\"My Work\" means the particular work of authorship I license to You\nunder this License.\n\"Object Code\" means any form of a work that is not Source Code.\n\"OSI-Approved\" means approved as 'Open Source' by the Open Source\nInitiative.\n\"Separate Work\" means a work that is separate from and independent of a\nparticular Covered Work and is not by its nature an extension or\nenhancement of the Covered Work, and/or a runtime library, standard\nlibrary or similar component that is used to generate an Object Code\nform of a Covered Work.\n\"Source Code\" means the preferred form of a work for making\nmodifications to it.\n"}]