[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nCommon Public Attribution License Version 1.0 (CPAL)\n"}]}, {"type": "text", "content": "\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Definitions\"\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.0.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Commercial Use\" means distribution or otherwise making the Covered Code\navailable to a third party.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Contributor\" means each entity that creates or contributes to the creation of\nModifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Contributor Version\" means the combination of the Original Code, prior\nModifications used by a Contributor, and the Modifications made by that particular\nContributor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Covered Code\" means the Original Code or Modifications or the combination of the\nOriginal Code and Modifications, in each case including portions thereof.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Electronic Distribution Mechanism\" means a mechanism generally accepted in the\nsoftware development community for the electronic transfer of data.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.5"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Executable\" means Covered Code in any form other than Source Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.6"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Initial Developer\" means the individual or entity identified as the Initial\nDeveloper in the Source Code notice required by Exhibit A.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.7"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Larger Work\" means a work which combines Covered Code or portions thereof with\ncode not governed by the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.8"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"License\" means this document.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.8.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Licensable\" means having the right to grant, to the maximum extent possible,\nwhether at the time of the initial grant or subsequently acquired, any and all of the rights\nconveyed herein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.9"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Modifications\" means any addition to or deletion from the substance or structure\nof either the Original Code or any previous Modifications. When Covered Code is released as a\nseries of files, a Modification is:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "A."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny addition to or deletion from the contents of a file containing Original Code or previous\nModifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "B."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.10"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Original Code\" means Source Code of computer software code which is described in\nthe Source Code notice required by Exhibit A as Original Code, and which, at the time of its\nrelease under this License is not already Covered Code governed by this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.10.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Patent Claims\" means any patent claim(s), now owned or hereafter acquired,\nincluding without limitation, method, process, and apparatus claims, in any patent Licensable\nby grantor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.11"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Source Code\" means the preferred form of the Covered Code for making modifications\nto it, including all modules it contains, plus any associated interface definition files,\nscripts used to control compilation and installation of an Executable, or source code\ndifferential comparisons against either the Original Code or another well known, available\nCovered Code of the Contributor's choice. The Source Code can be in a compressed or\narchival form, provided the appropriate decompression or de-archiving software is widely\navailable for no charge.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.12"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"You\" (or \"Your\") means an individual or a legal entity exercising\nrights under, and complying with all of the terms of, this License or a future version of this\nLicense issued under Section 6.1. For legal entities, \"You\" includes any entity\nwhich controls, is controlled by, or is under common control with You. For purposes of this\ndefinition, \"control\" means (a) the power, direct or indirect, to cause the\ndirection or management of such entity, whether by contract or otherwise, or (b) ownership of\nmore than fifty percent (50%) of the outstanding shares or beneficial ownership of such\nentity.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSource Code License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Initial Developer Grant.\nThe Initial Developer hereby grants You a world-wide, royalty-free, non-exclusive license,\nsubject to third party intellectual property claims:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Initial\nDeveloper to use, reproduce, modify, display, perform, sublicense and distribute the\nOriginal Code (or portions thereof) with or without Modifications, and/or as part of a\nLarger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder Patents Claims infringed by the making, using or selling of Original Code, to make,\nhave made, use, practice, sell, and offer for sale, and/or otherwise dispose of the\nOriginal Code (or portions thereof).\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nthe licenses granted in this Section 2.1(a) and (b) are effective on the date Initial\nDeveloper first distributes Original Code under the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotwithstanding Section 2.1(b) above, no patent license is granted: 1) for code that You\ndelete from the Original Code; 2) separate from the Original Code; or 3) for infringements\ncaused by: i) the modification of the Original Code or ii) the combination of the Original\nCode with other software or devices.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nContributor Grant.\nSubject to third party intellectual property claims, each Contributor hereby grants You a\nworld-wide, royalty-free, non-exclusive license\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by\nContributor, to use, reproduce, modify, display, perform, sublicense and distribute the\nModifications created by such Contributor (or portions thereof) either on an unmodified\nbasis, with other Modifications, as Covered Code and/or as part of a Larger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by that\nContributor either alone and/or in combination with its Contributor Version (or portions\nof such combination), to make, use, sell, offer for sale, have made, and/or otherwise\ndispose of: 1) Modifications made by that Contributor (or portions thereof); and 2) the\ncombination of Modifications made by that Contributor with its Contributor Version (or\nportions of such combination).\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nthe licenses granted in Sections 2.2(a) and 2.2(b) are effective on the date Contributor\nfirst makes Commercial Use of the Covered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotwithstanding Section 2.2(b) above, no patent license is granted: 1) for any code that\nContributor has deleted from the Contributor Version; 2) separate from the Contributor\nVersion; 3) for infringements caused by: i) third party modifications of Contributor\nVersion or ii) the combination of Modifications made by that Contributor with other\nsoftware (except as part of the Contributor Version) or other devices; or 4) under Patent\nClaims infringed by Covered Code in the absence of Modifications made by that\nContributor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution Obligations.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nApplication of License.\nThe Modifications which You create or to which You contribute are governed by the terms of\nthis License, including without limitation Section 2.2. The Source Code version of\nCovered Code may be distributed only under the terms of this License or a future\nversion of this License released under Section 6.1, and You must include a copy of\nthis License with every copy of the Source Code You distribute. You may not offer or\nimpose any terms on any Source Code version that alters or restricts the applicable\nversion of this License or the recipients' rights hereunder. However, You may\ninclude an additional document offering the additional rights described in Section\n3.5.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAvailability of Source Code.\nAny Modification which You create or to which You contribute must be made available in\nSource Code form under the terms of this License either on the same media as an\nExecutable version or via an accepted Electronic Distribution Mechanism to anyone to\nwhom you made an Executable version available; and if made available via Electronic\nDistribution Mechanism, must remain available for at least twelve (12) months after\nthe date it initially became available, or at least six (6) months after a subsequent\nversion of that particular Modification has been made available to such recipients.\nYou are responsible for ensuring that the Source Code version remains available even\nif the Electronic Distribution Mechanism is maintained by a third party.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDescription of Modifications.\nYou must cause all Covered Code to which You contribute to contain a file documenting the\nchanges You made to create that Covered Code and the date of any change. You must\ninclude a prominent statement that the Modification is derived, directly or\nindirectly, from Original Code provided by the Initial Developer and including the\nname of the Initial Developer in (a) the Source Code, and (b) in any notice in an\nExecutable version or related documentation in which You describe the origin or\nownership of the Covered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIntellectual Property Matters\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThird Party Claims. If Contributor has knowledge that a license under a third party's\nintellectual property rights is required to exercise the rights granted by such\nContributor under Sections 2.1 or 2.2, Contributor must include a text file with the\nSource Code distribution titled \"LEGAL\" which describes the claim and the\nparty making the claim in sufficient detail that a recipient will know whom to contact. If\nContributor obtains such knowledge after the Modification is made available as described\nin Section 3.2, Contributor shall promptly modify the LEGAL file in all copies Contributor\nmakes available thereafter and shall take other steps (such as notifying appropriate\nmailing lists or newsgroups) reasonably calculated to inform those who received the\nCovered Code that new knowledge has been obtained.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nContributor APIs. If Contributor's Modifications include an application programming\ninterface and Contributor has knowledge of patent licenses which are reasonably necessary\nto implement that API, Contributor must also include this information in the LEGAL\nfile.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRepresentations. Contributor represents that, except as disclosed pursuant to Section 3.4(a)\nabove, Contributor believes that Contributor's Modifications are\nContributor's original creation(s) and/or Contributor has sufficient rights to\ngrant the rights conveyed by this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.5"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequired Notices.\nYou must duplicate the notice in Exhibit A in each file of the Source Code. If it is not\npossible to put such notice in a particular Source Code file due to its structure,\nthen You must include such notice in a location (such as a relevant directory) where a\nuser would be likely to look for such a notice. If You created one or more\nModification(s) You may add your name as a Contributor to the notice described in\nExhibit A. You must also duplicate this License in any documentation for the Source\nCode where You describe recipients' rights or ownership rights relating to\nCovered Code. You may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Covered Code. However,\nYou may do so only on Your own behalf, and not on behalf of the Initial Developer or\nany Contributor. You must make it absolutely clear than any such warranty, support,\nindemnity or liability obligation is offered by You alone, and You hereby agree to\nindemnify the Initial Developer and every Contributor for any liability incurred by\nthe Initial Developer or such Contributor as a result of warranty, support, indemnity\nor liability terms You offer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.6"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution of Executable Versions.\nYou may distribute Covered Code in Executable form only if the requirements of Section\n3.1-3.5 have been met for that Covered Code, and if You include a notice stating that\nthe Source Code version of the Covered Code is available under the terms of this\nLicense, including a description of how and where You have fulfilled the obligations\nof Section 3.2. The notice must be conspicuously included in any notice in an\nExecutable version, related documentation or collateral in which You describe\nrecipients' rights relating to the Covered Code. You may distribute the\nExecutable version of Covered Code or ownership rights under a license of Your choice,\nwhich may contain terms different from this License, provided that You are in\ncompliance with the terms of this License and that the license for the Executable\nversion does not attempt to limit or alter the recipient's rights in the Source\nCode version from the rights set forth in this License. If You distribute the\nExecutable version under a different license You must make it absolutely clear that\nany terms which differ from this License are offered by You alone, not by the Initial\nDeveloper, Original Developer or any Contributor. You hereby agree to indemnify the\nInitial Developer, Original Developer and every Contributor for any liability incurred\nby the Initial Developer, Original Developer or such Contributor as a result of any\nsuch terms You offer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.7"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLarger Works.\nYou may create a Larger Work by combining Covered Code with other code not governed by the\nterms of this License and distribute the Larger Work as a single product. In such a\ncase, You must make sure the requirements of this License are fulfilled for the\nCovered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect to\nsome or all of the Covered Code due to statute, judicial order, or regulation then You\nmust: (a) comply with the terms of this License to the maximum extent possible; and\n(b) describe the limitations and the code they affect. Such description must be\nincluded in the LEGAL file described in Section 3.4 and must be included with all\ndistributions of the Source Code. Except to the extent prohibited by statute or\nregulation, such description must be sufficiently detailed for a recipient of ordinary\nskill to be able to understand it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nApplication of this License.\nThis License applies to code to which the Initial Developer has attached the notice in\nExhibit A and to related Covered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVersions of the License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNew Versions.\nSocialtext, Inc. (\"Socialtext\") may publish revised and/or new versions of\nthe License from time to time. Each version will be given a distinguishing version\nnumber.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEffect of New Versions.\nOnce Covered Code has been published under a particular version of the License, You may\nalways continue to use it under the terms of that version. You may also choose to use\nsuch Covered Code under the terms of any subsequent version of the License published\nby Socialtext. No one other than Socialtext has the right to modify the terms\napplicable to Covered Code created under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDerivative Works.\nIf You create or use a modified version of this License (which you may only do in order to\napply it to code which is not already Covered Code governed by this License), You must\n(a) rename Your license so that the phrases \"Socialtext\",\n\"CPAL\" or any confusingly similar phrase do not appear in your license\n(except to note that your license differs from this License) and (b) otherwise make it\nclear that Your version of the license contains terms which differ from the CPAL.\n(Filling in the name of the Initial Developer, Original Developer, Original Code or\nContributor in the notice described in Exhibit A shall not of themselves be deemed to\nbe modifications of this License.)\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDISCLAIMER OF WARRANTY.\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\nWARRANTIES THAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A\nPARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE\nIN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER, ORIGINAL DEVELOPER OR ANY OTHER\nCONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS\nDISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY\nCOVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTERMINATION.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to comply\nwith terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\nAll sublicenses to the Covered Code which are properly granted shall survive any termination\nof this License. Provisions which, by their nature, must remain in effect beyond the\ntermination of this License shall survive.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You initiate litigation by asserting a patent infringement claim (excluding declatory judgment\nactions) against Initial Developer, Original Developer or a Contributor (the Initial\nDeveloper, Original Developer or Contributor against whom You file such action is referred to\nas \"Participant\") alleging that:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nsuch Participant's Contributor Version directly or indirectly infringes any patent,\nthen any and all rights granted by such Participant to You under Sections 2.1 and/or 2.2\nof this License shall, upon 60 days notice from Participant terminate prospectively,\nunless if within 60 days after receipt of notice You either: (i) agree in writing to pay\nParticipant a mutually agreeable reasonable royalty for Your past and future use of\nModifications made by such Participant, or (ii) withdraw Your litigation claim with\nrespect to the Contributor Version against such Participant. If within 60 days of notice,\na reasonable royalty and payment arrangement are not mutually agreed upon in writing by\nthe parties or the litigation claim is not withdrawn, the rights granted by Participant to\nYou under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day\nnotice period specified above.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nany software, hardware, or device, other than such Participant's Contributor Version,\ndirectly or indirectly infringes any patent, then any rights granted to You by such\nParticipant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You\nfirst made, used, sold, distributed, or had made, Modifications made by that\nParticipant.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such\nParticipant's Contributor Version directly or indirectly infringes any patent where\nsuch claim is resolved (such as by license or settlement) prior to the initiation of patent\ninfringement litigation, then the reasonable value of the licenses granted by such Participant\nunder Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of\nany payment or license.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE),\nCONTRACT, OR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ORIGINAL DEVELOPER, ANY\nOTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH\nPARTIES, BE LIABLE TO ANY PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR\nCONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS\nOF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER\nCOMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE\nPOSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY\nFOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE\nEXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE\nEXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND\nLIMITATION MAY NOT APPLY TO YOU.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nU.S. GOVERNMENT END USERS.\nThe Covered Code is a \"commercial item,\" as that term is defined in 48 C.F.R.\n2.101 (Oct. 1995), consisting of \"commercial computer software\" and\n\"commercial computer software documentation,\" as such terms are used in\n48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R.\n227.7202-1 through 227.7202-4 (June 1995), all U.S. Government End Users acquire\nCovered Code with only those rights set forth herein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMISCELLANEOUS.\nThis License represents the complete agreement concerning subject matter hereof. If any\nprovision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. This License shall be\ngoverned by California law provisions (except to the extent applicable law, if any,\nprovides otherwise), excluding its conflict-of-law provisions. With respect to\ndisputes in which at least one party is a citizen of, or an entity chartered or\nregistered to do business in the United States of America, any litigation relating to\nthis License shall be subject to the jurisdiction of the Federal Courts of the\nNorthern District of California, with venue lying in Santa Clara County, California,\nwith the losing party responsible for costs, including without limitation, court costs\nand reasonable attorneys' fees and expenses. The application of the United\nNations Convention on Contracts for the International Sale of Goods is expressly\nexcluded. Any law or regulation which provides that the language of a contract shall\nbe construed against the drafter shall not apply to this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRESPONSIBILITY FOR CLAIMS.\nAs between Initial Developer, Original Developer and the Contributors, each party is\nresponsible for claims and damages arising, directly or indirectly, out of its\nutilization of rights under this License and You agree to work with Initial Developer,\nOriginal Developer and Contributors to distribute such responsibility on an equitable\nbasis. Nothing herein is intended or shall be deemed to constitute any admission of\nliability.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "13."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMULTIPLE-LICENSED CODE.\nInitial Developer may designate portions of the Covered Code as Multiple-Licensed.\nMultiple-Licensed means that the Initial Developer permits you to utilize portions of\nthe Covered Code under Your choice of the CPAL or the alternative licenses, if any,\nspecified by the Initial Developer in the file described in Exhibit A.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "14."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nADDITIONAL TERM: ATTRIBUTION\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAs a modest attribution to the organizer of the development of the Original Code\n(\"Original Developer\"), in the hope that its promotional value may help\njustify the time, money and effort invested in writing the Original Code, the Original\nDeveloper may include in Exhibit B (\"Attribution Information\") a requirement\nthat each time an Executable and Source Code or a Larger Work is launched or initially run\n(which includes initiating a session), a prominent display of the Original\nDeveloper's Attribution Information (as defined below) must occur on the graphic\nuser interface employed by the end user to access such Covered Code (which may include\ndisplay on a splash screen), if any. The size of the graphic image should be consistent\nwith the size of the other elements of the Attribution Information. If the access by the\nend user to the Executable and Source Code does not create a graphic user interface for\naccess to the Covered Code, this obligation shall not apply. If the Original Code displays\nsuch Attribution Information in a particular form (such as in the form of a splash screen,\nnotice at login, an \"about\" display, or dedicated attribution area on user\ninterface screens), continued use of such form for that Attribution Information is one way\nof meeting this requirement for notice.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAttribution information may only include a copyright notice, a brief phrase, graphic image\nand a URL (\"Attribution Information\") and is subject to the Attribution\nLimits as defined below. For these purposes, prominent shall mean display for sufficient\nduration to give reasonable notice to the user of the identity of the Original Developer\nand that if You include Attribution Information or similar information for other parties,\nYou must ensure that the Attribution Information for the Original Developer shall be no\nless prominent than such Attribution Information or similar information for the other\nparty. For greater certainty, the Original Developer may choose to specify in Exhibit B\nbelow that the above attribution requirement only applies to an Executable and Source Code\nresulting from the Original Code or any Modification, but not a Larger Work. The intent is\nto provide for reasonably modest attribution, therefore the Original Developer cannot\nrequire that You display, at any time, more than the following information as Attribution\nInformation: (a) a copyright notice including the name of the Original Developer; (b) a\nword or one phrase (not exceeding 10 words); (c) one graphic image provided by the\nOriginal Developer; and (d) a URL (collectively, the \"Attribution\nLimits\").\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf Exhibit B does not include any Attribution Information, then there are no requirements for\nYou to display any Attribution Information of the Original Developer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou acknowledge that all trademarks, service marks and/or trade names contained within the\nAttribution Information distributed with the Covered Code are the exclusive property of\ntheir owners and may only be used with the permission of their owners, or under\ncircumstances otherwise permitted by law or as expressly set out in this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "15."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nADDITIONAL TERM: NETWORK USE.\nThe term \"External Deployment\" means the use, distribution, or communication of the\nOriginal Code or Modifications in any way such that the Original Code or Modifications may be used by\nanyone other than You, whether those works are distributed or communicated to those persons or made\navailable as an application intended for use over a network. As an express condition for the grants of\nlicense hereunder, You must treat any External Deployment by You of the Original Code or Modifications\nas a distribution under section 3.1 and make Source Code available under Section 3.2.\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nEXHIBIT A. Common Public Attribution License Version 1.0.\n\"The contents of this file are subject to the Common Public Attribution License Version 1.0 (the\n\"License\"); you may not use this file except in compliance with the License. You may\nobtain a copy of the License at "}, {"type": "var", "name": "source", "content": [{"type": "text", "content": "_____________"}], "pattern": ".+"}, {"type": "text", "content": ". The License is based on the Mozilla Public License\nVersion 1.1 but Sections 14 and 15 have been added to cover use of software over a computer network\nand provide for limited attribution for the Original Developer. In addition, Exhibit A has been\nmodified to be consistent with Exhibit B.\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT\nWARRANTY OF ANY KIND, either express or implied. See the License for the specific language\ngoverning rights and limitations under the License.\nThe Original Code is "}, {"type": "var", "name": "code", "content": [{"type": "text", "content": "______________________"}], "pattern": ".+"}, {"type": "text", "content": ".\nThe Original Developer is not the Initial Developer and is "}, {"type": "var", "name": "originalDeveloper", "content": [{"type": "text", "content": "__________"}], "pattern": ".+"}, {"type": "text", "content": ". If left blank, the Original\nDeveloper is the Initial Developer.\nThe Initial Developer of the Original Code is "}, {"type": "var", "name": "initialDeveloper", "content": [{"type": "text", "content": "____________"}], "pattern": ".+"}, {"type": "text", "content": ". All portions of the code written by\n"}, {"type": "var", "name": "initialDeveloper2", "content": [{"type": "text", "content": "___________"}], "pattern": ".+"}, {"type": "text", "content": " are Copyright (c) "}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "_____"}], "pattern": ".+"}, {"type": "text", "content": ". All Rights Reserved.\nContributor "}, {"type": "var", "name": "contributor", "content": [{"type": "text", "content": "______________________"}], "pattern": ".+"}, {"type": "text", "content": ".\nAlternatively, the contents of this file may be used under the terms of the "}, {"type": "var", "name": "altLicense", "content": [{"type": "text", "content": "_____"}], "pattern": ".+"}, {"type": "text", "content": " license (the\n"}, {"type": "var", "name": "altLicenseShort1", "content": [{"type": "text", "content": "[___]"}], "pattern": ".+"}, {"type": "text", "content": " License), in which case the provisions of "}, {"type": "var", "name": "altLicenseShort2", "content": [{"type": "text", "content": "[______]"}], "pattern": ".+"}, {"type": "text", "content": " License are applicable instead of\nthose above.\nIf you wish to allow use of your version of this file only under the terms of the "}, {"type": "var", "name": "altLicenseShort3", "content": [{"type": "text", "content": "[____]"}], "pattern": ".+"}, {"type": "text", "content": " License\nand not to allow others to use your version of this file under the CPAL, indicate your\ndecision by deleting the provisions above and replace them with the notice and other\nprovisions required by the "}, {"type": "var", "name": "altLicenseShort4", "content": [{"type": "text", "content": "[___]"}], "pattern": ".+"}, {"type": "text", "content": " License. If you do not delete the provisions above, a\nrecipient may use your version of this file under either the CPAL or the "}, {"type": "var", "name": "altLicenseShort5", "content": [{"type": "text", "content": "[___]"}], "pattern": ".+"}, {"type": "text", "content": "\nLicense.\"\n[NOTE: The text of this Exhibit A may differ slightly from the text of the notices in the Source Code\nfiles of the Original Code. You should use the text of this Exhibit A rather than the text found in\nthe Original Code Source Code for Your Modifications.]\nEXHIBIT B. Attribution Information\nAttribution Copyright Notice: _______________________\nAttribution Phrase (not exceeding 10 words): _______________________\nAttribution URL: _______________________\nGraphic Image as provided in the Covered Code, if any.\nDisplay of Attribution Information is [required/not required] in Larger Works which are defined in\nthe CPAL as a work which combines Covered Code or portions thereof with code not governed by\nthe terms of the CPAL.\n"}]}, {"type": "text", "content": "\n"}]