[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nCUA Office Public License Version 1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.0.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Commercial Use\" means distribution or otherwise making the Covered Code\navailable to a third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor Version\" means the combination of the Original Code, prior Modifications\nused by a Contributor, and the Modifications made by that particular Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Covered Code\" means the Original Code or Modifications or the combination of the\nOriginal Code and Modifications, in each case including portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Electronic Distribution Mechanism\" means a mechanism generally accepted in the\nsoftware development community for the electronic transfer of data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Executable\" means Covered Code in any form other than Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Initial Developer\" means the individual or entity identified as the Initial Developer\nin the Source Code notice required by Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work which combines Covered Code or portions thereof with code\nnot governed by the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"License\" means this document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Licensable\" means having the right to grant, to the maximum extent possible,\nwhether at the time of the initial grant or subsequently acquired, any and all of the rights\nconveyed herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" means any addition to or deletion from the substance or structure of\neither the Original Code or any previous Modifications. When Covered Code is released as a\nseries of files, a Modification is:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "A."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny addition to or deletion from the contents of a file containing Original Code or previous\nModifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "B."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Code\" means Source Code of computer software code which is described in the\nSource Code notice required by Exhibit A as Original Code, and which, at the time of its\nrelease under this License is not already Covered Code governed by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Patent Claims\" means any patent claim(s), now owned or hereafter acquired,\nincluding without limitation, method, process, and apparatus claims, in any patent Licensable\nby grantor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" means the preferred form of the Covered Code for making modifications to\nit, including all modules it contains, plus any associated interface definition files, scripts\nused to control compilation and installation of an Executable, or source code differential\ncomparisons against either the Original Code or another well known, available Covered Code of\nthe Contributor's choice. The Source Code can be in a compressed or archival form,\nprovided the appropriate decompression or de-archiving software is widely available for no\ncharge.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" (or \"Your\") means an individual or a legal entity exercising rights\nunder, and complying with all of the terms of, this License or a future version of this\nLicense issued under Section 6.1. For legal entities, \"You\" includes any entity\nwhich controls, is controlled by, or is under common control with You. For purposes of this\ndefinition, \"control\" means (a) the power, direct or indirect, to cause the\ndirection or management of such entity, whether by contract or otherwise, or (b) ownership of\nmore than fifty percent (50%) of the outstanding shares or beneficial ownership of such\nentity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSource Code License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Initial Developer Grant. The Initial Developer hereby grants You a world-wide, royalty-free,\nnon-exclusive license, subject to third party intellectual property claims:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Initial\nDeveloper to use, reproduce, modify, display, perform, sublicense and distribute the\nOriginal Code (or portions thereof) with or without Modifications, and/or as part of a\nLarger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patents Claims infringed by the making, using or selling of Original Code, to make,\nhave made, use, practice, sell, and offer for sale, and/or otherwise dispose of the\nOriginal Code (or portions thereof).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in this Section 2.1(a) and (b) are effective on the date Initial\nDeveloper first distributes Original Code under the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.1(b) above, no patent license is granted: 1) for code that You\ndelete from the Original Code; 2) separate from the Original Code; or 3) for infringements\ncaused by: i) the modification of the Original Code or ii) the combination of the Original\nCode with other software or devices.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor Grant. Subject to third party intellectual property claims, each Contributor hereby\ngrants You a world-wide, royalty-free, non-exclusive license\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by\nContributor, to use, reproduce, modify, display, perform, sublicense and distribute the\nModifications created by such Contributor (or portions thereof) either on an unmodified\nbasis, with other Modifications, as Covered Code and/or as part of a Larger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by that\nContributor either alone and/or in combination with its Contributor Version (or portions\nof such combination), to make, use, sell, offer for sale, have made, and/or otherwise\ndispose of: 1) Modifications made by that Contributor (or portions thereof); and 2) the\ncombination of Modifications made by that Contributor with its Contributor Version (or\nportions of such combination).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in Sections 2.2(a) and 2.2(b) are effective on the date Contributor\nfirst makes Commercial Use of the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.2(b) above, no patent license is granted: 1) for any code that\nContributor has deleted from the Contributor Version; 2) separate from the Contributor\nVersion; 3) for infringements caused by: i) third party modifications of Contributor\nVersion or ii) the combination of Modifications made by that Contributor with other\nsoftware (except as part of the Contributor Version) or other devices; or 4) under Patent\nClaims infringed by Covered Code in the absence of Modifications made by that\nContributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution Obligations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of License. The Modifications which You create or to which You contribute are\ngoverned by the terms of this License, including without limitation Section 2.2. The Source\nCode version of Covered Code may be distributed only under the terms of this License or a\nfuture version of this License released under Section 6.1, and You must include a copy of this\nLicense with every copy of the Source Code You distribute. You may not offer or impose any\nterms on any Source Code version that alters or restricts the applicable version of this\nLicense or the recipients' rights hereunder. However, You may include an additional\ndocument offering the additional rights described in Section 3.5.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAvailability of Source Code. Any Modification which You create or to which You contribute must be\nmade available in Source Code form under the terms of this License either on the same media as\nan Executable version or via an accepted Electronic Distribution Mechanism to anyone to whom\nyou made an Executable version available; and if made available via Electronic Distribution\nMechanism, must remain available for at least twelve (12) months after the date it initially\nbecame available, or at least six (6) months after a subsequent version of that particular\nModification has been made available to such recipients. You are responsible for ensuring that\nthe Source Code version remains available even if the Electronic Distribution Mechanism is\nmaintained by a third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDescription of Modifications. You must cause all Covered Code to which You contribute to contain\na file documenting the changes You made to create that Covered Code and the date of any\nchange. You must include a prominent statement that the Modification is derived, directly or\nindirectly, from Original Code provided by the Initial Developer and including the name of the\nInitial Developer in (a) the Source Code, and (b) in any notice in an Executable version or\nrelated documentation in which You describe the origin or ownership of the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property Matters\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Claims. If Contributor has knowledge that a license under a third party's\nintellectual property rights is required to exercise the rights granted by such\nContributor under Sections 2.1 or 2.2, Contributor must include a text file with the\nSource Code distribution titled \"LEGAL\" which describes the claim and the party\nmaking the claim in sufficient detail that a recipient will know whom to contact. If\nContributor obtains such knowledge after the Modification is made available as described\nin Section 3.2, Contributor shall promptly modify the LEGAL file in all copies Contributor\nmakes available thereafter and shall take other steps (such as notifying appropriate\nmailing lists or newsgroups) reasonably calculated to inform those who received the\nCovered Code that new knowledge has been obtained.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor APIs. If Contributor's Modifications include an application programming\ninterface and Contributor has knowledge of patent licenses which are reasonably necessary\nto implement that API, Contributor must also include this information in the LEGAL\nfile.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentations. Contributor represents that, except as disclosed pursuant to Section 3.4(a)\nabove, Contributor believes that Contributor's Modifications are Contributor's\noriginal creation(s) and/or Contributor has sufficient rights to grant the rights conveyed\nby this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRequired Notices. You must duplicate the notice in Exhibit A in each file of the Source Code. If\nit is not possible to put such notice in a particular Source Code file due to its structure,\nthen You must include such notice in a location (such as a relevant directory) where a user\nwould be likely to look for such a notice. If You created one or more Modification(s) You may\nadd your name as a Contributor to the notice described in Exhibit A. You must also duplicate\nthis License in any documentation for the Source Code where You describe recipients'\nrights or ownership rights relating to Covered Code. You may choose to offer, and to charge a\nfee for, warranty, support, indemnity or liability obligations to one or more recipients of\nCovered Code. However, You may do so only on Your own behalf, and not on behalf of the Initial\nDeveloper or any Contributor. You must make it absolutely clear than any such warranty,\nsupport, indemnity or liability obligation is offered by You alone, and You hereby agree to\nindemnify the Initial Developer and every Contributor for any liability incurred by the\nInitial Developer or such Contributor as a result of warranty, support, indemnity or liability\nterms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Versions. You may distribute Covered Code in Executable form only if\nthe requirements of Section 3.1-3.5 have been met for that Covered Code, and if You include a\nnotice stating that the Source Code version of the Covered Code is available under the terms\nof this License, including a description of how and where You have fulfilled the obligations\nof Section 3.2. The notice must be conspicuously included in any notice in an Executable\nversion, related documentation or collateral in which You describe recipients' rights\nrelating to the Covered Code. You may distribute the Executable version of Covered Code or\nownership rights under a license of Your choice, which may contain terms different from this\nLicense, provided that You are in compliance with the terms of this License and that the\nlicense for the Executable version does not attempt to limit or alter the recipient's\nrights in the Source Code version from the rights set forth in this License. If You distribute\nthe Executable version under a different license You must make it absolutely clear that any\nterms which differ from this License are offered by You alone, not by the Initial Developer or\nany Contributor. You hereby agree to indemnify the Initial Developer and every Contributor for\nany liability incurred by the Initial Developer or such Contributor as a result of any such\nterms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works. You may create a Larger Work by combining Covered Code with other code not governed\nby the terms of this License and distribute the Larger Work as a single product. In such a\ncase, You must make sure the requirements of this License are fulfilled for the Covered\nCode.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect to\nsome or all of the Covered Code due to statute, judicial order, or regulation then You\nmust: (a) comply with the terms of this License to the maximum extent possible; and\n(b) describe the limitations and the code they affect. Such description must be\nincluded in the LEGAL file described in Section 3.4 and must be included with all\ndistributions of the Source Code. Except to the extent prohibited by statute or\nregulation, such description must be sufficiently detailed for a recipient of ordinary\nskill to be able to understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of this License.\nThis License applies to code to which the Initial Developer has attached the notice in\nExhibit A and to related Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions. CUA Office Project may publish revised and/or new versions of the License from time\nto time. Each version will be given a distinguishing version number.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions. Once Covered Code has been published under a particular version of the\nLicense, You may always continue to use it under the terms of that version. You may also\nchoose to use such Covered Code under the terms of any subsequent version of the License\npublished by CUA Office Project. No one other than CUA Office Project has the right to modify\nthe terms applicable to Covered Code created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDerivative Works. If You create or use a modified version of this License (which you may only do\nin order to apply it to code which is not already Covered Code governed by this License), You\nmust (a) rename Your license so that the phrases \"CUA Office\", \"CUA\",\n\"CUAPL\", or any confusingly similar phrase do not appear in your license (except to\nnote that your license differs from this License) and (b) otherwise make it clear that Your\nversion of the license contains terms which differ from the CUA Office Public License.\n(Filling in the name of the Initial Developer, Original Code or Contributor in the notice\ndescribed in Exhibit A shall not of themselves be deemed to be modifications of this\nLicense.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISCLAIMER OF WARRANTY.\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES\nTHAT THE COVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE\nOR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED\nCODE IS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE\nINITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY\nSERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL\nPART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER\nTHIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTERMINATION.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to comply\nwith terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\nAll sublicenses to the Covered Code which are properly granted shall survive any termination\nof this License. Provisions which, by their nature, must remain in effect beyond the\ntermination of this License shall survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You initiate litigation by asserting a patent infringement claim (excluding declatory judgment\nactions) against Initial Developer or a Contributor (the Initial Developer or Contributor\nagainst whom You file such action is referred to as \"Participant\") alleging\nthat:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsuch Participant's Contributor Version directly or indirectly infringes any patent, then\nany and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of\nthis License shall, upon 60 days notice from Participant terminate prospectively, unless\nif within 60 days after receipt of notice You either: (i) agree in writing to pay\nParticipant a mutually agreeable reasonable royalty for Your past and future use of\nModifications made by such Participant, or (ii) withdraw Your litigation claim with\nrespect to the Contributor Version against such Participant. If within 60 days of notice,\na reasonable royalty and payment arrangement are not mutually agreed upon in writing by\nthe parties or the litigation claim is not withdrawn, the rights granted by Participant to\nYou under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day\nnotice period specified above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany software, hardware, or device, other than such Participant's Contributor Version,\ndirectly or indirectly infringes any patent, then any rights granted to You by such\nParticipant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You\nfirst made, used, sold, distributed, or had made, Modifications made by that\nParticipant.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such\nParticipant's Contributor Version directly or indirectly infringes any patent where such\nclaim is resolved (such as by license or settlement) prior to the initiation of patent\ninfringement litigation, then the reasonable value of the licenses granted by such Participant\nunder Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of\nany payment or license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE),\nCONTRACT, OR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR\nANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO\nANY PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY\nCHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE,\nCOMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES,\nEVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\nLIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\nRESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS\nSUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT APPLY TO\nYOU.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nU.S. GOVERNMENT END USERS.\nThe Covered Code is a \"commercial item,\" as that term is defined in 48 C.F.R.\n2.101 (Oct. 1995), consisting of \"commercial computer software\" and\n\"commercial computer software documentation,\" as such terms are used in 48\nC.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1\nthrough 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code\nwith only those rights set forth herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMISCELLANEOUS.\nThis License represents the complete agreement concerning subject matter hereof. If any\nprovision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. This License shall be\ngoverned by California law provisions (except to the extent applicable law, if any,\nprovides otherwise), excluding its conflict-of-law provisions. With respect to\ndisputes in which at least one party is a citizen of, or an entity chartered or\nregistered to do business in the United States of America, any litigation relating to\nthis License shall be subject to the jurisdiction of the Federal Courts of the\nNorthern District of California, with venue lying in Santa Clara County, California,\nwith the losing party responsible for costs, including without limitation, court costs\nand reasonable attorneys' fees and expenses. The application of the United\nNations Convention on Contracts for the International Sale of Goods is expressly\nexcluded. Any law or regulation which provides that the language of a contract shall\nbe construed against the drafter shall not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRESPONSIBILITY FOR CLAIMS.\nAs between Initial Developer and the Contributors, each party is responsible for claims and\ndamages arising, directly or indirectly, out of its utilization of rights under this\nLicense and You agree to work with Initial Developer and Contributors to distribute\nsuch responsibility on an equitable basis. Nothing herein is intended or shall be\ndeemed to constitute any admission of liability.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMULTIPLE-LICENSED CODE.\nInitial Developer may designate portions of the Covered Code as \"Multiple-Licensed\".\n\"Multiple-Licensed\" means that the Initial Developer permits you to utilize portions of the\nCovered Code under Your choice of the NPL or the alternative licenses, if any, specified by the\nInitial Developer in the file described in Exhibit A.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEXHIBIT A - CUA Office Public License.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\""}]}, {"tag": "text", "content": "The contents of this file are subject to the CUA Office Public License Version 1.0 (the\n\"License\"); you may not use this file except in compliance with the License. You may obtain\na copy of the License at http://cuaoffice.sourceforge.net/\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF\nANY KIND, either express or implied. See the License for the specific language governing rights and\nlimitations under the License.\nThe Original Code is "}, {"tag": "var", "name": "code", "content": [{"tag": "text", "content": "______________________________________"}], "pattern": ".+"}, {"tag": "text", "content": ".\nThe Initial Developer of the Original Code is "}, {"tag": "var", "name": "initialDeveloper", "content": [{"tag": "text", "content": "________________________"}], "pattern": ".+"}, {"tag": "text", "content": ". Portions created by\n"}, {"tag": "var", "name": "creator", "content": [{"tag": "text", "content": "______________________"}], "pattern": ".+"}, {"tag": "text", "content": " are Copyright (C) "}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "______ _______________________"}], "pattern": ".+"}, {"tag": "text", "content": ". All Rights Reserved.\nContributor(s): "}, {"tag": "var", "name": "contributor", "content": [{"tag": "text", "content": "______________________________________"}], "pattern": ".+"}, {"tag": "text", "content": ".\nAlternatively, the contents of this file may be used under the terms of the "}, {"tag": "var", "name": "altLicense", "content": [{"tag": "text", "content": "_____"}], "pattern": ".+"}, {"tag": "text", "content": " license (the\n\" "}, {"tag": "var", "name": "altLicenseShort1", "content": [{"tag": "text", "content": "[___]"}], "pattern": ".+"}, {"tag": "text", "content": " License\"), in which case the provisions of "}, {"tag": "var", "name": "altLicenseShort2", "content": [{"tag": "text", "content": "[______]"}], "pattern": ".+"}, {"tag": "text", "content": " License are applicable instead of\nthose above. If you wish to allow use of your version of this file only under the terms of the "}, {"tag": "var", "name": "altLicenseShort3", "content": [{"tag": "text", "content": "[____]"}], "pattern": ".+"}, {"tag": "text", "content": "\nLicense and not to allow others to use your version of this file under the CUAPL, indicate your\ndecision by deleting the provisions above and replace them with the notice and other provisions\nrequired by the "}, {"tag": "var", "name": "altLicenseShort4", "content": [{"tag": "text", "content": "[___]"}], "pattern": ".+"}, {"tag": "text", "content": " License. If you do not delete the provisions above, a recipient may use your\nversion of this file under either the CUAPL or the "}, {"tag": "var", "name": "altLicenseShort5", "content": [{"tag": "text", "content": "[___]"}], "pattern": ".+"}, {"tag": "text", "content": " License."}, {"tag": "optional", "content": [{"tag": "text", "content": "\""}]}, {"tag": "text", "content": "\n[NOTE: The text of this Exhibit A may differ slightly from the text of the notices in the Source Code\nfiles of the Original Code. You should use the text of this Exhibit A rather than the text found in\nthe Original Code Source Code for Your Modifications.]\n"}]}, {"tag": "text", "content": "\n"}]