[{"type": "optional", "content": {"type": "text", "content": "Deutsche Freie Software Lizenz"}}, {"type": "text", "content": "\n        (c) Ministerium für Wissenschaft und Forschung Nordrhein-Westfalen 2004\n        "}, {"type": "optional", "content": [{"type": "text", "content": "Erstellt von Axel Metzger und Till Jaeger, Institut für Rechtsfragen der Freien und Open Source Software\n              - "}, {"type": "var", "name": "linkOpener-ifross.de", "content": {"type": "text", "content": "("}, "pattern": "(\\(\\<|\\()?"}, {"type": "text", "content": "http://www.ifross.de"}, {"type": "var", "name": "linkCloser-ifross.de", "content": {"type": "text", "content": ")"}, "pattern": "(\\)\\>|\\))?"}, {"type": "text", "content": ".\n            Präambel\n            Software ist mehr als ein Wirtschaftsgut. Sie ist die technische Grundlage der Informationsgesellschaft.\n             Die Frage der Teilhabe der Allgemeinheit ist deswegen von besonderer Bedeutung. Herkömmlich\n             lizenzierte Programme werden nur im Object Code vertrieben, der Nutzer darf das Programm weder\n             verändern noch weitergeben. Das Lizenzmodell der Freien Software (synonym \"Open Source Software\")\n             gewährt Ihnen dagegen umfassende Freiheiten im Umgang mit dem Programm. Die Deutsche Freie Software\n             Lizenz folgt diesem Lizenzmodell. Sie gewährt Ihnen das Recht, das Programm in umfassender Weise zu\n             nutzen. Es ist Ihnen gestattet, das Programm nach Ihren Vorstellungen zu verändern, in veränderter\n             oder unveränderter Form zu vervielfältigen, zu verbreiten und öffentlich zugänglich zu machen. Diese\n             Rechte werden unentgeltlich eingeräumt.\n            Die Deutsche Freie Software Lizenz verbindet die Rechtseinräumung allerdings mit Pflichten, die dem Zweck\n             dienen, das freie Zirkulieren des Programms und aller veröffentlichten Fortentwicklungen zu sichern.\n             Wenn Sie das Programm verbreiten oder öffentlich zugänglich machen, dann müssen Sie jedem, der das\n             Programm von Ihnen erhält, eine Kopie dieser Lizenz mitliefern und den Zugriff auf den Source Code\n             ermöglichen. Eine weitere Pflicht betrifft Fortentwicklungen des Programms. Änderungen am Programm,\n             die Sie öffentlich verbreiten oder zugänglich machen, müssen nach den Bestimmungen dieser Lizenz frei\n             gegeben werden.\n            Die Deutsche Freie Software Lizenz nimmt auf die besonderen Anforderungen des deutschen und europäischen\n             Rechts Rücksicht. Sie ist zweisprachig gestaltet und damit auch auf den internationalen Vertrieb\n             ausgerichtet."}]}, {"type": "text", "content": "\n      § 0 Definitionen\n            Dokumentation: Die Beschreibung des Aufbaus und/oder der Struktur der Programmierung und/oder der\n                     Funktionalitäten des Programms, unabhängig davon, ob sie im Source Code oder gesondert vorgenommen\n                     wird.\n                Lizenz: Die zwischen dem Lizenzgeber und Ihnen geschlossene Vereinbarung mit dem Inhalt der \"Deutschen\n                     Freien Software Lizenz\" bzw. das Angebot hierzu.\n                Lizenznehmer: Jede natürliche oder juristische Person, die die Lizenz angenommen hat.\n                Programm: Jedes Computerprogramm, das von den Rechtsinhabern nach den Bestimmungen dieser Lizenz\n                     verbreitet oder öffentlich zugänglich gemacht worden ist.\n                Object Code: Die maschinenlesbare, übersetzte Form des Programms.\n                Öffentlich: Nicht nur an einen bestimmten Personenkreis gerichtet, der persönlich oder durch die\n                     Zugehörigkeit zu einer juristischen Person oder einem öffentlichen Träger miteinander verbunden\n                     ist.\n                Öffentlich zugänglich machen: Die öffentliche Weitergabe des Programms in unkörperlicher Form,\n                     insbesondere das Bereithalten zum Download in Datennetzen.\n                Rechtsinhaber: Der bzw. die Urheber oder sonstigen Inhaber der ausschließlichen Nutzungsrechte an dem\n                     Programm.\n                Source Code: Die für Menschen lesbare, in Programmiersprache dargestellte Form des Programms.\n                Verändern: Jede Erweiterung, Kürzung und Bearbeitung des Programms, insbesondere Weiterentwicklungen.\n                Verbreiten: Die öffentliche Weitergabe körperlicher Vervielfältigungsstücke, insbesondere auf\n                     Datenträgern oder in Verbindung mit Hardware.\n                Vollständiger Source Code: Der Source Code in der für die Erstellung bzw. die Bearbeitung benutzten Form\n                     zusammen mit den zur Übersetzung und Installation erforderlichen Konfigurationsdateien und\n                     Software-Werkzeugen, sofern diese in der benötigten Form nicht allgemein gebräuchlich (z.B.\n                     Standard-Kompiler) oder für jedermann lizenzgebührenfrei im Internet abrufbar sind.\n        § 1 Rechte\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                Sie dürfen das Programm in unveränderter Form vervielfältigen, verbreiten und öffentlich\n                 zugänglich machen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie dürfen das Programm verändern und entsprechend veränderte Versionen vervielfältigen,\n                     verbreiten und öffentlich zugänglich machen. Gestattet ist auch die Kombination des Programms\n                     oder Teilen hiervon mit anderen Programmen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie erhalten die Rechte unentgeltlich.\n        § 2 Pflichten beim Vertrieb\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie das Programm verbreiten oder öffentlich zugänglich machen, sei es in unveränderter oder\n                     veränderter Form, sei es in einer Kombination mit anderen Programmen oder in Verbindung mit\n                     Hardware, dann müssen sie mitliefern:\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    alle Vermerke im Source Code und/oder Object Code, die auf diese Lizenz hinweisen;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    alle Vermerke im Source Code und/oder Object Code, die über die Urheber des Programms Auskunft geben;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    einen für den Empfänger deutlich wahrnehmbaren Hinweis auf diese Lizenz und die Internetadresse\n                      "}, {"type": "optional", "content": {"type": "text", "content": "<"}}, {"type": "text", "content": "http://www.d-fsl.de"}, {"type": "optional", "content": {"type": "text", "content": ">"}}, {"type": "text", "content": ";\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    den vollständigen Text dieser Lizenz in deutlich wahrnehmbarer Weise.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn bei der Installation des Programms und/oder beim Programmstart Lizenz- und/oder\n                     Vertragsbedingungen angezeigt werden, dann müssen\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    diese Lizenz,\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    ein Hinweis auf diese Lizenz und\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    ein Hinweis auf den oder die Rechtsinhaber an den ersten unter dieser Lizenz nutzbaren\n                     Programmbestandteilen\n                    ebenfalls angezeigt werden.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie dürfen die Nutzung des Programms nicht von Pflichten oder Bedingungen abhängig machen, die\n                     nicht in dieser Lizenz vorgesehen sind.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(4)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sofern Sie mit dem Programm eine Dokumentation erhalten haben, muss diese Dokumentation\n                     entsprechend mitgeliefert werden, es sei denn, die freie Mitlieferung der Dokumentation ist\n                     Ihnen aufgrund der Lizenz für die Dokumentation nicht gestattet.\n        § 3 Weitere Pflichten beim Vertrieb veränderter Versionen\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Veränderte Versionen des Programms dürfen Sie nur unter den Bedingungen dieser Lizenz verbreiten\n                     oder öffentlich zugänglich machen, so dass Dritte das veränderte Programm insgesamt unter\n                     dieser Lizenz nutzen können.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wird das Programm oder ein Teil hiervon mit einem anderen Programm kombiniert, gilt auch die\n                     Kombination insgesamt als eine veränderte Version des Programms, es sei denn, das andere\n                     Programm ist formal und inhaltlich eigenständig. Ein anderes Programm ist dann als\n                     eigenständig anzusehen, wenn es die folgenden Voraussetzungen alle erfüllt:\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der Source Code der kombinierten Programme muss jeweils in eigenen Dateien vorhanden sein, die\n                             keine Bestandteile des anderen Teils enthalten, die über die zur Programmkombination üblichen\n                             und erforderlichen Informationen über den anderen Teil hinausgehen, wobei der Source Code des\n                             anderen Programms nicht mitgeliefert werden muss.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            Der mit dem Programm kombinierte Teil muss auch dann sinnvoll nutzbar sein, wenn er nicht mit dem\n                             Programm kombiniert wird, und zwar entweder alleine oder mit sonstigen Programmen. Was als\n                             \"sinnvoll nutzbar\" anzusehen ist, richtet sich nach der Auffassung der betroffenen Fachkreise.\n                             Zu den betroffenen Fachkreisen gehören alle Personen, die das Programm oder Programme mit\n                             vergleichbarer Funktionalität entwickeln, benutzen, verbreiten oder öffentlich zugänglich\n                             machen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie das Programm oder einen Teil hiervon - verändert oder unverändert - zusammen mit einem\n                     anderen Programm verbreiten oder öffentlich zugänglich machen, das unter der GNU General\n                     Public License (GPL) lizenziert wird, darf das Programm auch unter den Bedingungen der GPL\n                     genutzt werden, sofern es mit dem anderen Programm ein \"derivative work\" im Sinne der GPL\n                     bildet. Dabei sollen die Hinweise auf diese Lizenz entfernt und durch einen Hinweis auf die\n                     GPL ersetzt werden. Ob bei der Zusammenstellung ein \"derivate work\" im Sinne der GPL entsteht,\n                     beurteilt sich nach Ziffer 2 b) der GPL. Diese Bestimmung lautet: \"You must cause any work\n                     that you distribute or publish, that in whole or in part contains or is derived from the\n                     Program or any part thereof, to be licensed as a whole at no charge to all third parties under\n                     the terms of this License.\" Die GPL kann abgerufen werden unter\n                     http://www.fsf.org/licenses/gpl.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(4)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie das Programm in einer veränderten Form verbreiten oder öffentlich zugänglich machen,\n                     müssen Sie im Source Code einen Hinweis mit den Änderungen aufnehmen und mit dem Datum der\n                     Änderung versehen. Der Hinweis muss erkennen lassen, welche Änderungen vorgenommen wurden und\n                     bestehende Vermerke, die über die Urheber des Programms Auskunft geben, übernehmen. Dies gilt\n                     unabhängig davon, ob Sie einen eigenen Urhebervermerk hinzufügen. Anstelle eines Hinweises im\n                     Source Code können Sie auch ein Versionskontrollsystem verwenden oder weiterführen, sofern\n                     dieses mitverbreitet wird oder öffentlich zugänglich ist.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(5)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie dürfen von Dritten für die Einräumung eines einfachen Nutzungsrechts an veränderten Versionen\n                     des Programms kein Entgelt verlangen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(6)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie an der veränderten Version des Programms ein anderes Schutzrecht als ein Urheberrecht\n                     erwerben, insbesondere ein Patent oder Gebrauchsmuster, lizenzieren Sie dieses Schutzrecht für\n                     veränderte und unveränderte Versionen des Programms in dem Umfang, der erforderlich ist, um\n                     die Rechte aus dieser Lizenz wahrnehmen zu können.\n        § 4 Weitere Pflichten beim Vertrieb im Object Code\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie das Programm nur im Object Code verbreiten, dann müssen Sie zusätzlich zu den in § 2 und\n                     § 3 geregelten Pflichten entweder\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            den vollständigen Source Code im Internet öffentlich zugänglich machen und bei der Verbreitung\n                             des Object Codes deutlich auf die vollständige Internetadresse hinweisen, unter der der Source\n                             Code abgerufen werden kann oder\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            den vollständigen Source Code auf einem hierfür üblichen Datenträger unter Beachtung der §§ 2 und\n                             3 mitverbreiten.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Wenn Sie das Programm im Object Code öffentlich zugänglich machen, dann müssen Sie zusätzlich zu\n                     den in § 2 und § 3 geregelten Pflichten den vollständigen Source Code im Internet öffentlich\n                     zugänglich machen und dabei deutlich auf die vollständige Internetadresse hinweisen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sofern Sie mit dem Programm eine Dokumentation erhalten haben, muss diese Dokumentation\n                     entsprechend der Absätze 1 und 2 mitgeliefert werden, es sei denn, die freie Mitlieferung der\n                     Dokumentation ist Ihnen aufgrund der Lizenz für die Dokumentation nicht gestattet.\n        § 5 Vertragsschluss\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Mit dieser Lizenz wird Ihnen und jeder anderen Person ein Angebot auf Abschluss eines Vertrages\n                     über die Nutzung des Programms unter den Bedingungen der Deutschen Freien Softwarelizenz\n                     unterbreitet.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie dürfen das Programm nach den jeweils anwendbaren gesetzlichen Vorschriften bestimmungsgemäß\n                     benutzen, ohne dass es der Annahme dieser Lizenz bedarf. Dieses Recht umfasst in der\n                     Europäischen Union und in den meisten anderen Rechtsordnungen insbesondere die folgenden\n                     Befugnisse:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            das Programm ablaufen zu lassen sowie die Erstellung von hierfür erforderlichen\n                             Vervielfältigungen im Haupt- und Arbeitsspeicher;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            das Erstellen einer Sicherungskopie;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            die Fehlerberichtigung;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            die Weitergabe einer rechtmäßig erworbenen körperlichen Kopie des Programms.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie erklären Ihre Zustimmung zum Abschluss dieser Lizenz, indem Sie das Programm verbreiten,\n                     öffentlich zugänglich machen, verändern oder in einer Weise vervielfältigen, die über die\n                     bestimmungsgemäße Nutzung im Sinne von Absatz 2 hinausgeht. Ab diesem Zeitpunkt ist diese\n                     Lizenz als rechtlich verbindlicher Vertrag zwischen den Rechtsinhabern und Ihnen geschlossen,\n                     ohne dass es eines Zugangs der Annahmeerklärung bei den Rechtsinhabern bedarf.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(4)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie und jeder andere Lizenznehmer erhalten die Rechte aus dieser Lizenz direkt von den\n                     Rechtsinhabern. Eine Unterlizenzierung oder Übertragung der Rechte ist nicht gestattet.\n        § 6 Beendigung der Rechte bei Zuwiderhandlung\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Jede Verletzung Ihrer Verpflichtungen aus dieser Lizenz führt zu einer automatischen Beendigung\n                     Ihrer Rechte aus dieser Lizenz.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Die Rechte Dritter, die das Programm oder Rechte an dem Programm von Ihnen erhalten haben,\n                     bleiben hiervon unberührt.\n        § 7 Haftung und Gewährleistung\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Für entgegenstehende Rechte Dritter haften die Rechtsinhaber nur, sofern sie Kenntnis von diesen\n                     Rechten hatten, ohne Sie zu informieren.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Die Haftung für Fehler und sonstige Mängel des Programms richtet sich nach den außerhalb dieser\n                     Lizenz getroffenen Vereinbarungen zwischen Ihnen und den Rechtsinhabern oder, wenn eine solche\n                     Vereinbarung nicht existiert, nach den gesetzlichen Regelungen.\n        § 8 Verträge mit Dritten\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Diese Lizenz regelt nur die Beziehung zwischen Ihnen und den Rechtsinhabern. Sie ist nicht\n                     Bestandteil der Verträge zwischen Ihnen und Dritten.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Die Lizenz beschränkt Sie nicht in der Freiheit, mit Dritten, die von Ihnen Kopien des Programms\n                     erhalten oder Leistungen in Anspruch nehmen, die im Zusammenhang mit dem Programm stehen,\n                     Verträge beliebigen Inhalts zu schließen, sofern Sie dabei Ihren Verpflichtungen aus dieser\n                     Lizenz nachkommen und die Rechte der Dritten aus dieser Lizenz nicht beeinträchtigt werden.\n                     Insbesondere dürfen Sie für die Überlassung des Programms oder sonstige Leistungen ein Entgelt\n                     verlangen.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Diese Lizenz verpflichtet Sie nicht, das Programm an Dritte weiterzugeben. Es steht Ihnen frei zu\n                     entscheiden, wem Sie das Programm zugänglich machen. Sie dürfen aber die weitere Nutzung durch\n                     Dritte nicht durch den Einsatz technischer Schutzmaßnahmen, insbesondere durch den Einsatz von\n                     Kopierschutzvorrichtungen jeglicher Art, verhindern oder erschweren. Eine passwortgeschützte\n                     Zugangsbeschränkung oder die Nutzung in einem Intranet wird nicht als technische\n                     Schutzmaßnahme angesehen.\n        § 9 Text der Lizenz\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Diese Lizenz ist in deutscher und englischer Sprache abgefasst. Beide Fassungen sind gleich\n                     verbindlich. Es wird unterstellt, dass die in der Lizenz verwandten Begriffe in beiden\n                     Fassungen dieselbe Bedeutung haben. Ergeben sich dennoch Unterschiede, so ist die Bedeutung\n                     maßgeblich, welche die Fassungen unter Berücksichtigung des Ziels und Zwecks der Lizenz am\n                     besten miteinander in Einklang bringt.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Der Lizenzrat der Deutschen Freien Software Lizenz kann mit verbindlicher Wirkung neue Versionen\n                     der Lizenz in Kraft setzen, soweit dies erforderlich und zumutbar ist. Neue Versionen der\n                     Lizenz werden auf der Internetseite http://www.d-fsl.de mit einer eindeutigen Versionsnummer\n                     veröffentlicht. Die neue Version der Lizenz erlangt für Sie verbindliche Wirkung, wenn Sie von\n                     deren Veröffentlichung Kenntnis genommen haben. Gesetzliche Rechtsbehelfe gegen die Änderung\n                     der Lizenz werden durch die vorstehenden Bestimmungen nicht beschränkt.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    Sie dürfen diese Lizenz in unveränderter Form vervielfältigen, verbreiten und öffentlich\n                     zugänglich machen.\n        § 10 Anwendbares Recht\n            Auf diese Lizenz findet deutsches Recht Anwendung.\n            Anhang: Wie unterstellen Sie ein Programm der Deutschen Freien Software Lizenz?\n            Um jedermann den Abschluss dieser Lizenz zu ermöglichen, wird empfohlen, das Programm mit folgendem\n             Hinweis auf die Lizenz zu versehen:\n            \"Copyright (C) 20[jj] [Name des Rechtsinhabers].\n            Dieses Programm kann durch jedermann gemäß den Bestimmungen der Deutschen Freien Software Lizenz genutzt\n             werden.\n            Die Lizenz kann unter http://www.d-fsl.de abgerufen werden.\""}]