[{"type": "optional", "content": {"type": "text", "content": "Educational Community License\n        Version 2.0, April 2007"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "http://www.osedu.org/licenses/\n         The Educational Community License version 2.0 (\"ECL\") consists of the Apache 2.0 license,\n         modified to change the scope of the patent grant in section 3 to be specific to the needs of the\n         education communities using this license. The original Apache 2.0 license can be found at:\n         http://www.apache.org/licenses/LICENSE-2.0"}}, {"type": "text", "content": "\n      TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions.\n          \"License\" shall mean the terms and conditions for use, reproduction, and distribution\n             as defined by Sections 1 through 9 of this document.\n               \"Licensor\" shall mean the copyright owner or entity authorized by the copyright owner\n             that is granting the License.\n               \"Legal Entity\" shall mean the union of the acting entity and all other entities that\n             control, are controlled by, or are under common control with that entity. For the purposes of\n             this definition, \"control\" means (i) the power, direct or indirect, to cause the\n             direction or management of such entity, whether by contract or otherwise, or (ii) ownership of\n             fifty percent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such\n             entity.\n               \"You\" (or \"Your\") shall mean an individual or Legal Entity exercising\n             permissions granted by this License.\n               \"Source\" form shall mean the preferred form for making modifications, including but not\n             limited to software source code, documentation source, and configuration files.\n               \"Object\" form shall mean any form resulting from mechanical transformation or\n             translation of a Source form, including but not limited to compiled object code, generated\n             documentation, and conversions to other media types.\n               \"Work\" shall mean the work of authorship, whether in Source or Object form, made\n             available under the License, as indicated by a copyright notice that is included in or\n             attached to the work (an example is provided in the Appendix below).\n               \"Derivative Works\" shall mean any work, whether in Source or Object form, that is based\n             on (or derived from) the Work and for which the editorial revisions, annotations,\n             elaborations, or other modifications represent, as a whole, an original work of authorship.\n             For the purposes of this License, Derivative Works shall not include works that remain\n             separable from, or merely link (or bind by name) to the interfaces of, the Work and Derivative\n             Works thereof.\n               \"Contribution\" shall mean any work of authorship, including the original version of the\n             Work and any modifications or additions to that Work or Derivative Works thereof, that is\n             intentionally submitted to Licensor for inclusion in the Work by the copyright owner or by an\n             individual or Legal Entity authorized to submit on behalf of the copyright owner. For the\n             purposes of this definition, \"submitted\" means any form of electronic, verbal, or\n             written communication sent to the Licensor or its representatives, including but not limited\n             to communication on electronic mailing lists, source code control systems, and issue tracking\n             systems that are managed by, or on behalf of, the Licensor for the purpose of discussing and\n             improving the Work, but excluding communication that is conspicuously marked or otherwise\n             designated in writing by the copyright owner as \"Not a Contribution.\"\n               \"Contributor\" shall mean Licensor and any individual or Legal Entity on behalf of whom\n             a Contribution has been received by Licensor and subsequently incorporated within the\n             Work.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of Copyright License.\n          Subject to the terms and conditions of this License, each Contributor hereby grants to You a\n             perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to\n             reproduce, prepare Derivative Works of, publicly display, publicly perform, sublicense, and\n             distribute the Work and such Derivative Works in Source or Object form.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of Patent License.\n          Subject to the terms and conditions of this License, each Contributor hereby grants to You a\n             perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in\n             this section) patent license to make, have made, use, offer to sell, sell, import, and\n             otherwise transfer the Work, where such license applies only to those patent claims licensable\n             by such Contributor that are necessarily infringed by their Contribution(s) alone or by\n             combination of their Contribution(s) with the Work to which such Contribution(s) was\n             submitted. If You institute patent litigation against any entity (including a cross-claim or\n             counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the\n             Work constitutes direct or contributory patent infringement, then any patent licenses granted\n             to You under this License for that Work shall terminate as of the date such litigation is\n             filed. Any patent license granted hereby with respect to contributions by an individual\n             employed by an institution or organization is limited to patent claims where the individual\n             that is the author of the Work is also the inventor of the patent claims licensed, and where\n             the organization or institution has the right to grant such license under applicable grant and\n             research funding agreements. No other express or implied licenses are granted.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution.\n          You may reproduce and distribute copies of the Work or Derivative Works thereof in any medium,\n             with or without modifications, and in Source or Object form, provided that You meet the\n             following conditions:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            You must give any other recipients of the Work or Derivative Works a copy of this License; and\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            You must cause any modified files to carry prominent notices stating that You changed the files; and\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            You must retain, in the Source form of any Derivative Works that You distribute, all\n               copyright, patent, trademark, and attribution notices from the Source form of the Work,\n               excluding those notices that do not pertain to any part of the Derivative Works; and\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            If the Work includes a \"NOTICE\" text file as part of its distribution, then any\n               Derivative Works that You distribute must include a readable copy of the attribution\n               notices contained within such NOTICE file, excluding those notices that do not pertain to\n               any part of the Derivative Works, in at least one of the following places: within a NOTICE\n               text file distributed as part of the Derivative Works; within the Source form or\n               documentation, if provided along with the Derivative Works; or, within a display generated\n               by the Derivative Works, if and wherever such third-party notices normally appear. The\n               contents of the NOTICE file are for informational purposes only and do not modify the\n               License. You may add Your own attribution notices within Derivative Works that You\n               distribute, alongside or as an addendum to the NOTICE text from the Work, provided that\n               such additional attribution notices cannot be construed as modifying the License.\n            You may add Your own copyright statement to Your modifications and may provide additional or\n               different license terms and conditions for use, reproduction, or distribution of Your\n               modifications, or for any such Derivative Works as a whole, provided Your use,\n               reproduction, and distribution of the Work otherwise complies with the conditions stated\n               in this License.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Submission of Contributions.\n          Unless You explicitly state otherwise, any Contribution intentionally submitted for inclusion in\n             the Work by You to the Licensor shall be under the terms and conditions of this License,\n             without any additional terms or conditions. Notwithstanding the above, nothing herein shall\n             supersede or modify the terms of any separate license agreement you may have executed with\n             Licensor regarding such Contributions.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Trademarks.\n          This License does not grant permission to use the trade names, trademarks, service marks, or\n             product names of the Licensor, except as required for reasonable and customary use in\n             describing the origin of the Work and reproducing the content of the NOTICE file.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Disclaimer of Warranty.\n          Unless required by applicable law or agreed to in writing, Licensor provides the Work (and each\n             Contributor provides its Contributions) on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR\n             CONDITIONS OF ANY KIND, either express or implied, including, without limitation, any\n             warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n             PARTICULAR PURPOSE. You are solely responsible for determining the appropriateness of using or\n             redistributing the Work and assume any risks associated with Your exercise of permissions\n             under this License.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Limitation of Liability.\n          In no event and under no legal theory, whether in tort (including negligence), contract, or\n             otherwise, unless required by applicable law (such as deliberate and grossly negligent acts)\n             or agreed to in writing, shall any Contributor be liable to You for damages, including any\n             direct, indirect, special, incidental, or consequential damages of any character arising as a\n             result of this License or out of the use or inability to use the Work (including but not\n             limited to damages for loss of goodwill, work stoppage, computer failure or malfunction, or\n             any and all other commercial damages or losses), even if such Contributor has been advised of\n             the possibility of such damages.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Accepting Warranty or Additional Liability.\n      While redistributing the Work or Derivative Works thereof, You may choose to offer, and charge a fee for,\n         acceptance of support, warranty, indemnity, or other liability obligations and/or rights consistent\n         with this License. However, in accepting such obligations, You may act only on Your own behalf and on\n         Your sole responsibility, not on behalf of any other Contributor, and only if You agree to indemnify,\n         defend, and hold each Contributor harmless for any liability incurred by, or claims asserted against,\n         such Contributor by reason of your accepting any such warranty or additional liability.\n\n      "}, {"type": "optional", "content": [{"type": "text", "content": "END OF TERMS AND CONDITIONS\n         APPENDIX: How to apply the Educational Community License to your work\n         To apply the Educational Community License to your work, attach\n        the following boilerplate notice, with the fields enclosed by\n        brackets \"[]\" replaced with your own identifying information.\n        (Don't include the brackets!) The text should be enclosed in the\n        appropriate comment syntax for the file format. We also recommend\n        that a file or class name and description of purpose be included on\n        the same \"printed page\" as the copyright notice for easier\n        identification within third-party archives.\n      Copyright "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "[yyyy] [name of copyright owner]"}, "pattern": ".+"}, {"type": "text", "content": " Licensed under the\n        Educational Community License, Version 2.0 (the \"License\"); you may\n        not use this file except in compliance with the License. You may\n        obtain a copy of the License at\n         http://www.osedu.org/licenses/ECL-2.0\n         Unless required by applicable law or agreed to in writing,\n        software distributed under the License is distributed on an \"AS IS\"\n        BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express\n        or implied. See the License for the specific language governing\n        permissions and limitations under the License."}]}]