[{"type": "optional", "content": {"type": "text", "content": "The Educational Community License"}}, {"type": "text", "content": "\n      This Educational Community License (the \"License\") applies to any original work of authorship (the\n         \"Original Work\") whose owner (the \"Licensor\") has placed the following notice immediately following\n         the copyright notice for the Original Work:\n      Copyright (c)\n        "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "<year> <copyright holders>"}, "pattern": ".+"}, {"type": "text", "content": "\n      Licensed under the Educational Community License version 1.0\n      This Original Work, including software, source code, documents, or other related items, is being provided\n         by the copyright holder(s) subject to the terms of the Educational Community License. By obtaining,\n         using and/or copying this Original Work, you agree that you have read, understand, and will comply\n         with the following terms and conditions of the Educational Community License:\n      Permission to use, copy, modify, merge, publish, distribute, and sublicense this Original Work and its\n         documentation, with or without modification, for any purpose, and without fee or royalty to the\n         copyright holder(s) is hereby granted, provided that you include the following on ALL copies of the\n         Original Work or portions thereof, including modifications or derivatives, that you make:\n      The full text of the Educational Community License in a location viewable to users of the redistributed\n         or derivative work.\n      Any pre-existing intellectual property disclaimers, notices, or terms and conditions.\n      Notice of any changes or modifications to the Original Work, including the date the changes were made.\n      Any modifications of the Original Work must be distributed in such a manner as to avoid any confusion\n         with the Original Work of the copyright holders.\n      THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\n         LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN\n         NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,\n         WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\n         SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n      The name and trademarks of copyright holder(s) may NOT be used in advertising or publicity pertaining to\n         the Original or Derivative Works without specific, written prior permission. Title to copyright in the\n         Original Work and any associated documentation will at all times remain with the copyright\n         holders."}]