[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEGENIX.COM PUBLIC LICENSE AGREEMENT\nVersion 1.1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nThis license agreement is based on the Python CNRI License Agreement, a widely accepted open- source\nlicense.\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntroduction\nThis \"License Agreement\" is between eGenix.com Software, Skills and Services GmbH\n(\"eGenix.com\"), having an office at Pastor-Loeh-Str. 48, D-40764 Langenfeld, Germany,\nand the Individual or Organization (\"Licensee\") accessing and otherwise using this\nsoftware in source or binary form and its associated documentation (\"the Software\").\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense\nSubject to the terms and conditions of this eGenix.com Public License Agreement, eGenix.com\nhereby grants Licensee a non-exclusive, royalty-free, world-wide license to reproduce,\nanalyze, test, perform and/or display publicly, prepare derivative works, distribute,\nand otherwise use the Software alone or in any derivative version, provided, however,\nthat the eGenix.com Public License Agreement is retained in the Software, or in any\nderivative version of the Software prepared by Licensee.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNO WARRANTY\neGenix.com is making the Software available to Licensee on an \"AS IS\" basis. SUBJECT TO ANY\nSTATUTORY WARRANTIES WHICH CAN NOT BE EXCLUDED, EGENIX.COM MAKES NO REPRESENTATIONS OR\nWARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, EGENIX.COM\nMAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD\nPARTY RIGHTS.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY\nEGENIX.COM SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE SOFTWARE FOR ANY\nINCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS (INCLUDING, WITHOUT LIMITATION,\nDAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION, LOSS OF BUSINESS\nINFORMATION, OR OTHER PECUNIARY LOSS) AS A RESULT OF USING, MODIFYING OR DISTRIBUTING\nTHE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\nSOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR\nCONSEQUENTIAL DAMAGES, SO THE ABOVE EXCLUSION OR LIMITATION MAY NOT APPLY TO LICENSEE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\nThis License Agreement will automatically terminate upon a material breach of its terms and\nconditions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Rights\nAny software or documentation in source or binary form provided along with the Software\nthat is associated with a separate license agreement is licensed to Licensee under the\nterms of that license agreement. This License Agreement does not apply to those\nportions of the Software. Copies of the third party licenses are included in the\nSoftware Distribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral\nNothing in this License Agreement affects any statutory rights of consumers that cannot be\nwaived or limited by contract.\nNothing in this License Agreement shall be deemed to create any relationship of agency,\npartnership, or joint venture between eGenix.com and Licensee.\nIf any provision of this License Agreement shall be unlawful, void, or for any reason\nunenforceable, such provision shall be modified to the extent necessary to render it\nenforceable without losing its intent, or, if no such modification is possible, be severed\nfrom this License Agreement and shall not affect the validity and enforceability of the\nremaining provisions of this License Agreement.\nThis License Agreement shall be governed by and interpreted in all respects by the law of\nGermany, excluding conflict of law provisions. It shall not be governed by the United Nations\nConvention on Contracts for International Sale of Goods. This License Agreement does not grant\npermission to use eGenix.com trademarks or trade names in a trademark sense to endorse or\npromote products or services of Licensee, or any third party.\nThe controlling language of this License Agreement is English. If Licensee has received a\ntranslation into another language, it has been provided for Licensee's convenience only.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAgreement\nBy downloading, copying, installing or otherwise using the Software, Licensee agrees to be bound by the\nterms and conditions of this License Agreement. For question regarding this License Agreement, please\nwrite to:\neGenix.com Software, Skills and Services GmbH\nPastor-Loeh-Str. 48\nD-40764 Langenfeld\nGermany\n"}]