[{"type": "optional", "content": {"type": "text", "content": "Entessa Public License Version. 1.0"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 2003 Entessa, LLC. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided that\n       the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Redistributions of source code must retain the above copyright notice, this list of conditions and\n           the following disclaimer.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Redistributions in binary form must reproduce the above copyright notice, this list of conditions and\n           the following disclaimer in the documentation and/or other materials provided with the\n           distribution.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        The end-user documentation included with the redistribution, if any, must include the following\n           acknowledgment:\n        \"This product includes open source software developed by openSEAL (http://www.openseal.org/).\"\n            Alternately, this acknowledgment may appear in the software itself, if and wherever such third-party\n           acknowledgments normally appear.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        The names \"openSEAL\" and \"Entessa\" must not be used to endorse or promote products derived from this\n           software without prior written permission. For written permission, please contact\n           epl@entessa.com.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Products derived from this software may not be called \"openSEAL\", nor may \"openSEAL\" appear in their\n           name, without prior written permission of Entessa.\n      THIS SOFTWARE IS PROVIDED ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\n       THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\n       SHALL ENTESSA, LLC, OPENSEAL OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n       EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n       SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n       LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN\n       ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n      This software consists of voluntary contributions made by many individuals on behalf of openSEAL and was\n       originally based on software contributed by Entessa, LLC, http://www.entessa.com. For more information on\n       the openSEAL, please see <http://www.openseal.org/>."}]