[{"tag": "text", "content": "\nEPICS Open License Terms\nThe following is the text of the EPICS Open software license agreement which now\napplies to EPICS Base and many of the unbundled EPICS extensions and support modules.\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nCopyright © <YEAR> <HOLDERS>. All rights reserved.\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n<PRODUCT> is distributed subject to the following license conditions:\nSOFTWARE LICENSE AGREEMENT\nSoftware: <PRODUCT>\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe \"Software\", below, refers to <PRODUCT> (in either source code, or binary form\nand accompanying documentation). Each licensee is addressed as \"you\" or \"Licensee.\"\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe copyright holders shown above and their third-party licensors hereby grant Licensee a\nroyalty-free nonexclusive license, subject to the limitations stated herein and U.S.\nGovernment license rights.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may modify and make a copy or copies of the Software for use within your\norganization, if you meet the following conditions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopies in source code must include the copyright notice and this Software License\nAgreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopies in binary form must include the copyright notice and this Software License\nAgreement in the documentation and/or other materials provided with the copy.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may modify a copy or copies of the Software or any portion of it, thus forming a work\nbased on the Software, and distribute copies of such work outside your organization, if you\nmeet all of the following conditions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopies in source code must include the copyright notice and this Software License\nAgreement;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopies in binary form must include the copyright notice and this Software License\nAgreement in the documentation and/or other materials provided with the copy;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nModified copies and works based on the Software must carry prominent notices stating\nthat you changed specified portions of the Software.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPortions of the Software resulted from work developed under a U.S. Government contract\nand are subject to the following license: the Government is granted for itself and others\nacting on its behalf a paid-up, nonexclusive, irrevocable worldwide license in this computer\nsoftware to reproduce, prepare derivative works, and perform publicly and display publicly.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWARRANTY DISCLAIMER. THE SOFTWARE IS SUPPLIED \"AS IS\" WITHOUT WARRANTY OF\nANY KIND. THE COPYRIGHT HOLDERS, THEIR THIRD PARTY LICENSORS, THE UNITED\nSTATES, THE UNITED STATES DEPARTMENT OF ENERGY, AND THEIR EMPLOYEES:\n(1) DISCLAIM ANY WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO\nANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\nTITLE OR NON-INFRINGEMENT, (2) DO NOT ASSUME ANY LEGAL LIABILITY OR\nRESPONSIBILITY FOR THE ACCURACY, COMPLETENESS, OR USEFULNESS OF THE\nSOFTWARE, (3) DO NOT REPTHAT USE OF THE SOFTWARE WOULD NOT INFRINGE\nPRIVATELY OWNED RIGHTS, (4) DO NOT WARRANT THAT THE SOFTWARE WILL FUNCTION\nUNINTERRUPTED, THAT IT IS ERROR-FREE OR THAT ANY ERRORS WILL BE CORRECTED.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY. IN NO EVENT WILL THE COPYRIGHT HOLDERS, THEIR THIRD\nPARTY LICENSORS, THE UNITED STATES, THE UNITED STATES DEPARTMENT OF ENERGY,\nOR THEIR EMPLOYEES: BE LIABLE FOR ANY INDIRECT, INCIDENTAL, CONSEQUENTIAL,\nSPECIAL OR PUNITIVE DAMAGES OF ANY KIND OR NATURE, INCLUDING BUT NOT LIMITED\nTO LOSS OF PROFITS OR LOSS OF DATA, FOR ANY REASON WHATSOEVER, WHETHER\nSUCH LIABILITY IS ASSERTED ON THE BASIS OF CONTRACT, TORT (INCLUDING\nNEGLIGENCE OR STRICT LIABILITY), OR OTHERWISE, EVEN IF ANY OF SAID PARTIES HAS\nBEEN WARNED OF THE POSSIBILITY OF SUCH LOSS OR DAMAGES.\n"}]