[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEclipse Public License - v 1.0\n"}]}, {"tag": "text", "content": "\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE PUBLIC LICENSE\n(\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES\nRECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDEFINITIONS\n\"Contribution\" means:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nin the case of the initial Contributor, the initial code and documentation distributed under\nthis Agreement, and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nin the case of each subsequent Contributor:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nchanges to the Program, and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nadditions to the Program;\nwhere such changes and/or additions to the Program originate from and are distributed by\nthat particular Contributor. A Contribution 'originates' from a Contributor\nif it was added to the Program by such Contributor itself or anyone acting on such\nContributor's behalf. Contributions do not include additions to the Program\nwhich: (i) are separate modules of software distributed in conjunction with the\nProgram under their own license agreement, and (ii) are not derivative works of the\nProgram.\n\"Contributor\" means any person or entity that distributes the Program.\n\"Licensed Patents\" mean patent claims licensable by a Contributor which are\nnecessarily infringed by the use or sale of its Contribution alone or when combined\nwith the Program.\n\"Program\" means the Contributions distributed in accordance with this Agreement.\n\"Recipient\" means anyone who receives the Program under this Agreement,\nincluding all Contributors.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGRANT OF RIGHTS\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the terms of this Agreement, each Contributor hereby grants Recipient a\nnon-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative\nworks of, publicly display, publicly perform, distribute and sublicense the Contribution\nof such Contributor, if any, and such derivative works, in source code and object code\nform.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to the terms of this Agreement, each Contributor hereby grants Recipient a\nnon-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use,\nsell, offer to sell, import and otherwise transfer the Contribution of such Contributor,\nif any, in source code and object code form. This patent license shall apply to the\ncombination of the Contribution and the Program if, at the time the Contribution is added\nby the Contributor, such addition of the Contribution causes such combination to be\ncovered by the Licensed Patents. The patent license shall not apply to any other\ncombinations which include the Contribution. No hardware per se is licensed hereunder.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRecipient understands that although each Contributor grants the licenses to its Contributions\nset forth herein, no assurances are provided by any Contributor that the Program does not\ninfringe the patent or other intellectual property rights of any other entity. Each\nContributor disclaims any liability to Recipient for claims brought by any other entity\nbased on infringement of intellectual property rights or otherwise. As a condition to\nexercising the rights and licenses granted hereunder, each Recipient hereby assumes sole\nresponsibility to secure any other intellectual property rights needed, if any. For\nexample, if a third party patent license is required to allow Recipient to distribute the\nProgram, it is Recipient's responsibility to acquire that license before distributing\nthe Program.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEach Contributor represents that to its knowledge it has sufficient copyright rights in its\nContribution, if any, to grant the copyright license set forth in this Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nREQUIREMENTS\nA Contributor may choose to distribute the Program in object code form under its own\nlicense agreement, provided that:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nit complies with the terms and conditions of this Agreement; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nits license agreement:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\neffectively disclaims on behalf of all Contributors all warranties and conditions,\nexpress and implied, including warranties or conditions of title and non-infringement,\nand implied warranties or conditions of merchantability and fitness for a particular\npurpose;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\neffectively excludes on behalf of all Contributors all liability for damages, including\ndirect, indirect, special, incidental and consequential damages, such as lost\nprofits;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "iii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nstates that any provisions which differ from this Agreement are offered by that\nContributor alone and not by any other party; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "iv)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nstates that source code for the Program is available from such Contributor, and informs\nlicensees how to obtain it in a reasonable manner on or through a medium customarily\nused for software exchange.\nWhen the Program is made available in source code form:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nit must be made available under this Agreement; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\na copy of this Agreement must be included with each copy of the Program.\nContributors may not remove or alter any copyright notices contained within the Program.\nEach Contributor must identify itself as the originator of its Contribution, if any, in a\nmanner that reasonably allows subsequent Recipients to identify the originator of the\nContribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOMMERCIAL DISTRIBUTION\nCommercial distributors of software may accept certain responsibilities with respect to end\nusers, business partners and the like. While this license is intended to facilitate\nthe commercial use of the Program, the Contributor who includes the Program in a\ncommercial product offering should do so in a manner which does not create potential\nliability for other Contributors. Therefore, if a Contributor includes the Program in\na commercial product offering, such Contributor (\"Commercial Contributor\")\nhereby agrees to defend and indemnify every other Contributor (\"Indemnified\nContributor\") against any losses, damages and costs (collectively\n\"Losses\") arising from claims, lawsuits and other legal actions brought by a\nthird party against the Indemnified Contributor to the extent caused by the acts or\nomissions of such Commercial Contributor in connection with its distribution of the\nProgram in a commercial product offering. The obligations in this section do not apply\nto any claims or Losses relating to any actual or alleged intellectual property\ninfringement. In order to qualify, an Indemnified Contributor must: a) promptly notify\nthe Commercial Contributor in writing of such claim, and b) allow the Commercial\nContributor to control, and cooperate with the Commercial Contributor in, the defense\nand any related settlement negotiations. The Indemnified Contributor may participate\nin any such claim at its own expense.\nFor example, a Contributor might include the Program in a commercial product offering, Product X.\nThat Contributor is then a Commercial Contributor. If that Commercial Contributor then makes\nperformance claims, or offers warranties related to Product X, those performance claims and\nwarranties are such Commercial Contributor's responsibility alone. Under this section,\nthe Commercial Contributor would have to defend claims against the other Contributors related\nto those performance claims and warranties, and if a court requires any other Contributor to\npay any damages as a result, the Commercial Contributor must pay those damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNO WARRANTY\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS\nIS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR\nIMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE,\nNON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. Each Recipient\nis solely responsible for determining the appropriateness of using and distributing\nthe Program and assumes all risks associated with its exercise of rights under this\nAgreement, including but not limited to the risks and costs of program errors,\ncompliance with applicable laws, damage to or loss of data, programs or equipment, and\nunavailability or interruption of operations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISCLAIMER OF LIABILITY\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS\nSHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE\nPROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGENERAL\nIf any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect\nthe validity or enforceability of the remainder of the terms of this Agreement, and without further\naction by the parties hereto, such provision shall be reformed to the minimum extent necessary to make\nsuch provision valid and enforceable.\nIf Recipient institutes patent litigation against any entity (including a cross-claim or counterclaim in\na lawsuit) alleging that the Program itself (excluding combinations of the Program with other software\nor hardware) infringes such Recipient's patent(s), then such Recipient's rights granted\nunder Section 2(b) shall terminate as of the date such litigation is filed.\nAll Recipient's rights under this Agreement shall terminate if it fails to comply with any of the\nmaterial terms or conditions of this Agreement and does not cure such failure in a reasonable period\nof time after becoming aware of such noncompliance. If all Recipient's rights under this\nAgreement terminate, Recipient agrees to cease use and distribution of the Program as soon as\nreasonably practicable. However, Recipient's obligations under this Agreement and any licenses\ngranted by Recipient relating to the Program shall continue and survive.\nEveryone is permitted to copy and distribute copies of this Agreement, but in order to avoid\ninconsistency the Agreement is copyrighted and may only be modified in the following manner. The\nAgreement Steward reserves the right to publish new versions (including revisions) of this Agreement\nfrom time to time. No one other than the Agreement Steward has the right to modify this Agreement. The\nEclipse Foundation is the initial Agreement Steward. The Eclipse Foundation may assign the\nresponsibility to serve as the Agreement Steward to a suitable separate entity. Each new version of\nthe Agreement will be given a distinguishing version number. The Program (including Contributions) may\nalways be distributed subject to the version of the Agreement under which it was received. In\naddition, after a new version of the Agreement is published, Contributor may elect to distribute the\nProgram (including its Contributions) under the new version. Except as expressly stated in Sections\n2(a) and 2(b) above, Recipient receives no rights or licenses to the intellectual property of any\nContributor under this Agreement, whether expressly, by implication, estoppel or otherwise. All rights\nin the Program not expressly granted under this Agreement are reserved.\nThis Agreement is governed by the laws of the State of New York and the intellectual property laws of the\nUnited States of America. No party to this Agreement will bring a legal action under this Agreement\nmore than one year after the cause of action arose. Each party waives its rights to a jury trial in\nany resulting litigation.\n"}]