[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEuropean Union Public Licence V.1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nEUPL (c) the European Community 2007\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nThis European Union Public Licence (the “EUPL”) applies to the Work or Software (as defined below) which\nis provided under the terms of this Licence. Any use of the Work, other than as authorised under this\nLicence is prohibited (to the extent such use is covered by a right of the copyright holder of the\nWork).\nThe Original Work is provided under the terms of this Licence when the Licensor (as defined below) has\nplaced the following notice immediately following the copyright notice for the Original Work:\nLicensed under the EUPL V.1.0\nor has expressed by any other mean his willingness to license under the EUPL.\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions\nIn this Licence, the following terms have the following meaning:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Licence: this Licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Original Work or the Software: the software distributed and/or communicated by the Licensor\nunder this Licence, available as Source Code and also as Executable Code as the case may\nbe.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDerivative Works: the works or software that could be created by the Licensee, based upon the\nOriginal Work or modifications thereof. This Licence does not define the extent of\nmodification or dependence on the Original Work required in order to classify a work as a\nDerivative Work; this extent is determined by copyright law applicable in the country\nmentioned in Article 15.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Work: the Original Work and/or its Derivative Works.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Source Code: the human-readable form of the Work which is the most convenient for people to\nstudy and modify.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Executable Code: any code which has generally been compiled and which is meant to be\ninterpreted by a computer as a program.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Licensor: the natural or legal person that distributes and/or communicates the Work under\nthe Licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor(s): any natural or legal person who modifies the Work under the Licence, or\notherwise contributes to the creation of a Derivative Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Licensee or “You”: any natural or legal person who makes any usage of the Software under\nthe terms of the Licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution and/or Communication: any act of selling, giving, lending, renting, distributing,\ncommunicating, transmitting, or otherwise making available, on-line or off-line, copies of\nthe Work at the disposal of any other natural or legal person.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nScope of the rights granted by the Licence\nThe Licensor hereby grants You a world-wide, royalty-free, non-exclusive, sub-licensable licence\nto do the following, for the duration of copyright vested in the Original Work:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse the Work in any circumstance and for all usage,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nreproduce the Work,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nmodify the Original Work, and make Derivative Works based upon the Work,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ncommunicate to the public, including the right to make available or display the Work or copies\nthereof to the public and perform publicly, as the case may be, the Work,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ndistribute the Work or copies thereof,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nlend and rent the Work or copies thereof,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsub-license rights in the Work or copies thereof.\nThose rights can be exercised on any media, supports and formats, whether now known or later\ninvented, as far as the applicable law permits so.\nIn the countries where moral rights apply, the Licensor waives his right to exercise his moral\nright to the extent allowed by law in order to make effective the licence of the economic\nrights here above listed.\nThe Licensor grants to the Licensee royalty-free, non exclusive usage rights to any patents held\nby the Licensor, to the extent necessary to make use of the rights granted on the Work under\nthis Licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCommunication of the Source Code\nThe Licensor may provide the Work either in its Source Code form, or as Executable Code. If the\nWork is provided as Executable Code, the Licensor provides in addition a machinereadable copy\nof the Source Code of the Work along with each copy of the Work that the Licensor distributes\nor indicates, in a notice following the copyright notice attached to the Work, a repository\nwhere the Source Code is easily and freely accessible for as long as the Licensor continues to\ndistribute and/or communicate the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitations on copyright\nNothing in this Licence is intended to deprive the Licensee of the benefits from any exception or\nlimitation to the exclusive rights of the rights owners in the Original Work or Software, of\nthe exhaustion of those rights or of other applicable limitations thereto.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nObligations of the Licensee\nThe grant of the rights mentioned above is subject to some restrictions and obligations imposed\non the Licensee. Those obligations are the following:\nAttribution right: the Licensee shall keep intact all copyright, patent or trademarks notices and\nall notices that refer to the Licence and to the disclaimer of warranties. The Licensee must\ninclude a copy of such notices and a copy of the Licence with every copy of the Work he/she\ndistributes and/or communicates. The Licensee must cause any Derivative Work to carry\nprominent notices stating that the Work has been modified and the date of modification.\nCopyleft clause: If the Licensee distributes and/or communicates copies of the Original Works or\nDerivative Works based upon the Original Work, this Distribution and/or Communication will be\ndone under the terms of this Licence. The Licensee (becoming Licensor) cannot offer or impose\nany additional terms or conditions on the Work or Derivative Work that alter or restrict the\nterms of the Licence.\nCompatibility clause: If the Licensee Distributes and/or Communicates Derivative Works or copies\nthereof based upon both the Original Work and another work licensed under a Compatible\nLicence, this Distribution and/or Communication can be done under the terms of this Compatible\nLicence. For the sake of this clause, “Compatible Licence” refers to the licences listed in\nthe appendix attached to this Licence. Should the Licensee’s obligations under the Compatible\nLicence conflict with his/her obligations under this Licence, the obligations of the\nCompatible Licence shall prevail.\nProvision of Source Code: When distributing and/or communicating copies of the Work, the Licensee\nwill provide a machine-readable copy of the Source Code or indicate a repository where this\nSource will be easily and freely available for as long as the Licensee continues to distribute\nand/or communicate the Work.\nLegal Protection: This Licence does not grant permission to use the trade names, trademarks,\nservice marks, or names of the Licensor, except as required for reasonable and customary use\nin describing the origin of the Work and reproducing the content of the copyright notice.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nChain of Authorship\nThe original Licensor warrants that the copyright in the Original Work granted hereunder is owned\nby him/her or licensed to him/her and that he/she has the power and authority to grant the\nLicence.\nEach Contributor warrants that the copyright in the modifications he/she brings to the Work are\nowned by him/her or licensed to him/her and that he/she has the power and authority to grant\nthe Licence.\nEach time You, as a Licensee, receive the Work, the original Licensor and subsequent Contributors\ngrant You a licence to their contributions to the Work, under the terms of this Licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty\nThe Work is a work in progress, which is continuously improved by numerous contributors. It is\nnot a finished work and may therefore contain defects or “bugs” inherent to this type of\nsoftware development.\nFor the above reason, the Work is provided under the Licence on an “as is” basis and without\nwarranties of any kind concerning the Work, including without limitation merchantability,\nfitness for a particular purpose, absence of defects or errors, accuracy, non-infringement of\nintellectual property rights other than copyright as stated in Article 6 of this Licence.\nThis disclaimer of warranty is an essential part of the Licence and a condition for the grant of\nany rights to the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Liability\nExcept in the cases of wilful misconduct or damages directly caused to natural persons, the\nLicensor will in no event be liable for any direct or indirect, material or moral, damages of\nany kind, arising out of the Licence or of the use of the Work, including without limitation,\ndamages for loss of goodwill, work stoppage, computer failure or malfunction, loss of data or\nany commercial damage, even if the Licensor has been advised of the possibility of such\ndamage. However, the Licensor will be liable under statutory product liability laws as far\nsuch laws apply to the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdditional agreements\nWhile distributing the Original Work or Derivative Works, You may choose to conclude an\nadditional agreement to offer, and charge a fee for, acceptance of support, warranty,\nindemnity, or other liability obligations and/or services consistent with this Licence.\nHowever, in accepting such obligations, You may act only on your own behalf and on your sole\nresponsibility, not on behalf of the original Licensor or any other Contributor, and only if\nYou agree to indemnify, defend, and hold each Contributor harmless for any liability incurred\nby, or claims asserted against such Contributor by the fact You have accepted any such\nwarranty or additional liability.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAcceptance of the Licence\nThe provisions of this Licence can be accepted by clicking on an icon “I agree” placed under the\nbottom of a window displaying the text of this Licence or by affirming consent in any other\nsimilar way, in accordance with the rules of applicable law. Clicking on that icon indicates\nyour clear and irrevocable acceptance of this Licence and all of its terms and conditions.\nSimilarly, you irrevocably accept this Licence and all of its terms and conditions by exercising\nany rights granted to You by Article 2 of this Licence, such as the use of the Work, the\ncreation by You of a Derivative Work or the Distribution and/or Communication by You of the\nWork or copies thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInformation to the public\nIn case of any Distribution and/or Communication of the Work by means of electronic communication\nby You (for example, by offering to download the Work from a remote location) the distribution\nchannel or media (for example, a website) must at least provide to the public the information\nrequested by the applicable law regarding the identification and address of the Licensor, the\nLicence and the way it may be accessible, concluded, stored and reproduced by the\nLicensee.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination of the Licence\nThe Licence and the rights granted hereunder will terminate automatically upon any breach by the\nLicensee of the terms of the Licence.\nSuch a termination will not terminate the licences of any person who has received the Work from\nthe Licensee under the Licence, provided such persons remain in full compliance with the\nLicence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous\nWithout prejudice of Article 9 above, the Licence represents the complete agreement between the\nParties as to the Work licensed hereunder.\nIf any provision of the Licence is invalid or unenforceable under applicable law, this will not\naffect the validity or enforceability of the Licence as a whole. Such provision will be\nconstrued and/or reformed so as necessary to make it valid and enforceable.\nThe European Commission may put into force translations and/or binding new versions of this\nLicence, so far this is required and reasonable. New versions of the Licence will be published\nwith a unique version number. The new version of the Licence becomes binding for You as soon\nas You become aware of its publication.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nJurisdiction\nAny litigation resulting from the interpretation of this License, arising between the European\nCommission, as a Licensor, and any Licensee, will be subject to the jurisdiction of the Court\nof Justice of the European Communities, as laid down in article 238 of the Treaty establishing\nthe European Community.\nAny litigation arising between Parties, other than the European Commission, and resulting from\nthe interpretation of this License, will be subject to the exclusive jurisdiction of the\ncompetent court where the Licensor resides or conducts its primary business.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "15."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplicable Law\nThis Licence shall be governed by the law of the European Union country where the Licensor resides or has\nhis registered office.\nThis licence shall be governed by the Belgian law if:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\na litigation arises between the European Commission, as a Licensor, and any Licensee;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe Licensor, other than the European Commission, has no residence or registered office inside a\nEuropean Union country.\nAppendix\n“Compatible Licences” according to article 5 EUPL are:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral Public License (GPL) v. 2\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOpen Software License (OSL) v. 2.1, v. 3.0\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCommon Public License v. 1.0\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEclipse Public License v. 1.0\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "−"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCecill v. 2.0\n"}]