[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nTHE FRAMEWORX OPEN LICENSE 1.0\n"}]}, {"tag": "text", "content": "\nThis License Agreement, The Frameworx Open License 1.0, has been entered into between The Frameworx\nCompany and you, the licensee hereunder, effective as of Your acceptance of the Frameworx Code Base or\nan Downstream Distribution (each as defined below).\nAGREEMENT BACKGROUND\nThe Frameworx Company is committed to the belief that open source software results in better\nquality, greater technical and product innovation in the market place and a more empowered and\nproductive developer and end-user community. Our objective is to ensure that the Frameworx\nCode Base, and the source code for improvements and innovations to it, remain free and open to\nthe community.To further these beliefs and objectives, we are distributing the Frameworx Code\nBase, without royalties and in source code form, to the community pursuant to this License\nAgreement.\nAGREEMENT TERMS\nThe Frameworx Company and You have agreed as follows:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.The following terms have the following respective meanings:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFrameworx Code Base means the software developed by The Frameworx Company and made available\nunder this License Agreement\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDownstream Distribution means any direct or indirect release, distribution or remote\navailability of software (i) that directly or indirectly contains, or depends for its\nintended functioning on, the Frameworx Code Base or any portion or element thereof and\n(ii) in which rights to use and distribute such Frameworx Code Base software depend,\ndirectly or indirectly, on the License provided in Section 2 below.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" to any software means the preferred form for making modifications to\nthat software, including any associated documentation, interface definition files and\ncompilation or installation scripts, or any version thereof that has been compressed or\narchived, and can be reconstituted, using an appropriate and generally available archival\nor compression technology.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nValue-Added Services means any commercial or fee-based software-related service, including\nwithout limitation: system or application development or consulting; technical or end-user\nsupport or training; distribution maintenance, configuration or versioning; or outsourced,\nhosted or network-based application services.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Grant. Subject to the terms and conditions hereof, The Frameworx Company hereby grants\nYou a non-exclusive license (the License), subject to third party intellectual property\nclaims, and for no fee other than a nominal charge reflecting the costs of physical\ndistribution, to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse the Frameworx Code Base, in either Source Code or machine-readable form;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nmake modifications, additions and deletions to the content or structure of the Frameworx Code\nBase; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ncreate larger works or derivative works including the Frameworx Code Base or any portion or\nelement thereof; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nrelease, distribute or make available, either generally or to any specific third-party, any\nof the foregoing in Source Code or binary form.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Conditions. The grant of the License under Section 1 hereof, and your exercise of all\nrights in connection with this License Agreement, will remain subject to the following terms\nand conditions, as well as to the other provisions hereof:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nComplete Source Code for any Downstream Distribution directly or indirectly made by You that\ncontains, or depends for its intended functionality on, the Frameworx Code Base, or any\nportion or element thereof, shall be made freely available to all users thereof on terms\nand conditions no more restrictive, and no less favorable for any user (including, without\nlimitation, with regard to Source Code availability and royalty-free use) than those terms\nand conditions provided in this License Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny Value-Added Services that you offer or provide, directly or indirectly, in relation to\nany Downstream Distribution shall be offered and provided on commercial terms that are\nreasonably commensurate to the fair market value of such Value-Added Services. In\naddition, the terms and conditions on which any such Value Added Services are so offered\nor provided shall be consistent with, and shall fully support, the intent and purpose of\nthis License Agreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAll Downstream Distributions shall:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(i)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninclude all portions and elements of the Frameworx Code Base required to build the Source\nCode of such Downstream Distribution into a fully functional machine-executable\nsystem, or additional build scripts or comparable software necessary and sufficient\nfor such purposes;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(ii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninclude, in each file containing any portion or element of the Frameworx Code Base, the\nfollowing identifying legend: This file contains software that has been made available\nunder The Frameworx Open License 1.0. Use and distribution hereof are subject to the\nrestrictions set forth therein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(iii)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninclude all other copyright notices, authorship credits, warranty disclaimers (including\nthat provided in Section 6 below), legends, documentation, annotations and comments\ncontained in the Frameworx Code Base as provided to You hereunder;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(iv)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ncontain an unaltered copy of the html file named frameworx_community_invitation.html\nincluded within the Frameworx Code Base that acknowledges new users and provides them\nwith information on the Frameworx Code Base community;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(v)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ncontain an unaltered copy of the text file named the_frameworx_license.txt included\nwithin the Frameworx Code Base that includes a text copy of the form of this License\nAgreement; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(vi)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nprominently display to any viewer or user of the Source Code of such Open Downstream\nDistribution, in the place and manner normally used for such displays, the following\nlegend:\nSource code licensed under from The Frameworx Company is contained herein, and such\nsource code has been obtained either under The Frameworx Open License, or another\nlicense granted by The Frameworx Company. Use and distribution hereof is subject to\nthe restrictions provided in the relevant such license and to the copyrights of the\nlicensor thereunder. A copy of The Frameworx Open License is provided in a file named\nthe_frameworx_license.txt and included herein, and may also be available for\ninspection at http://www.frameworx.com.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRestrictions on Open Downstream Distributions. Each Downstream Distribution made by You, and by\nany party directly or indirectly obtaining rights to the Frameworx Code Base through You,\nshall be made subject to a license grant or agreement to the extent necessary so that each\ndistributee under that Downstream Distribution will be subject to the same restrictions on\nre-distribution and use as are binding on You hereunder. You may satisfy this licensing\nrequirement either by:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nrequiring as a condition to any Downstream Distribution made by you, or by any direct or\nindirect distributee of Your Downstream Distribution (or any portion or element thereof),\nthat each distributee under the relevant Downstream Distribution obtain a direct license\n(on the same terms and conditions as those in this License Agreement) from The Frameworx\nCompany; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsub-licensing all (and not less than all) of Your rights and obligations hereunder to that\ndistributee, including (without limitation) Your obligation to require distributees to be\nbound by license restrictions as contemplated by this Section 4 above.\nThe Frameworx Company hereby grants to you all rights to sub-license your rights hereunder as\nnecessary to fully effect the intent and purpose of this Section 4 above, provided,\nhowever, that your rights and obligations hereunder shall be unaffected by any such\nsublicensing. In addition, The Frameworx Company expressly retains all rights to take all\nappropriate action (including legal action) against any such direct or indirect\nsub-licensee to ensure its full compliance with the intent and purposes of this License\nAgreement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property. Except as expressly provided herein, this License Agreement preserves and\nrespects Your and The Frameworx Companys respective intellectual property rights, including,\nin the case of The Frameworx Company, its copyrights and patent rights relating to the\nFrameworx Code Base.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWarranty Disclaimer. THE SOFTWARE LICENSED HEREUNDER IS PROVIDED ``AS IS.'' ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT, ARE HEREBY\nDISCLAIMED. IN NO EVENT SHALL THE LICENSOR OF THIS SOFTWARE, BE LIABLE FOR ANY DIRECT,\nINDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES INCLUDING (BUT NOT LIMITED\nTO) PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\nLIABILITY OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Violation. The License, and all of your rights thereunder, shall be deemed automatically\nterminated and void as of any Downstream Distribution directly or indirectly made or\nfacilitated by You that violates the provisions of this License Agreement, provided, however,\nthat this License Agreement shall survive any such termination in order to remedy the effects\nof such violation. This License Agreement shall be binding on the legal successors and assigns\nof the parties hereto.\nYour agreement to the foregoing as of the date hereof has been evidenced by your acceptance of\nthe relevant software distribution hereunder.\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "(C) THE FRAMEWORX COMPANY 2003"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n"}]