[{"type": "optional", "content": {"type": "text", "content": "The FreeType Project LICENSE\n         2006-Jan-27"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": [{"type": "text", "content": "Copyright 1996-2002, 2006 by David Turner, Robert Wilhelm, and Werner Lemberg\n         Introduction\n         The FreeType Project is distributed in several archive packages; some of them may contain, in addition to\n         the FreeType font engine, various tools and contributions which rely on, or relate to, the FreeType\n         Project.\n         This license applies to all files found in such packages, and which do not fall under their own explicit\n         license. The license affects thus the FreeType font engine, the test programs, documentation and\n         makefiles, at the very least.\n         This license was inspired by the BSD, Artistic, and IJG (Independent JPEG Group) licenses, which all\n         encourage inclusion and use of free software in commercial and freeware products alike. As a\n         consequence, its main points are that:\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          We don't promise that this software works. However, we will be interested in any kind of bug reports.\n             (`as is' distribution)\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You can use this software for whatever you want, in parts or full form, without having to pay us.\n             (`royalty-free' usage)\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may not pretend that you wrote this software. If you use it, or only parts of it, in a program, you\n             must acknowledge somewhere in your documentation that you have used the FreeType code. (`credits')\n         We specifically permit and encourage the inclusion of this software, with or without modifications, in\n         commercial products. We disclaim all warranties covering The FreeType Project and assume no liability\n         related to The FreeType Project.\n         Finally, many people asked us for a preferred form for a credit/disclaimer to use in compliance with this\n         license. We thus encourage you to use the following text:\n         \"\"\" Portions of this software are copyright © <year> The FreeType Project (www.freetype.org). All\n         rights reserved. \"\"\"\n         Please replace <year> with the value from the FreeType version you actually use."}]}, {"type": "text", "content": "\n\n      Legal Terms\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions\n          Throughout this license, the terms `package', `FreeType Project', and `FreeType archive' refer to\n             the set of files originally distributed by the authors (David Turner, Robert Wilhelm, and\n             Werner Lemberg) as the `FreeType Project', be they named as alpha, beta or final release.\n            `You' refers to the licensee, or person using the project, where `using' is a generic term\n             including compiling the project's source code as well as linking it to form a `program' or\n             `executable'. This program is referred to as `a program using the FreeType engine'.\n            This license applies to all files distributed in the original FreeType Project, including all\n             source code, binaries and documentation, unless otherwise stated in the file in its original,\n             unmodified form as distributed in the original archive. If you are unsure whether or not a\n             particular file is covered by this license, you must contact us to verify this.\n            The FreeType Project is copyright (C) 1996-2000 by David Turner, Robert Wilhelm, and Werner\n             Lemberg. All rights reserved except as specified below.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Warranty\n          THE FREETYPE PROJECT IS PROVIDED `AS IS' WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED,\n             INCLUDING, BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n             PURPOSE. IN NO EVENT WILL ANY OF THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY DAMAGES\n             CAUSED BY THE USE OR THE INABILITY TO USE, OF THE FREETYPE PROJECT.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution\n          This license grants a worldwide, royalty-free, perpetual and irrevocable right and license to\n             use, execute, perform, compile, display, copy, create derivative works of, distribute and\n             sublicense the FreeType Project (in both source and object code forms) and derivative works\n             thereof for any purpose; and to authorize others to exercise some or all of the rights granted\n             herein, subject to the following conditions:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Redistribution of source code must retain this license file (`FTL.TXT') unaltered; any\n                 additions, deletions or changes to the original files must be clearly indicated in\n                 accompanying documentation. The copyright notices of the unaltered, original files must be\n                 preserved in all copies of source files.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Redistribution in binary form must provide a disclaimer that states that the software is based\n                 in part of the work of the FreeType Team, in the distribution documentation. We also encourage\n                 you to put an URL to the FreeType web page in your documentation, though this isn't\n                 mandatory.\n            These conditions apply to any software derived from or based on the FreeType Project, not just\n             the unmodified files. If you use our work, you must acknowledge us. However, no fee need be\n             paid to us.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Advertising\n          Neither the FreeType authors and contributors nor you shall use the name of the other for\n             commercial, advertising, or promotional purposes without specific prior written\n             permission.\n            We suggest, but do not require, that you use one or more of the following phrases to refer to\n             this software in your documentation or advertising materials: `FreeType Project', `FreeType\n             Engine', `FreeType library', or `FreeType Distribution'.\n            As you have not signed this license, you are not required to accept it. However, as the FreeType\n             Project is copyrighted material, only this license, or another one contracted with the\n             authors, grants you the right to use, distribute, and modify it. Therefore, by using,\n             distributing, or modifying the FreeType Project, you indicate that you understand and accept\n             all the terms of this license.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Contacts\n          There are two mailing lists related to FreeType:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              freetype@nongnu.org\n              Discusses general use and applications of FreeType, as well as future and wanted additions to the library\n                 and distribution. If you are looking for support, start in this list if you haven't found anything to\n                 help you in the documentation.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "o"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              freetype-devel@nongnu.org\n              Discusses bugs, as well as engine internals, design issues, specific licenses, porting, etc.\n            Our home page can be found at\n            http://www.freetype.org\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "--- end of FTL.TXT ---"}}]