[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nGNU Free Documentation License\nVersion 1.2, November 2002\n"}]}, {"tag": "text", "content": "\nCopyright (C) 2000,2001,2002 Free Software Foundation,\nInc. 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA\nEveryone is permitted to copy and distribute verbatim copies\nof this license document, but changing it is not allowed.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "0."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPREAMBLE\nThe purpose of this License is to make a manual, textbook, or\nother functional and useful document \"free\" in the sense of\nfreedom: to assure everyone the effective freedom to copy and\nredistribute it, with or without modifying it, either commercially\nor noncommercially. Secondarily, this License preserves for the\nauthor and publisher a way to get credit for their work, while\nnot being considered responsible for modifications made by others.\nThis License is a kind of \"copyleft\", which means that\nderivative works of the document must themselves be free in\nthe same sense. It complements the GNU General Public License,\nwhich is a copyleft license designed for free software.\nWe have designed this License in order to use it for manuals for\nfree software, because free software needs free documentation: a free\nprogram should come with manuals providing the same freedoms that the\nsoftware does. But this License is not limited to software manuals;\nit can be used for any textual work, regardless of subject matter or\nwhether it is published as a printed book. We recommend this License\nprincipally for works whose purpose is instruction or reference.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAPPLICABILITY AND DEFINITIONS\nThis License applies to any manual or other work, in any medium,\nthat contains a notice placed by the copyright holder saying\nit can be distributed under the terms of this License. Such a\nnotice grants a world-wide, royalty-free license, unlimited in\nduration, to use that work under the conditions stated herein.\nThe \"Document\", below, refers to any such manual or work.\nAny member of the public is a licensee, and is addressed as\n\"you\". You accept the license if you copy, modify or distribute\nthe work in a way requiring permission under copyright law.\nA \"Modified Version\" of the Document means any work containing\nthe Document or a portion of it, either copied verbatim, or\nwith modifications and/or translated into another language.\nA \"Secondary Section\" is a named appendix or a front-matter\nsection of the Document that deals exclusively with the\nrelationship of the publishers or authors of the Document to the\nDocument's overall subject (or to related matters) and contains\nnothing that could fall directly within that overall subject.\n(Thus, if the Document is in part a textbook of mathematics,\na Secondary Section may not explain any mathematics.) The\nrelationship could be a matter of historical connection with\nthe subject or with related matters, or of legal, commercial,\nphilosophical, ethical or political position regarding them.\nThe \"Invariant Sections\" are certain Secondary Sections whose\ntitles are designated, as being those of Invariant Sections,\nin the notice that says that the Document is released under\nthis License. If a section does not fit the above definition of\nSecondary then it is not allowed to be designated as Invariant.\nThe Document may contain zero Invariant Sections. If the Document\ndoes not identify any Invariant Sections then there are none.\nThe \"Cover Texts\" are certain short passages of text that are listed,\nas Front-Cover Texts or Back-Cover Texts, in the notice that says that\nthe Document is released under this License. A Front-Cover Text may\nbe at most 5 words, and a Back-Cover Text may be at most 25 words.\nA \"Transparent\" copy of the Document means a machine-readable\ncopy, represented in a format whose specification is available\nto the general public, that is suitable for revising the document\nstraightforwardly with generic text editors or (for images composed of\npixels) generic paint programs or (for drawings) some widely available\ndrawing editor, and that is suitable for input to text formatters or\nfor automatic translation to a variety of formats suitable for input\nto text formatters. A copy made in an otherwise Transparent file\nformat whose markup, or absence of markup, has been arranged to thwart\nor discourage subsequent modification by readers is not Transparent.\nAn image format is not Transparent if used for any substantial\namount of text. A copy that is not \"Transparent\" is called \"Opaque\".\nExamples of suitable formats for Transparent copies include plain\nASCII without markup, Texinfo input format, LaTeX input format,\nSGML or XML using a publicly available DTD, and standard-conforming\nsimple HTML, PostScript or PDF designed for human modification.\nExamples of transparent image formats include PNG, XCF and JPG.\nOpaque formats include proprietary formats that can be read\nand edited only by proprietary word processors, SGML or XML\nfor which the DTD and/or processing tools are not generally\navailable, and the machine-generated HTML, PostScript or PDF\nproduced by some word processors for output purposes only.\nThe \"Title Page\" means, for a printed book, the title page itself,\nplus such following pages as are needed to hold, legibly, the\nmaterial this License requires to appear in the title page. For\nworks in formats which do not have any title page as such, \"Title\nPage\" means the text near the most prominent appearance of the\nwork's title, preceding the beginning of the body of the text.\nA section \"Entitled XYZ\" means a named subunit of the Document whose\ntitle either is precisely XYZ or contains XYZ in parentheses following\ntext that translates XYZ in another language. (Here XYZ stands for\na specific section name mentioned below, such as \"Acknowledgements\",\n\"Dedications\", \"Endorsements\", or \"History\".) To \"Preserve the\nTitle\" of such a section when you modify the Document means that\nit remains a section \"Entitled XYZ\" according to this definition.\nThe Document may include Warranty Disclaimers next to the notice\nwhich states that this License applies to the Document. These\nWarranty Disclaimers are considered to be included by reference\nin this License, but only as regards disclaiming warranties:\nany other implication that these Warranty Disclaimers may\nhave is void and has no effect on the meaning of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVERBATIM COPYING\nYou may copy and distribute the Document in any medium, either\ncommercially or noncommercially, provided that this License, the\ncopyright notices, and the license notice saying this License applies\nto the Document are reproduced in all copies, and that you add no\nother conditions whatsoever to those of this License. You may not\nuse technical measures to obstruct or control the reading or further\ncopying of the copies you make or distribute. However, you may accept\ncompensation in exchange for copies. If you distribute a large enough\nnumber of copies you must also follow the conditions in section 3.\nYou may also lend copies, under the same conditions\nstated above, and you may publicly display copies.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOPYING IN QUANTITY\nIf you publish printed copies (or copies in media that commonly\nhave printed covers) of the Document, numbering more than 100,\nand the Document's license notice requires Cover Texts, you must\nenclose the copies in covers that carry, clearly and legibly,\nall these Cover Texts: Front-Cover Texts on the front cover, and\nBack-Cover Texts on the back cover. Both covers must also clearly\nand legibly identify you as the publisher of these copies. The\nfront cover must present the full title with all words of the title\nequally prominent and visible. You may add other material on the\ncovers in addition. Copying with changes limited to the covers, as\nlong as they preserve the title of the Document and satisfy these\nconditions, can be treated as verbatim copying in other respects.\nIf the required texts for either cover are too\nvoluminous to fit legibly, you should put the first\nones listed (as many as fit reasonably) on the actual\ncover, and continue the rest onto adjacent pages.\nIf you publish or distribute Opaque copies of the Document\nnumbering more than 100, you must either include a machine-readable\nTransparent copy along with each Opaque copy, or state in or with\neach Opaque copy a computer-network location from which the general\nnetwork-using public has access to download using public-standard\nnetwork protocols a complete Transparent copy of the Document,\nfree of added material. If you use the latter option, you must take\nreasonably prudent steps, when you begin distribution of Opaque\ncopies in quantity, to ensure that this Transparent copy will\nremain thus accessible at the stated location until at least one\nyear after the last time you distribute an Opaque copy (directly\nor through your agents or retailers) of that edition to the public.\nIt is requested, but not required, that you contact\nthe authors of the Document well before redistributing\nany large number of copies, to give them a chance to\nprovide you with an updated version of the Document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMODIFICATIONS\nYou may copy and distribute a Modified Version of the Document under\nthe conditions of sections 2 and 3 above, provided that you release\nthe Modified Version under precisely this License, with the Modified\nVersion filling the role of the Document, thus licensing distribution\nand modification of the Modified Version to whoever possesses a copy\nof it. In addition, you must do these things in the Modified Version:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "A."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUse in the Title Page (and on the covers, if any) a title distinct\nfrom that of the Document, and from those of previous versions\n(which should, if there were any, be listed in the History section\nof the Document). You may use the same title as a previous version\nif the original publisher of that version gives permission.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "B."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nList on the Title Page, as authors, one or more persons or\nentities responsible for authorship of the modifications in the\nModified Version, together with at least five of the principal\nauthors of the Document (all of its principal authors, if it has\nfewer than five), unless they release you from this requirement.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "C."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nState on the Title page the name of the publisher\nof the Modified Version, as the publisher.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "D."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve all the copyright notices of the Document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "E."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdd an appropriate copyright notice for your\nmodifications adjacent to the other copyright notices.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "F."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInclude, immediately after the copyright notices, a license notice\ngiving the public permission to use the Modified Version under the\nterms of this License, in the form shown in the Addendum below.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "G."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve in that license notice the full lists of Invariant Sections\nand required Cover Texts given in the Document's license notice.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "H."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInclude an unaltered copy of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "I."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve the section Entitled \"History\", Preserve its Title, and\nadd to it an item stating at least the title, year, new authors,\nand publisher of the Modified Version as given on the Title\nPage. If there is no section Entitled \"History\" in the Document,\ncreate one stating the title, year, authors, and publisher\nof the Document as given on its Title Page, then add an item\ndescribing the Modified Version as stated in the previous sentence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "J."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve the network location, if any, given in the Document\nfor public access to a Transparent copy of the Document, and\nlikewise the network locations given in the Document for previous\nversions it was based on. These may be placed in the \"History\"\nsection. You may omit a network location for a work that was\npublished at least four years before the Document itself, or if the\noriginal publisher of the version it refers to gives permission.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "K."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor any section Entitled \"Acknowledgements\" or \"Dedications\",\nPreserve the Title of the section, and preserve in the\nsection all the substance and tone of each of the contributor\nacknowledgements and/or dedications given therein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "L."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve all the Invariant Sections of the Document, unaltered\nin their text and in their titles. Section numbers or the\nequivalent are not considered part of the section titles.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "M."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDelete any section Entitled \"Endorsements\". Such a\nsection may not be included in the Modified Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "N."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDo not retitle any existing section to be Entitled \"Endorsements\"\nor to conflict in title with any Invariant Section.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "O."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPreserve any Warranty Disclaimers.\nIf the Modified Version includes new front-matter sections or\nappendices that qualify as Secondary Sections and contain no material\ncopied from the Document, you may at your option designate some or\nall of these sections as invariant. To do this, add their titles\nto the list of Invariant Sections in the Modified Version's license\nnotice. These titles must be distinct from any other section titles.\nYou may add a section Entitled \"Endorsements\", provided\nit contains nothing but endorsements of your Modified\nVersion by various parties--for example, statements of\npeer review or that the text has been approved by an\norganization as the authoritative definition of a standard.\nYou may add a passage of up to five words as a Front-Cover Text,\nand a passage of up to 25 words as a Back-Cover Text, to the end of\nthe list of Cover Texts in the Modified Version. Only one passage\nof Front-Cover Text and one of Back-Cover Text may be added by (or\nthrough arrangements made by) any one entity. If the Document already\nincludes a cover text for the same cover, previously added by you or\nby arrangement made by the same entity you are acting on behalf of,\nyou may not add another; but you may replace the old one, on explicit\npermission from the previous publisher that added the old one.\nThe author(s) and publisher(s) of the Document do not by this\nLicense give permission to use their names for publicity for\nor to assert or imply endorsement of any Modified Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOMBINING DOCUMENTS\nYou may combine the Document with other documents released under\nthis License, under the terms defined in section 4 above for modified\nversions, provided that you include in the combination all of the\nInvariant Sections of all of the original documents, unmodified,\nand list them all as Invariant Sections of your combined work in its\nlicense notice, and that you preserve all their Warranty Disclaimers.\nThe combined work need only contain one copy of this License, and\nmultiple identical Invariant Sections may be replaced with a single\ncopy. If there are multiple Invariant Sections with the same name\nbut different contents, make the title of each such section unique\nby adding at the end of it, in parentheses, the name of the original\nauthor or publisher of that section if known, or else a unique\nnumber. Make the same adjustment to the section titles in the list\nof Invariant Sections in the license notice of the combined work.\nIn the combination, you must combine any sections Entitled\n\"History\" in the various original documents, forming one section\nEntitled \"History\"; likewise combine any sections Entitled\n\"Acknowledgements\", and any sections Entitled \"Dedications\".\nYou must delete all sections Entitled \"Endorsements\".\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCOLLECTIONS OF DOCUMENTS\nYou may make a collection consisting of the Document and\nother documents released under this License, and replace the\nindividual copies of this License in the various documents\nwith a single copy that is included in the collection,\nprovided that you follow the rules of this License for verbatim\ncopying of each of the documents in all other respects.\nYou may extract a single document from such a collection,\nand distribute it individually under this License,\nprovided you insert a copy of this License into the\nextracted document, and follow this License in all other\nrespects regarding verbatim copying of that document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAGGREGATION WITH INDEPENDENT WORKS\nA compilation of the Document or its derivatives with other\nseparate and independent documents or works, in or on a volume\nof a storage or distribution medium, is called an \"aggregate\"\nif the copyright resulting from the compilation is not used to\nlimit the legal rights of the compilation's users beyond what\nthe individual works permit. When the Document is included in an\naggregate, this License does not apply to the other works in the\naggregate which are not themselves derivative works of the Document.\nIf the Cover Text requirement of section 3 is applicable to\nthese copies of the Document, then if the Document is less\nthan one half of the entire aggregate, the Document's Cover\nTexts may be placed on covers that bracket the Document\nwithin the aggregate, or the electronic equivalent of covers\nif the Document is in electronic form. Otherwise they must\nappear on printed covers that bracket the whole aggregate.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTRANSLATION\nTranslation is considered a kind of modification, so you may\ndistribute translations of the Document under the terms of section\n4. Replacing Invariant Sections with translations requires special\npermission from their copyright holders, but you may include\ntranslations of some or all Invariant Sections in addition to the\noriginal versions of these Invariant Sections. You may include a\ntranslation of this License, and all the license notices in the\nDocument, and any Warranty Disclaimers, provided that you also\ninclude the original English version of this License and the original\nversions of those notices and disclaimers. In case of a disagreement\nbetween the translation and the original version of this License\nor a notice or disclaimer, the original version will prevail.\nIf a section in the Document is Entitled\n\"Acknowledgements\", \"Dedications\", or \"History\", the\nrequirement (section 4) to Preserve its Title (section\n1) will typically require changing the actual title.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTERMINATION\nYou may not copy, modify, sublicense, or distribute the Document\nexcept as expressly provided for under this License. Any other\nattempt to copy, modify, sublicense or distribute the Document\nis void, and will automatically terminate your rights under\nthis License. However, parties who have received copies, or\nrights, from you under this License will not have their licenses\nterminated so long as such parties remain in full compliance.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFUTURE REVISIONS OF THIS LICENSE\nThe Free Software Foundation may publish new, revised\nversions of the GNU Free Documentation License from time\nto time. Such new versions will be similar in spirit to\nthe present version, but may differ in detail to address\nnew problems or concerns. See http://www.gnu.org/copyleft/.\nEach version of the License is given a distinguishing version number.\nIf the Document specifies that a particular numbered version of this\nLicense \"or any later version\" applies to it, you have the option\nof following the terms and conditions either of that specified\nversion or of any later version that has been published (not as a\ndraft) by the Free Software Foundation. If the Document does not\nspecify a version number of this License, you may choose any version\never published (not as a draft) by the Free Software Foundation.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nADDENDUM: How to use this License for your documents\nTo use this License in a document you have written, include\na copy of the License in the document and put the following\ncopyright and license notices just after the title page:\nCopyright (c) YEAR YOUR NAME. Permission is granted to copy,\ndistribute and/or modify this document under the terms of the GNU\nFree Documentation License, Version 1.2 or any later version published\nby the Free Software Foundation; with no Invariant Sections,\nno Front-Cover Texts,and no Back-Cover Texts. A copy of the license is\nincluded in the section entitled \"GNU Free Documentation License\".\nIf you have Invariant Sections, Front-Cover Texts and\nBack-Cover Texts, replace the \"with...Texts.\" line with this:\nwith the Invariant Sections being LIST THEIR TITLES, with the\nFront-Cover Texts being LIST, and with the Back-Cover Texts being LIST.\nIf you have Invariant Sections without Cover Texts,\nor some other combination of the three, merge\nthose two alternatives to suit the situation.\nIf your document contains nontrivial examples of program\ncode, we recommend releasing these examples in parallel\nunder your choice of free software license, such as the GNU\nGeneral Public License, to permit their use in free software.\n"}]}, {"tag": "text", "content": "\n"}]