[{"type": "optional", "content": {"type": "text", "content": "3DFX GLIDE Source Code General Public License"}}, {"type": "text", "content": "\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          PREAMBLE\n          This license is for software that provides a 3D graphics application program interface (API).The license\n             is intended to offer terms similar to some standard General Public Licenses designed to foster open\n             standards and unrestricted accessibility to source code. Some of these licenses require that, as a\n             condition of the license of the software, any derivative works (that is, new software which is a work\n             containing the original program or a portion of it) must be available for general use, without\n             restriction other than for a minor transfer fee, and that the source code for such derivative works\n             must likewise be made available. The only restriction is that such derivative works must be subject to\n             the same General Public License terms as the original work.\n            This 3dfx GLIDE Source Code General Public License differs from the standard licenses of this type in\n             that it does not require the entire derivative work to be made available under the terms of this\n             license nor is the recipient required to make available the source code for the entire derivative\n             work. Rather, the license is limited to only the identifiable portion of the derivative work that is\n             derived from the licensed software. The precise terms and conditions for copying, distribution and\n             modification follow.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DEFINITIONS\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              This License applies to any program (or other \"work\") which contains a notice\n                 placed by the copyright holder saying it may be distributed under the terms of this 3dfx\n                 GLIDE Source Code General Public License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              The term \"Program\" as used in this Agreement refers to 3DFX's GLIDE source\n                 code and object code and any Derivative Work.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              \"Derivative Work\" means, for the purpose of the License, that portion of any work\n                 that contains the Program or the identifiable portion of a work that is derived from the\n                 Program, either verbatim or with modifications and/or translated into another language,\n                 and that performs 3D graphics API operations. It does not include any other portions of a\n                 work.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              \"Modifications of the Program\" means any work, which includes a Derivative Work,\n                 and includes the whole of such work.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              \"License\" means this 3dfx GLIDE Source Code General Public License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              The \"Source Code\" for a work means the preferred form of the work for making\n                 modifications to it. For an executable work, complete source code means all the source\n                 code for all modules it contains, any associated interface definition files, and the\n                 scripts used to control compilation and installation of the executable work.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.7"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              \"3dfx\" means 3dfx Interactive, Inc.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          LICENSED ACTIVITIES\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              COPYING - You may copy and distribute verbatim copies of the Program's Source Code as\n                 you receive it, in any medium, subject to the provision of section 3.3 and provided also\n                 that:\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  you conspicuously and appropriately publish on each copy an appropriate copyright notice\n                     (3dfx Interactive, Inc. 1999), a notice that recipients who wish to copy, distribute\n                     or modify the Program can only do so subject to this License, and a disclaimer of\n                     warranty as set forth in section 5;\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  keep intact all the notices that refer to this License and to the absence of any warranty; and\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  do not make any use of the GLIDE trademark without the prior written permission of 3dfx, and\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  give all recipients of the Program a copy of this License along with the Program or\n                     instructions on how to easily receive a copy of this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              MODIFICATION OF THE PROGRAM/DERIVATIVE WORKS - You may modify your copy or copies of the\n                 Program or any portion of it, and copy and distribute such modifications subject to the\n                 provisions of section 3.3 and provided that you also meet all of the following\n                 conditions:\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  you conspicuously and appropriately publish on each copy of a Derivative Work an\n                     appropriate copyright notice, a notice that recipients who wish to copy, distribute or\n                     modify the Derivative Work can only do so subject to this License, and a disclaimer of\n                     warranty as set forth in section 5;\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  keep intact all the notices that refer to this License and to the absence of any\n                     warranty; and (c) give all recipients of the Derivative Work a copy of this License\n                     along with the Derivative Work or instructions on how to easily receive a copy of this\n                     License.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You must cause the modified files of the Derivative Work to carry prominent notices\n                     stating that you changed the files and the date of any change.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(e)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You must cause any Derivative Work that you distribute or publish to be licensed at no\n                     charge to all third parties under the terms of this License.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(f)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You do not make any use of the GLIDE trademark without the prior written permission of 3dfx.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(g)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  If the Derivative Work normally reads commands interactively when run, you must cause it,\n                     when started running for such interactive use, to print or display an announcement as\n                     follows:\n                  \"COPYRIGHT 3DFX INTERACTIVE, INC. 1999, ALL RIGHTS RESERVED THIS SOFTWARE IS FREE\n                     AND PROVIDED \"AS IS,\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR\n                     IMPLIED. THERE IS NO RIGHT TO USE THE GLIDE TRADEMARK WITHOUT PRIOR WRITTEN PERMISSION\n                     OF 3DFX INTERACTIVE, INC. SEE THE 3DFX GLIDE GENERAL PUBLIC LICENSE FOR A FULL TEXT OF\n                     THE DISTRIBUTION AND NON-WARRANTY PROVISIONS (REQUEST COPY FROM\n                     INFO@3DFX.COM).\"\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(h)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  The requirements of this section 3.2 do not apply to the modified work as a whole but\n                     only to the Derivative Work. It is not the intent of this License to claim rights or\n                     contest your rights to work written entirely by you; rather, the intent is to exercise\n                     the right to control the distribution of Derivative Works.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              DISTRIBUTION\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  All copies of the Program or Derivative Works which are distributed must include in the\n                     file headers the following language verbatim:\n                  \"THIS SOFTWARE IS SUBJECT TO COPYRIGHT PROTECTION AND IS OFFERED ONLY PURSUANT TO\n                     THE 3DFX GLIDE GENERAL PUBLIC LICENSE. THERE IS NO RIGHT TO USE THE GLIDE TRADEMARK\n                     WITHOUT PRIOR WRITTEN PERMISSION OF 3DFX INTERACTIVE, INC. A COPY OF THIS LICENSE MAY\n                     BE OBTAINED FROM THE DISTRIBUTOR OR BY CONTACTING 3DFX INTERACTIVE INC\n                     (info@3dfx.com). THIS PROGRAM. IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY\n                     KIND, EITHER EXPRESSED OR IMPLIED. SEE THE 3DFX GLIDE GENERAL PUBLIC LICENSE FOR A\n                     FULL TEXT OF THE NON-WARRANTY PROVISIONS.\n                        USE, DUPLICATION OR DISCLOSURE BY THE GOVERNMENT IS SUBJECT TO RESTRICTIONS AS SET FORTH\n                     IN SUBDIVISION (C)(1)(II) OF THE RIGHTS IN TECHNICAL DATA AND COMPUTER SOFTWARE CLAUSE\n                     AT DFARS 252.227-7013, AND/OR IN SIMILAR OR SUCCESSOR CLAUSES IN THE FAR, DOD OR NASA\n                     FAR SUPPLEMENT. UNPUBLISHED RIGHTS RESERVED UNDER THE COPYRIGHT LAWS OF THE UNITED\n                     STATES.\n                        COPYRIGHT 3DFX INTERACTIVE, INC. 1999, ALL RIGHTS RESERVED\"\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You may distribute the Program or a Derivative Work in object code or executable form\n                     under the terms of Sections 3.1 and 3.2 provided that you also do one of the\n                     following:\n                  "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                      Accompany it with the complete corresponding machine-readable source code, which must\n                         be distributed under the terms of Sections 3.1 and 3.2; or,\n                           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                      Accompany it with a written offer, valid for at least three years, to give any third\n                         party, for a charge no more than your cost of physically performing source\n                         distribution, a complete machine-readable copy of the corresponding source code,\n                         to be distributed under the terms of Sections 3.1 and 3.2 on a medium customarily\n                         used for software interchange; or,\n                           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                      Accompany it with the information you received as to the offer to distribute\n                         corresponding source code. (This alternative is allowed only for noncommercial\n                         distribution and only if you received the program in object code or executable\n                         form with such an offer, in accord with Subsection 3.3(b)(2) above.)\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  The source code distributed need not include anything that is normally distributed (in\n                     either source or binary form) with the major components (compiler, kernel, and so on)\n                     of the operating system on which the executable runs, unless that component itself\n                     accompanies the executable code.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  If distribution of executable code or object code is made by offering access to copy from\n                     a designated place, then offering equivalent access to copy the source code from the\n                     same place counts as distribution of the source code, even though third parties are\n                     not compelled to copy the source along with the object code.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(e)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Each time you redistribute the Program or any Derivative Work, the recipient\n                     automatically receives a license from 3dfx and successor licensors to copy, distribute\n                     or modify the Program and Derivative Works subject to the terms and conditions of the\n                     License. You may not impose any further restrictions on the recipients' exercise\n                     of the rights granted herein. You are not responsible for enforcing compliance by\n                     third parties to this License.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(f)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You may not make any use of the GLIDE trademark without the prior written permission of 3dfx.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(g)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  You may not copy, modify, sublicense, or distribute the Program or any Derivative Works\n                     except as expressly provided under this License. Any attempt otherwise to copy,\n                     modify, sublicense or distribute the Program or any Derivative Works is void, and will\n                     automatically terminate your rights under this License. However, parties who have\n                     received copies, or rights, from you under this License will not have their licenses\n                     terminated so long as such parties remain in full compliance.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              MISCELLANEOUS\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Acceptance of this License is voluntary. By using, modifying or distributing the Program or\n                     any Derivative Work, you indicate your acceptance of this License to do so, and all its\n                     terms and conditions for copying, distributing or modifying the Program or works based on\n                     it. Nothing else grants you permission to modify or distribute the Program or Derivative\n                     Works and doing so without acceptance of this License is in violation of the U.S. and\n                     international copyright laws.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  If the distribution and/or use of the Program or Derivative Works is restricted in certain\n                     countries either by patents or by copyrighted interfaces, the original copyright holder\n                     who places the Program under this License may add an explicit geographical distribution\n                     limitation excluding those countries, so that distribution is permitted only in or among\n                     countries not thus excluded. In such case, this License incorporates the limitation as if\n                     written in the body of this License.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  This License is to be construed according to the laws of the State of California and you\n                     consent to personal jurisdiction in the State of California in the event it is necessary\n                     to enforce the provisions of this License.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              NO WARRANTIES\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  TO THE EXTENT PERMITTED BY APPLICABLE LAW, THERE IS NO WARRANTY FOR THE PROGRAM. OR\n                     DERIVATIVE WORKS THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM AND ANY\n                     DERIVATIVE WORKS\"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR\n                     IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n                     FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE\n                     PROGRAM AND ANY DERIVATIVE WORK IS WITH YOU. SHOULD THE PROGRAM OR ANY DERIVATIVE WORK\n                     PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW WILL 3DFX INTERACTIVE, INC., OR ANY OTHER\n                     COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM OR\n                     DERIVATIVE WORKS AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL,\n                     SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE\n                     THE PROGRAM OR DERIVATIVE WORKS (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING\n                     RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE\n                     PROGRAM OR DERIVATIVE WORKS TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR\n                     OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES."}]