[{"tag": "text", "content": "\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nCopyright 1986 - 1993, 1998, 2004 Thomas Williams, Colin Kelley\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\nPermission to use, copy, and distribute this software and its documentation for any purpose with or\nwithout fee is hereby granted, provided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in supporting documentation.\nPermission to modify the software is granted, but not the right to distribute the complete modified\nsource code. Modifications are to be distributed as patches to the released version. Permission to\ndistribute binaries produced by compiling modified sources is granted, provided you\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ndistribute the corresponding source modifications from the released version in the form of a\npatch file along with the binaries,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nadd special version identification to distinguish your version in addition to the base\nrelease version number,\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nprovide your name and address as the primary contact for the support of your modified version, and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nretain our contact information in regard to use of the base software.\nPermission to distribute the released version of the source code along with corresponding source\nmodifications in the form of a patch file is granted with same provisions 2 through 4 for binary\ndistributions.\nThis software is provided \"as is\" without express or implied warranty to the extent permitted\nby applicable law.\n"}]