[{"type": "text", "content": "﻿insert GPL v3 text here\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "GCC RUNTIME LIBRARY EXCEPTION\n\n         \nVersion 3.1, 31 March 2009"}}, {"type": "text", "content": "\n\t        \nGeneral information: http://www.gnu.org/licenses/gcc-exception.html\n\n      \nCopyright (C) 2009 Free Software Foundation, Inc.\n      <http://fsf.org/>\n\n      \nEveryone is permitted to copy and distribute verbatim copies of\n         this license document, but changing it is not allowed.\n      \nThis GCC Runtime Library Exception (\"Exception\") is an\n           additional permission under section 7 of the GNU\n           General Public License, version 3 (\"GPLv3\"). It\n           applies to a given file (the \"Runtime Library\") that\n           bears a notice placed by the copyright holder of the\n           file stating that the file is governed by GPLv3 along\n           with this Exception.\n\n      \nWhen you use GCC to compile a program, GCC may combine portions\n         of certain GCC header files and runtime libraries with the\n         compiled program. The purpose of this Exception is to allow\n         compilation of non-GPL (including proprietary) programs to\n         use, in this way, the header files and runtime libraries\n         covered by this Exception.\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions.\n          \nA file is an \"Independent Module\" if it either requires\n             the Runtime Library for execution after a Compilation\n             Process, or makes use of an interface provided by the\n             Runtime Library, but is not otherwise based on the\n             Runtime Library.\n\n            \n\"GCC\" means a version of the GNU Compiler Collection,\n             with or without modifications, governed by version 3\n             (or a specified later version) of the GNU General\n             Public License (GPL) with the option of using any\n             subsequent versions published by the FSF.\n\n            \n\"GPL-compatible Software\" is software whose conditions of\n             propagation, modification and use would permit\n             combination with GCC in accord with the license of\n             GCC.\n\n            \n\"Target Code\" refers to output from any compiler for a\n             real or virtual target processor architecture, in\n             executable form or suitable for input to an assembler,\n             loader, linker and/or execution phase. Notwithstanding\n             that, Target Code does not include data in any format\n             that is used as a compiler intermediate\n             representation, or used for producing a compiler\n             intermediate representation.\n\n            \nThe \"Compilation Process\" transforms code entirely\n             represented in non-intermediate languages designed for\n             human-written code, and/or in Java Virtual Machine\n             byte code, into Target Code. Thus, for example, use of\n             source code generators and preprocessors need not be\n             considered part of the Compilation Process, since the\n             Compilation Process can be understood as starting with\n             the output of the generators or preprocessors.\n\n            \nA Compilation Process is \"Eligible\" if it is done using\n             GCC, alone or with other GPL-compatible software, or\n             if it is done without using any work based on GCC. For\n             example, using non-GPL-compatible Software to optimize\n             any GCC intermediate representations would not qualify\n             as an Eligible Compilation Process.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of Additional Permission.\n          \nYou have permission to propagate a work of Target Code\n             formed by combining the Runtime Library with\n             Independent Modules, even if such propagation would\n             otherwise violate the terms of GPLv3, provided that\n             all Target Code was generated by Eligible Compilation\n             Processes. You may then convey such a combination\n             under terms of your choice, consistent with the\n             licensing of the Independent Modules.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Weakening of GCC Copyleft.\n      \nThe availability of this Exception does not imply any general\n         presumption that third-party software is unaffected by the\n         copyleft requirements of the license of GCC."}]