[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nGNU GENERAL PUBLIC LICENSE\nVersion 3, 29 June 2007\n"}]}, {"type": "text", "content": "\nCopyright © 2007 Free Software Foundation, Inc.\n<https://fsf.org/>\nEveryone is permitted to copy and distribute verbatim copies\nof this license document, but changing it is not allowed.\nPreamble\nThe GNU General Public License is a free, copyleft\nlicense for software and other kinds of works.\nThe licenses for most software and other practical works are designed to\ntake away your freedom to share and change the works. By contrast, the GNU\nGeneral Public License is intended to guarantee your freedom to share and\nchange all versions of a program--to make sure it remains free software\nfor all its users. We, the Free Software Foundation, use the GNU General\nPublic License for most of our software; it applies also to any other work\nreleased this way by its authors. You can apply it to your programs, too.\nWhen we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge\nfor them if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of\nit in new free programs, and that you know you can do these things.\nTo protect your rights, we need to prevent others from denying you\nthese rights or asking you to surrender the rights. Therefore, you have\ncertain responsibilities if you distribute copies of the software, or\nif you modify it: responsibilities to respect the freedom of others.\nFor example, if you distribute copies of such a program, whether gratis\nor for a fee, you must pass on to the recipients the same freedoms that\nyou received. You must make sure that they, too, receive or can get the\nsource code. And you must show them these terms so they know their rights.\nDevelopers that use the GNU GPL protect your rights with two steps:\n(1) assert copyright on the software, and (2) offer you this License\ngiving you legal permission to copy, distribute and/or modify it.\nFor the developers' and authors' protection, the GPL clearly\nexplains that there is no warranty for this free software. For\nboth users' and authors' sake, the GPL requires that modified\nversions be marked as changed, so that their problems will\nnot be attributed erroneously to authors of previous versions.\nSome devices are designed to deny users access to install or run modified\nversions of the software inside them, although the manufacturer can\ndo so. This is fundamentally incompatible with the aim of protecting\nusers' freedom to change the software. The systematic pattern of\nsuch abuse occurs in the area of products for individuals to use,\nwhich is precisely where it is most unacceptable. Therefore, we have\ndesigned this version of the GPL to prohibit the practice for those\nproducts. If such problems arise substantially in other domains,\nwe stand ready to extend this provision to those domains in future\nversions of the GPL, as needed to protect the freedom of users.\nFinally, every program is threatened constantly by software patents.\nStates should not allow patents to restrict development and use of\nsoftware on general-purpose computers, but in those that do, we wish\nto avoid the special danger that patents applied to a free program\ncould make it effectively proprietary. To prevent this, the GPL\nassures that patents cannot be used to render the program non-free.\nThe precise terms and conditions for copying,\ndistribution and modification follow.\nTERMS AND CONDITIONS\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "0."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDefinitions.\n“This License” refers to version 3 of the GNU General Public License.\n“Copyright” also means copyright-like laws that apply\nto other kinds of works, such as semiconductor masks.\n“The Program” refers to any copyrightable work licensed under\nthis License. Each licensee is addressed as “you”. “Licensees”\nand “recipients” may be individuals or organizations.\nTo “modify” a work means to copy from or adapt all or part of the\nwork in a fashion requiring copyright permission, other than the\nmaking of an exact copy. The resulting work is called a “modified\nversion” of the earlier work or a work “based on” the earlier work.\nA “covered work” means either the unmodified\nProgram or a work based on the Program.\nTo “propagate” a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it\non a computer or modifying a private copy. Propagation includes\ncopying, distribution (with or without modification), making available\nto the public, and in some countries other activities as well.\nTo “convey” a work means any kind of propagation\nthat enables other parties to make or receive copies.\nMere interaction with a user through a computer\nnetwork, with no transfer of a copy, is not conveying.\nAn interactive user interface displays “Appropriate Legal Notices”\nto the extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to\nthe extent that warranties are provided), that licensees may convey\nthe work under this License, and how to view a copy of this License.\nIf the interface presents a list of user commands or options,\nsuch as a menu, a prominent item in the list meets this criterion.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSource Code.\nThe “source code” for a work means the preferred\nform of the work for making modifications to it.\n“Object code” means any non-source form of a work.\nA “Standard Interface” means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case\nof interfaces specified for a particular programming language,\none that is widely used among developers working in that language.\nThe “System Libraries” of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form\nof packaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form. A\n“Major Component”, in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\nThe “Corresponding Source” for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts\nto control those activities. However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available\nfree programs which are used unmodified in performing those activities\nbut which are not part of the work. For example, Corresponding\nSource includes interface definition files associated with source\nfiles for the work, and the source code for shared libraries\nand dynamically linked subprograms that the work is specifically\ndesigned to require, such as by intimate data communication or\ncontrol flow between those subprograms and other parts of the work.\nThe Corresponding Source need not include anything that users can\nregenerate automatically from other parts of the Corresponding Source.\nThe Corresponding Source for a work\nin source code form is that same work.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nBasic Permissions.\nAll rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met. This License explicitly affirms your unlimited\npermission to run the unmodified Program. The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work. This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\nYou may make, run and propagate covered works that you do not convey,\nwithout conditions so long as your license otherwise remains in force.\nYou may convey covered works to others for the sole purpose of having\nthem make modifications exclusively for you, or provide you with\nfacilities for running those works, provided that you comply with\nthe terms of this License in conveying all material for which you do\nnot control copyright. Those thus making or running the covered works\nfor you must do so exclusively on your behalf, under your direction\nand control, on terms that prohibit them from making any copies\nof your copyrighted material outside their relationship with you.\nConveying under any other circumstances is permitted\nsolely under the conditions stated below. Sublicensing\nis not allowed; section 10 makes it unnecessary.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nProtecting Users' Legal Rights From Anti-Circumvention Law.\nNo covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such measures.\nWhen you convey a covered work, you waive any legal power to\nforbid circumvention of technological measures to the extent\nsuch circumvention is effected by exercising rights under this\nLicense with respect to the covered work, and you disclaim any\nintention to limit operation or modification of the work as a means\nof enforcing, against the work's users, your or third parties'\nlegal rights to forbid circumvention of technological measures.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConveying Verbatim Copies.\nYou may convey verbatim copies of the Program's source code as\nyou receive it, in any medium, provided that you conspicuously\nand appropriately publish on each copy an appropriate copyright\nnotice; keep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the\ncode; keep intact all notices of the absence of any warranty; and\ngive all recipients a copy of this License along with the Program.\nYou may charge any price or no price for each copy that you\nconvey, and you may offer support or warranty protection for a fee.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConveying Modified Source Versions.\nYou may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the terms\nof section 4, provided that you also meet all of these conditions:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe work must carry prominent notices stating\nthat you modified it, and giving a relevant date.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe work must carry prominent notices stating that\nit is released under this License and any conditions\nadded under section 7. This requirement modifies the\nrequirement in section 4 to “keep intact all notices”.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou must license the entire work, as a whole, under this License\nto anyone who comes into possession of a copy. This License\nwill therefore apply, along with any applicable section 7\nadditional terms, to the whole of the work, and all its parts,\nregardless of how they are packaged. This License gives no\npermission to license the work in any other way, but it does not\ninvalidate such permission if you have separately received it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf the work has interactive user interfaces, each must\ndisplay Appropriate Legal Notices; however, if the Program\nhas interactive interfaces that do not display Appropriate\nLegal Notices, your work need not make them do so.\nA compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered\nwork, and which are not combined with it such as to form a larger\nprogram, in or on a volume of a storage or distribution medium,\nis called an “aggregate” if the compilation and its resulting\ncopyright are not used to limit the access or legal rights\nof the compilation's users beyond what the individual works\npermit. Inclusion of a covered work in an aggregate does not\ncause this License to apply to the other parts of the aggregate.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConveying Non-Source Forms.\nYou may convey a covered work in object code form\nunder the terms of sections 4 and 5, provided that you\nalso convey the machine-readable Corresponding Source\nunder the terms of this License, in one of these ways:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConvey the object code in, or embodied in, a physical\nproduct (including a physical distribution medium),\naccompanied by the Corresponding Source fixed on a durable\nphysical medium customarily used for software interchange.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConvey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by a\nwritten offer, valid for at least three years and valid for\nas long as you offer spare parts or customer support for that\nproduct model, to give anyone who possesses the object code\neither (1) a copy of the Corresponding Source for all the software\nin the product that is covered by this License, on a durable\nphysical medium customarily used for software interchange,\nfor a price no more than your reasonable cost of physically\nperforming this conveying of source, or (2) access to copy\nthe Corresponding Source from a network server at no charge.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConvey individual copies of the object code with a\ncopy of the written offer to provide the Corresponding\nSource. This alternative is allowed only occasionally\nand noncommercially, and only if you received the object\ncode with such an offer, in accord with subsection 6b.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConvey the object code by offering access from a designated place\n(gratis or for a charge), and offer equivalent access to the\nCorresponding Source in the same way through the same place at\nno further charge. You need not require recipients to copy the\nCorresponding Source along with the object code. If the place\nto copy the object code is a network server, the Corresponding\nSource may be on a different server (operated by you or a third\nparty) that supports equivalent copying facilities, provided you\nmaintain clear directions next to the object code saying where\nto find the Corresponding Source. Regardless of what server hosts\nthe Corresponding Source, you remain obligated to ensure that it\nis available for as long as needed to satisfy these requirements.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConvey the object code using peer-to-peer transmission,\nprovided you inform other peers where the object code\nand Corresponding Source of the work are being offered\nto the general public at no charge under subsection 6d.\nA separable portion of the object code, whose source code is\nexcluded from the Corresponding Source as a System Library,\nneed not be included in conveying the object code work.\nA “User Product” is either (1) a “consumer product”, which means\nany tangible personal property which is normally used for personal,\nfamily, or household purposes, or (2) anything designed or sold\nfor incorporation into a dwelling. In determining whether a product\nis a consumer product, doubtful cases shall be resolved in favor\nof coverage. For a particular product received by a particular\nuser, “normally used” refers to a typical or common use of that\nclass of product, regardless of the status of the particular\nuser or of the way in which the particular user actually uses,\nor expects or is expected to use, the product. A product is a\nconsumer product regardless of whether the product has substantial\ncommercial, industrial or non-consumer uses, unless such uses\nrepresent the only significant mode of use of the product.\n“Installation Information” for a User Product means any methods,\nprocedures, authorization keys, or other information required\nto install and execute modified versions of a covered work in\nthat User Product from a modified version of its Corresponding\nSource. The information must suffice to ensure that the continued\nfunctioning of the modified object code is in no case prevented\nor interfered with solely because modification has been made.\nIf you convey an object code work under this section in, or with,\nor specifically for use in, a User Product, and the conveying\noccurs as part of a transaction in which the right of possession\nand use of the User Product is transferred to the recipient in\nperpetuity or for a fixed term (regardless of how the transaction\nis characterized), the Corresponding Source conveyed under this\nsection must be accompanied by the Installation Information.\nBut this requirement does not apply if neither you nor any third\nparty retains the ability to install modified object code on the\nUser Product (for example, the work has been installed in ROM).\nThe requirement to provide Installation Information does not\ninclude a requirement to continue to provide support service,\nwarranty, or updates for a work that has been modified\nor installed by the recipient, or for the User Product in\nwhich it has been modified or installed. Access to a network\nmay be denied when the modification itself materially and\nadversely affects the operation of the network or violates\nthe rules and protocols for communication across the network.\nCorresponding Source conveyed, and Installation Information\nprovided, in accord with this section must be in a format that\nis publicly documented (and with an implementation available\nto the public in source code form), and must require no\nspecial password or key for unpacking, reading or copying.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAdditional Terms.\n“Additional permissions” are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program\nshall be treated as though they were included in this License, to\nthe extent that they are valid under applicable law. If additional\npermissions apply only to part of the Program, that part may be used\nseparately under those permissions, but the entire Program remains\ngoverned by this License without regard to the additional permissions.\nWhen you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part\nof it. (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.) You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\nNotwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders\nof that material) supplement the terms of this License with terms:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDisclaiming warranty or limiting liability differently\nfrom the terms of sections 15 and 16 of this License; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequiring preservation of specified reasonable legal\nnotices or author attributions in that material or in the\nAppropriate Legal Notices displayed by works containing it; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nProhibiting misrepresentation of the origin of that material,\nor requiring that modified versions of such material be marked\nin reasonable ways as different from the original version; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLimiting the use for publicity purposes of names\nof licensors or authors of the material; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDeclining to grant rights under trademark law for use\nof some trade names, trademarks, or service marks; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "f)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequiring indemnification of licensors and authors of that\nmaterial by anyone who conveys the material (or modified\nversions of it) with contractual assumptions of liability\nto the recipient, for any liability that these contractual\nassumptions directly impose on those licensors and authors.\nAll other non-permissive additional terms are considered “further\nrestrictions” within the meaning of section 10. If the Program\nas you received it, or any part of it, contains a notice stating\nthat it is governed by this License along with a term that is\na further restriction, you may remove that term. If a license\ndocument contains a further restriction but permits relicensing or\nconveying under this License, you may add to a covered work material\ngoverned by the terms of that license document, provided that the\nfurther restriction does not survive such relicensing or conveying.\nIf you add terms to a covered work in accord with this\nsection, you must place, in the relevant source files, a\nstatement of the additional terms that apply to those files,\nor a notice indicating where to find the applicable terms.\nAdditional terms, permissive or non-permissive, may be\nstated in the form of a separately written license, or stated\nas exceptions; the above requirements apply either way.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTermination.\nYou may not propagate or modify a covered work except as\nexpressly provided under this License. Any attempt otherwise\nto propagate or modify it is void, and will automatically\nterminate your rights under this License (including any patent\nlicenses granted under the third paragraph of section 11).\nHowever, if you cease all violation of this License, then your\nlicense from a particular copyright holder is reinstated (a)\nprovisionally, unless and until the copyright holder explicitly\nand finally terminates your license, and (b) permanently, if\nthe copyright holder fails to notify you of the violation by\nsome reasonable means prior to 60 days after the cessation.\nMoreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you\nof the violation by some reasonable means, this is the first\ntime you have received notice of violation of this License\n(for any work) from that copyright holder, and you cure the\nviolation prior to 30 days after your receipt of the notice.\nTermination of your rights under this section does not\nterminate the licenses of parties who have received copies or\nrights from you under this License. If your rights have been\nterminated and not permanently reinstated, you do not qualify\nto receive new licenses for the same material under section 10.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAcceptance Not Required for Having Copies.\nYou are not required to accept this License in order to receive or\nrun a copy of the Program. Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance. However,\nnothing other than this License grants you permission to propagate\nor modify any covered work. These actions infringe copyright if you\ndo not accept this License. Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAutomatic Licensing of Downstream Recipients.\nEach time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License. You are not responsible\nfor enforcing compliance by third parties with this License.\nAn “entity transaction” is a transaction transferring control of\nan organization, or substantially all assets of one, or subdividing\nan organization, or merging organizations. If propagation of a\ncovered work results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest,\nif the predecessor has it or can get it with reasonable efforts.\nYou may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License. For example, you\nmay not impose a license fee, royalty, or other charge for exercise\nof rights granted under this License, and you may not initiate\nlitigation (including a cross-claim or counterclaim in a lawsuit)\nalleging that any patent claim is infringed by making, using, selling,\noffering for sale, or importing the Program or any portion of it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nPatents.\nA “contributor” is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based. The\nwork thus licensed is called the contributor's “contributor version”.\nA contributor's “essential patent claims” are all patent\nclaims owned or controlled by the contributor, whether already\nacquired or hereafter acquired, that would be infringed by some\nmanner, permitted by this License, of making, using, or selling\nits contributor version, but do not include claims that would\nbe infringed only as a consequence of further modification\nof the contributor version. For purposes of this definition,\n“control” includes the right to grant patent sublicenses in\na manner consistent with the requirements of this License.\nEach contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims,\nto make, use, sell, offer for sale, import and otherwise run,\nmodify and propagate the contents of its contributor version.\nIn the following three paragraphs, a “patent license” is any\nexpress agreement or commitment, however denominated, not to\nenforce a patent (such as an express permission to practice\na patent or covenant not to sue for patent infringement). To\n“grant” such a patent license to a party means to make such an\nagreement or commitment not to enforce a patent against the party.\nIf you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through\na publicly available network server or other readily accessible\nmeans, then you must either (1) cause the Corresponding Source to\nbe so available, or (2) arrange to deprive yourself of the benefit\nof the patent license for this particular work, or (3) arrange, in\na manner consistent with the requirements of this License, to extend\nthe patent license to downstream recipients. “Knowingly relying”\nmeans you have actual knowledge that, but for the patent license, your\nconveying the covered work in a country, or your recipient's use of\nthe covered work in a country, would infringe one or more identifiable\npatents in that country that you have reason to believe are valid.\nIf, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance\nof, a covered work, and grant a patent license to some of the\nparties receiving the covered work authorizing them to use,\npropagate, modify or convey a specific copy of the covered work,\nthen the patent license you grant is automatically extended\nto all recipients of the covered work and works based on it.\nA patent license is “discriminatory” if it does not include within the\nscope of its coverage, prohibits the exercise of, or is conditioned\non the non-exercise of one or more of the rights that are specifically\ngranted under this License. You may not convey a covered work if\nyou are a party to an arrangement with a third party that is in the\nbusiness of distributing software, under which you make payment to\nthe third party based on the extent of your activity of conveying\nthe work, and under which the third party grants, to any of the\nparties who would receive the covered work from you, a discriminatory\npatent license (a) in connection with copies of the covered work\nconveyed by you (or copies made from those copies), or (b) primarily\nfor and in connection with specific products or compilations that\ncontain the covered work, unless you entered into that arrangement,\nor that patent license was granted, prior to 28 March 2007.\nNothing in this License shall be construed as excluding or\nlimiting any implied license or other defenses to infringement\nthat may otherwise be available to you under applicable patent law.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNo Surrender of Others' Freedom.\nIf conditions are imposed on you (whether by court order, agreement\nor otherwise) that contradict the conditions of this License,\nthey do not excuse you from the conditions of this License. If\nyou cannot convey a covered work so as to satisfy simultaneously\nyour obligations under this License and any other pertinent\nobligations, then as a consequence you may not convey it at all.\nFor example, if you agree to terms that obligate you to collect\na royalty for further conveying from those to whom you convey the\nProgram, the only way you could satisfy both those terms and this\nLicense would be to refrain entirely from conveying the Program.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "13."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUse with the GNU Affero General Public License.\nNotwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU Affero General Public License into\na single combined work, and to convey the resulting work. The\nterms of this License will continue to apply to the part which\nis the covered work, but the special requirements of the GNU\nAffero General Public License, section 13, concerning interaction\nthrough a network will apply to the combination as such.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "14."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRevised Versions of this License.\nThe Free Software Foundation may publish revised and/or new\nversions of the GNU General Public License from time to time. Such\nnew versions will be similar in spirit to the present version,\nbut may differ in detail to address new problems or concerns.\nEach version is given a distinguishing version number. If the\nProgram specifies that a certain numbered version of the GNU\nGeneral Public License “or any later version” applies to it,\nyou have the option of following the terms and conditions either\nof that numbered version or of any later version published by\nthe Free Software Foundation. If the Program does not specify a\nversion number of the GNU General Public License, you may choose\nany version ever published by the Free Software Foundation.\nIf the Program specifies that a proxy can decide which future\nversions of the GNU General Public License can be used, that\nproxy's public statement of acceptance of a version permanently\nauthorizes you to choose that version for the Program.\nLater license versions may give you additional or\ndifferent permissions. However, no additional obligations\nare imposed on any author or copyright holder as a\nresult of your choosing to follow a later version.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "15."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDisclaimer of Warranty.\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM “AS IS” WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE\nOF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU\nASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "16."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLimitation of Liability.\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR\nCONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING\nBUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE\nOR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE\nPROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER\nOR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "17."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nInterpretation of Sections 15 and 16.\nIf the disclaimer of warranty and limitation of liability\nprovided above cannot be given local legal effect according to\ntheir terms, reviewing courts shall apply local law that most\nclosely approximates an absolute waiver of all civil liability in\nconnection with the Program, unless a warranty or assumption of\nliability accompanies a copy of the Program in return for a fee.\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nEND OF TERMS AND CONDITIONS\nHow to Apply These Terms to Your New Programs\nIf you develop a new program, and you want it to be\nof the greatest possible use to the public, the best\nway to achieve this is to make it free software which\neveryone can redistribute and change under these terms.\nTo do so, attach the following notices to the program. It is safest\nto attach them to the start of each source file to most effectively\nstate the exclusion of warranty; and each file should have at least\nthe “copyright” line and a pointer to where the full notice is found.\n"}, {"type": "var", "name": "description", "content": [{"type": "text", "content": "<one line to give the program's name and\na brief idea of what it does.>"}], "pattern": ".+"}, {"type": "text", "content": "\nCopyright (C) "}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "<year> <name of author>"}], "pattern": ".+"}, {"type": "text", "content": "\nThis program is free software: you can redistribute it and/or\nmodify it under the terms of the GNU General Public License\nas published by the Free Software Foundation, either version\n3 of the License, or (at your option) any later version.\nThis program is distributed in the hope that it will be\nuseful, but WITHOUT ANY WARRANTY; without even the implied\nwarranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR\nPURPOSE. See the GNU General Public License for more details.\nYou should have received a copy of the GNU General\nPublic License along with this program. If not, see\n<https://www.gnu.org/licenses/>.\nAlso add information on how to contact you by electronic and paper mail.\nIf the program does terminal interaction, make it output a\nshort notice like this when it starts in an interactive mode:\n<program> Copyright (C) <year>\n<name of author>\nThis program comes with ABSOLUTELY NO\nWARRANTY; for details type `show w'.\nThis is free software, and you are welcome to redistribute\nit under certain conditions; type `show c' for details.\nThe hypothetical commands `show w' and `show c' should\nshow the appropriate parts of the General Public License.\nOf course, your program's commands might be different;\nfor a GUI interface, you would use an “about box”.\nYou should also get your employer (if you work as a\nprogrammer) or school, if any, to sign a “copyright disclaimer”\nfor the program, if necessary. For more information on\nthis, and how to apply and follow the GNU GPL, see\n<https://www.gnu.org/licenses/>.\nThe GNU General Public License does not permit incorporating\nyour program into proprietary programs. If your program is a\nsubroutine library, you may consider it more useful to permit\nlinking proprietary applications with the library. If this\nis what you want to do, use the GNU Lesser General Public\nLicense instead of this License. But first, please read\n<https: "}, {"type": "var", "name": "philicenses", "content": [{"type": "text", "content": "//www.gnu.org/licenses/why-not-lgpl.html>."}], "pattern": "//www.gnu.org/philosophy/why-not-lgpl\\.html>\\.|//www.gnu.org/licenses/why-not-lgpl\\.html>\\."}, {"type": "text", "content": "\n"}]}, {"type": "text", "content": "\n"}]