[{"type": "optional", "content": {"type": "text", "content": "gSOAP Public License\n         Version 1.3b"}}, {"type": "text", "content": "\n\n        "}, {"type": "optional", "content": {"type": "text", "content": "The gSOAP public license is derived from the Mozilla Public License (MPL1.1). The sections that were\n             deleted from the original MPL1.1 text are 1.0.1, 2.1.(c),(d), 2.2.(c),(d), 8.2.(b), 10, and 11.\n             Section 3.8 was added. The modified sections are 2.1.(b), 2.2.(b), 3.2 (simplified), 3.5 (deleted the\n             last sentence), and 3.6 (simplified).\n          This license applies to the gSOAP software package, with the exception of the soapcpp2 and wsdl2h source\n             code located in gsoap/src and gsoap/wsdl, all code generated by soapcpp2 and wsdl2h, the UDDI source\n             code gsoap/uddi2, and the Web server sample source code samples/webserver. To use any of these\n             software tools and components commercially, a commercial license is required and can be obtained from\n             www.genivia.com."}}, {"type": "text", "content": "\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                DEFINITIONS.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.0.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Contributor\" means each entity that creates or contributes to the creation of\n                         Modifications.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Contributor Version\" means the combination of the Original Code, prior\n                         Modifications used by a Contributor, and the Modifications made by that particular\n                         Contributor.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Covered Code\" means the Original Code, or Modifications or the combination of the\n                         Original Code, and Modifications, in each case including portions thereof.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the\n                         software development community for the electronic transfer of data.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Executable\" means Covered Code in any form other than Source Code.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Initial Developer\" means the individual or entity identified as the Initial\n                           Developer in the Source Code notice required by Exhibit A.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Larger Work\" means a work which combines Covered Code or portions thereof with\n                         code not governed by the terms of this License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"License\" means this document.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.8.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Licensable\" means having the right to grant, to the maximum extent\n                         possible, whether at the time of the initial grant or subsequently acquired, any and all\n                         of the rights conveyed herein.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Modifications\" means any addition to or deletion from the substance or structure\n                         of either the Original Code or any previous Modifications. When Covered Code is released\n                         as a series of files, a Modification is:\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Any addition to or deletion from the contents of a file containing Original Code or\n                                 previous Modifications.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Any new file that contains any part of the Original Code, or previous Modifications.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.10."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Original Code\" means Source Code of computer software code which is described in\n                         the Source Code notice required by Exhibit A as Original Code, and which, at the time of\n                         its release under this License is not already Covered Code governed by this License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.10.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Patent Claims\" means any patent claim(s), now owned or hereafter acquired,\n                         including without limitation, method, process, and apparatus claims, in any patent\n                         Licensable by grantor.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.11."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"Source Code\" means the preferred form of the Covered Code for making modifications\n                         to it, including all modules it contains, plus any associated interface definition files,\n                         scripts used to control compilation and installation of an Executable, or source code\n                         differential comparisons against either the Original Code or another well known, available\n                         Covered Code of the Contributor's choice. The Source Code can be in a compressed or\n                         archival form, provided the appropriate decompression or de-archiving software is widely\n                         available for no charge.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.12."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        \"You\" (or \"Your\") means an individual or a legal entity exercising rights\n                         under, and complying with all of the terms of, this License or a future version of this\n                         License issued under Section 6.1. For legal entities, \"You\" includes any entity\n                         which controls, is controlled by, or is under common control with You. For purposes of\n                         this definition, \"control\" means (a) the power, direct or indirect, to cause the\n                         direction or management of such entity, whether by contract or otherwise, or (b) ownership\n                         of more than fifty percent (50%) of the outstanding shares or beneficial ownership of such\n                         entity.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                SOURCE CODE LICENSE.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        The Initial Developer Grant.\n                        The Initial Developer hereby grants You a world-wide, royalty-free, non-exclusive license,\n                         subject to third party intellectual property claims:\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                under intellectual property rights (other than patent or trademark) Licensable by Initial\n                                 Developer to use, reproduce, modify, display, perform, sublicense and distribute the\n                                 Original Code (or portions thereof) with or without Modifications, and/or as part of a\n                                 Larger Work; and\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                under patents now or hereafter owned or controlled by Initial Developer, to make, have made,\n                                 use and sell (\"offer to sell and import\") the Original Code, Modifications, or\n                                 portions thereof, but solely to the extent that any such patent is reasonably necessary to\n                                 enable You to utilize, alone or in combination with other software, the Original Code,\n                                 Modifications, or any combination or portions thereof.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Contributor Grant.\n                        Subject to third party intellectual property claims, each Contributor hereby grants You a\n                         world-wide, royalty-free, non-exclusive license\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                under intellectual property rights (other than patent or trademark) Licensable by\n                                 Contributor, to use, reproduce, modify, display, perform, sublicense and distribute the\n                                 Modifications created by such Contributor (or portions thereof) either on an unmodified\n                                 basis, with other Modifications, as Covered Code and/or as part of a Larger Work; and\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                under patents now or hereafter owned or controlled by Contributor, to make, have made, use\n                                 and sell (\"offer to sell and import\") the Contributor Version (or portions\n                                 thereof), but solely to the extent that any such patent is reasonably necessary to enable\n                                 You to utilize, alone or in combination with other software, the Contributor Version (or\n                                 portions thereof).\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                DISTRIBUTION OBLIGATIONS.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Application of License.\n                        The Modifications which You create or to which You contribute are governed by the terms of\n                         this License, including without limitation Section 2.2. The Source Code version of\n                         Covered Code may be distributed only under the terms of this License or a future\n                         version of this License released under Section 6.1, and You must include a copy of\n                         this License with every copy of the Source Code You distribute. You may not offer or\n                         impose any terms on any Source Code version that alters or restricts the applicable\n                         version of this License or the recipients' rights hereunder. However, You may\n                         include an additional document offering the additional rights described in Section\n                         3.5.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Availability of Source Code.\n                        Any Modification created by You "}, {"type": "var", "name": "shall", "content": {"type": "text", "content": "shall"}, "pattern": "shall|will"}, {"type": "text", "content": " be provided to the Initial Developer in Source Code\n                         form and are subject to the terms of the License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Description of Modifications.\n                        You must cause all Covered Code to which You contribute to contain a file documenting the\n                         changes You made to create that Covered Code and the date of any change. You must\n                         include a prominent statement that the Modification is derived, directly or\n                         indirectly, from Original Code provided by the Initial Developer and including the\n                         name of the Initial Developer in (a) the Source Code, and (b) in any notice in an\n                         Executable version or related documentation in which You describe the origin or\n                         ownership of the Covered Code.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Intellectual Property Matters.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Third Party Claims. If Contributor has knowledge that a license under a third party's\n                                 intellectual property rights is required to exercise the rights granted by such\n                                 Contributor under Sections 2.1 or 2.2, Contributor must include a text file with the\n                                 Source Code distribution titled \"LEGAL\" which describes the claim and the party\n                                 making the claim in sufficient detail that a recipient will know whom to contact. If\n                                 Contributor obtains such knowledge after the Modification is made available as described\n                                 in Section 3.2, Contributor shall promptly modify the LEGAL file in all copies Contributor\n                                 makes available thereafter and shall take other steps (such as notifying appropriate\n                                 mailing lists or newsgroups) reasonably calculated to inform those who received the\n                                 Covered Code that new knowledge has been obtained.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Contributor APIs. If Contributor's Modifications include an application programming\n                                 interface and Contributor has knowledge of patent licenses which are reasonably necessary\n                                 to implement that API, Contributor must also include this information in the LEGAL\n                                 file.\n                            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                                Representations. Contributor represents that, except as disclosed pursuant to Section 3.4(a)\n                                 above, Contributor believes that Contributor's Modifications are Contributor's\n                                 original creation(s) and/or Contributor has sufficient rights to grant the rights conveyed\n                                 by this License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Required Notices.\n                        You must duplicate the notice in Exhibit A in each file of the Source Code. If it is not\n                         possible to put such notice in a particular Source Code file due to its structure,\n                         then You must include such notice in a location (such as a relevant directory) where a\n                         user would be likely to look for such a notice. If You created one or more\n                         Modification(s) You may add your name as a Contributor to the notice described in\n                         Exhibit A. You must also duplicate this License in any documentation for the Source\n                         Code where You describe recipients' rights or ownership rights relating to\n                         Covered Code. You may choose to offer, and to charge a fee for, warranty, support,\n                         indemnity or liability obligations to one or more recipients of Covered Code. However,\n                         You may do so only on Your own behalf, and not on behalf of the Initial Developer or\n                         any Contributor.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Distribution of Executable Versions.\n                        You may distribute Covered Code in Executable form only if the requirements of Section\n                         3.1-3.5 have been met for that Covered Code. You may distribute the Executable version\n                         of Covered Code or ownership rights under a license of Your choice, which may contain\n                         terms different from this License, provided that You are in compliance with the terms\n                         of this License and that the license for the Executable version does not attempt to\n                         limit or alter the recipient's rights in the Source Code version from the rights\n                         set forth in this License. If You distribute the Executable version under a different\n                         license You must make it absolutely clear that any terms which differ from this\n                         License are offered by You alone, not by the Initial Developer or any Contributor. If\n                         you distribute executable versions containing Covered Code as part of a product, you\n                         must reproduce the notice in Exhibit B in the documentation and/or other materials\n                         provided with the product.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Larger Works.\n                        You may create a Larger Work by combining Covered Code with other code not governed by the\n                         terms of this License and distribute the Larger Work as a single product. In such a\n                         case, You must make sure the requirements of this License are fulfilled for the\n                         Covered Code.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Restrictions.\n                        You may not remove any product identification, copyright, proprietary notices or labels from gSOAP.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                INABILITY TO COMPLY DUE TO STATUTE OR REGULATION.\n                If it is impossible for You to comply with any of the terms of this License with respect to some\n                 or all of the Covered Code due to statute, judicial order, or regulation then You must: (a)\n                 comply with the terms of this License to the maximum extent possible; and (b) describe the\n                 limitations and the code they affect. Such description must be included in the LEGAL file\n                 described in Section 3.4 and must be included with all distributions of the Source Code.\n                 Except to the extent prohibited by statute or regulation, such description must be\n                 sufficiently detailed for a recipient of ordinary skill to be able to understand it.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                APPLICATION OF THIS LICENSE.\n                This License applies to code to which the Initial Developer has attached the notice in Exhibit A\n                 and to related Covered Code.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                VERSIONS OF THE LICENSE.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        New Versions.\n                        Grantor may publish revised and/or new versions of the License from time to time. Each\n                         version will be given a distinguishing version number.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Effect of New Versions.\n                        Once Covered Code has been published under a particular version of the License, You may\n                         always continue to use it under the terms of that version. You may also choose to use\n                         such Covered Code under the terms of any subsequent version of the License.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        Derivative Works.\n                        If You create or use a modified version of this License (which you may only do in order to\n                         apply it to code which is not already Covered Code governed by this License), You must\n                         (a) rename Your license so that the phrase \"gSOAP\" or any confusingly\n                         similar phrase do not appear in your license (except to note that you license differs\n                         from this License) and (b) otherwise make it clear that Your version of the license\n                         contains terms which differ from the gSOAP Public License. (Filling in the name of the\n                         Initial Developer, Original Code or Contributor in the notice described in Exhibit A\n                         shall not of themselves be deemed to be modifications of this License.)\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                DISCLAIMER OF WARRANTY.\n                COVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF\n                 ANY KIND, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, WITHOUT LIMITATION, THE IMPLIED\n                 WARRANTIES OF MERCHANTABILITY, OF FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT OF THIRD\n                 PARTY INTELLECTUAL PROPERTY RIGHTS, AND ANY WARRANTY THAT MAY ARISE BY REASON OF TRADE USAGE,\n                 CUSTOM, OR COURSE OF DEALING. WITHOUT LIMITING THE FOREGOING, YOU ACKNOWLEDGE THAT THE\n                 SOFTWARE IS PROVIDED \"AS IS\" AND THAT THE AUTHORS DO NOT WARRANT THE SOFTWARE WILL\n                 RUN UNINTERRUPTED OR ERROR FREE. LIMITED LIABILITY THE ENTIRE RISK AS TO RESULTS AND\n                 PERFORMANCE OF THE SOFTWARE IS ASSUMED BY YOU. UNDER NO CIRCUMSTANCES WILL THE AUTHORS BE\n                 LIABLE FOR ANY SPECIAL, INDIRECT, INCIDENTAL, EXEMPLARY OR CONSEQUENTIAL DAMAGES OF ANY KIND\n                 OR NATURE WHATSOEVER, WHETHER BASED ON CONTRACT, WARRANTY, TORT (INCLUDING NEGLIGENCE), STRICT\n                 LIABILITY OR OTHERWISE, ARISING OUT OF OR IN ANY WAY RELATED TO THE SOFTWARE, EVEN IF THE\n                 AUTHORS HAVE BEEN ADVISED ON THE POSSIBILITY OF SUCH DAMAGE OR IF SUCH DAMAGE COULD HAVE BEEN\n                 REASONABLY FORESEEN, AND NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY EXCLUSIVE\n                 REMEDY PROVIDED. SUCH LIMITATION ON DAMAGES INCLUDES, BUT IS NOT LIMITED TO, DAMAGES FOR LOSS\n                 OF GOODWILL, LOST PROFITS, LOSS OF DATA OR SOFTWARE, WORK STOPPAGE, COMPUTER FAILURE OR\n                 MALFUNCTION OR IMPAIRMENT OF OTHER GOODS. IN NO EVENT WILL THE AUTHORS BE LIABLE FOR THE COSTS\n                 OF PROCUREMENT OF SUBSTITUTE SOFTWARE OR SERVICES. YOU ACKNOWLEDGE THAT THIS SOFTWARE IS NOT\n                 DESIGNED FOR USE IN ON-LINE EQUIPMENT IN HAZARDOUS ENVIRONMENTS SUCH AS OPERATION OF NUCLEAR\n                 FACILITIES, AIRCRAFT NAVIGATION OR CONTROL, OR LIFE-CRITICAL APPLICATIONS. THE AUTHORS\n                 EXPRESSLY DISCLAIM ANY LIABILITY RESULTING FROM USE OF THE SOFTWARE IN ANY SUCH ON-LINE\n                 EQUIPMENT IN HAZARDOUS ENVIRONMENTS AND ACCEPTS NO LIABILITY IN RESPECT OF ANY ACTIONS OR\n                 CLAIMS BASED ON THE USE OF THE SOFTWARE IN ANY SUCH ON-LINE EQUIPMENT IN HAZARDOUS\n                 ENVIRONMENTS BY YOU. FOR PURPOSES OF THIS PARAGRAPH, THE TERM \"LIFE-CRITICAL\n                 APPLICATION\" MEANS AN APPLICATION IN WHICH THE FUNCTIONING OR MALFUNCTIONING OF THE\n                 SOFTWARE MAY RESULT DIRECTLY OR INDIRECTLY IN PHYSICAL INJURY OR LOSS OF HUMAN LIFE. THIS\n                 DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED\n                 CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                TERMINATION.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        This License and the rights granted hereunder will terminate automatically if You fail to comply\n                         with terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\n                         All sublicenses to the Covered Code which are properly granted shall survive any termination\n                         of this License. Provisions which, by their nature, must remain in effect beyond the\n                         termination of this License shall survive.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        If You assert a patent infringement claim against Participant alleging that such\n                         Participant's Contributor Version directly or indirectly infringes any patent where such\n                         claim is resolved (such as by license or settlement) prior to the initiation of patent\n                         infringement litigation, then the reasonable value of the licenses granted by such Participant\n                         under Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of\n                         any payment or license.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                        In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n                         (excluding distributors and resellers) which have been validly granted by You or any\n                         distributor hereunder prior to termination shall survive termination.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                LIMITATION OF LIABILITY.\n                UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT, OR\n                 OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF COVERED\n                 CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY INDIRECT, SPECIAL,\n                 INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS\n                 OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES\n                 OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\n                 LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH\n                 PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO\n                 NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND\n                 LIMITATION MAY NOT APPLY TO YOU.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                U.S. GOVERNMENT END USERS.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                MISCELLANEOUS.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                RESPONSIBILITY FOR CLAIMS.\n                As between Initial Developer and the Contributors, each party is responsible for claims and damages\n                 arising, directly or indirectly, out of its utilization of rights under this License and You agree to\n                 work with Initial Developer and Contributors to distribute such responsibility on an equitable basis.\n                 Nothing herein is intended or shall be deemed to constitute any admission of liability.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "EXHIBIT A.\n                \"The contents of this file are subject to the gSOAP Public License Version 1.3 (the\n                 \"License\"); you may not use this file except in compliance with the License. You may obtain\n                 a copy of the License at\n                http://www.cs.fsu.edu/ engelen/soaplicense.html\n                Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT\n                 WARRANTY OF ANY KIND, either express or implied. See the License for the specific language\n                 governing rights and limitations under the License.\n                The Original Code of the gSOAP Software is: stdsoap.h, stdsoap2.h, stdsoap.c, stdsoap2.c,\n                 stdsoap.cpp, stdsoap2.cpp, soapcpp2.h, soapcpp2.c, soapcpp2_lex.l, soapcpp2_yacc.y, error2.h,\n                 error2.c, symbol2.c, init2.c, soapdoc2.html, and soapdoc2.pdf, httpget.h, httpget.c, stl.h,\n                 stldeque.h, stllist.h, stlvector.h, stlset.h.\n                The Initial Developer of the Original Code is Robert A. van Engelen. Portions created by Robert A.\n                 van Engelen are Copyright (C) 2001-2004 Robert A. van Engelen, Genivia inc. All Rights\n                 Reserved.\n                Contributor(s):\n                \"________________________.\"\n                [Note: The text of this Exhibit A may differ slightly form the text of the notices in the Source\n                 Code files of the Original code. You should use the text of this Exhibit A rather than the\n                 text found in the Original Code Source Code for Your Modifications.]\n            EXHIBIT B.\n                \"Part of the software embedded in this product is gSOAP software.\n                Portions created by gSOAP are Copyright (C) 2001-2009 Robert A. van Engelen, Genivia inc. All\n                 Rights Reserved.\n                THE SOFTWARE IN THIS PRODUCT WAS IN PART PROVIDED BY GENIVIA INC AND ANY EXPRESS OR IMPLIED\n                 WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n                 FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR\n                 ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\n                 NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n                 BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n                 STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n                 USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\""}}]