[{"type": "optional", "content": {"type": "text", "content": "HTML Tidy License"}}, {"type": "text", "content": "\n      This software and documentation is provided \"as is,\" and the copyright holders and\n      contributing author(s) make no representations or warranties, express or implied, including\n      but not limited to, warranties of merchantability or fitness for any particular purpose or that\n      the use of the software or documentation will not infringe any third party patents, copyrights,\n      trademarks or other rights.\n      The copyright holders and contributing author(s) will not be held liable for any direct,\n      indirect, special or consequential damages arising out of any use of the software or\n      documentation, even if advised of the possibility of such damage.\n      Permission is hereby granted to use, copy, modify, and distribute this source code, or\n      portions hereof, documentation and executables, for any purpose, without fee, subject to the\n      following restrictions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            The origin of this source code must not be misrepresented.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Altered versions must be plainly marked as such and must not be misrepresented as\n            being the original source.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            This Copyright notice may not be removed or altered from any source or altered source\n            distribution.\n      The copyright holders and contributing author(s) specifically permit, without fee, and\n      encourage the use of this source code as a component for supporting the Hypertext Markup\n      Language in commercial products. If you use this source code in a product, acknowledgement\n      is not required but would be appreciated."}]