[{"type": "optional", "content": {"type": "text", "content": "Independent JPEG Group License"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": [{"type": "text", "content": "LEGAL ISSUES\n         In plain English:\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          We don't promise that this software works. (But if you find any bugs, please let us know!)\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You can use this software for whatever you want. You don't have to pay us.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may not pretend that you wrote this software. If you use it in a program, you must\n             acknowledge somewhere in your documentation that you've used the IJG code.\n         In legalese:"}]}, {"type": "text", "content": "\n\n      The authors make NO WARRANTY or representation, either express or implied, with respect to this software,\n         its quality, accuracy, merchantability, or fitness for a particular purpose. This software is provided\n         \"AS IS\", and you, its user, assume the entire risk as to its quality and accuracy.\n      This software is copyright (C) 1991-1998, Thomas G. Lane. All Rights Reserved except as specified below.\n      Permission is hereby granted to use, copy, modify, and distribute this software (or portions thereof) for\n         any purpose, without fee, subject to these conditions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If any part of the source code for this software is distributed, then this README file must\n             be included, with this copyright and no-warranty notice unaltered; and any additions,\n             deletions, or changes to the original files must be clearly indicated in accompanying\n             documentation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If only executable code is distributed, then the accompanying documentation must state that\n             \"this software is based in part on the work of the Independent JPEG Group\".\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Permission for use of this software is granted only if the user accepts full responsibility\n             for any undesirable consequences; the authors accept NO LIABILITY for damages of any\n             kind.\n      These conditions apply to any software derived from or based on the IJG code, not just to the unmodified\n         library. If you use our work, you ought to acknowledge us.\n      Permission is NOT granted for the use of any IJG author's name or company name in advertising or\n         publicity relating to this software or products derived from it. This software may be referred to only\n         as \"the Independent JPEG Group's software\".\n      We specifically permit and encourage the use of this software as the basis of commercial products,\n         provided that all warranty or liability claims are assumed by the product vendor.\n      ansi2knr.c is included in this distribution by permission of L. Peter Deutsch, sole proprietor of its\n         copyright holder, Aladdin Enterprises of Menlo Park, CA. ansi2knr.c is NOT covered by the above\n         copyright and conditions, but instead by the usual distribution terms of the Free Software Foundation;\n         principally, that you must include source code if you redistribute it. (See the file ansi2knr.c for\n         full details.) However, since ansi2knr.c is not needed as part of any program generated from the IJG\n         code, this does not limit you more than the foregoing paragraphs do.\n      The Unix configuration script \"configure\" was produced with GNU Autoconf. It is copyright by\n         the Free Software Foundation but is freely distributable. The same holds for its supporting scripts\n         (config.guess, config.sub, ltconfig, ltmain.sh). Another support script, install-sh, is copyright by\n         M.I.T. but is also freely distributable.\n      It appears that the arithmetic coding option of the JPEG spec is covered by patents owned by IBM,\n         AT&T, and Mitsubishi. Hence arithmetic coding cannot legally be used without obtaining one or more\n         licenses. For this reason, support for arithmetic coding has been removed from the free JPEG software.\n         (Since arithmetic coding provides only a marginal gain over the unpatented Huffman mode, it is\n         unlikely that very many implementations will support it.) So far as we are aware, there are no patent\n         restrictions on the remaining code.\n      The IJG distribution formerly included code to read and write GIF files. To avoid entanglement with the\n         Unisys LZW patent, GIF reading support has been removed altogether, and the GIF writer has been\n         simplified to produce \"uncompressed GIFs\". This technique does not use the LZW algorithm;\n         the resulting GIF files are larger than usual, but are readable by all standard GIF decoders.\n      We are required to state that\n        \"The Graphics Interchange Format(c) is the Copyright property of CompuServe Incorporated.\n             GIF(sm) is a Service Mark property of CompuServe Incorporated.\""}]