[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nBefore we get to the text of the license, lets just review what the license says in simple terms:\nIt allows you to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nfreely download and use ImageMagick software, in whole or in part, for personal, company\ninternal, or commercial purposes;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse ImageMagick software in packages or distributions that you create;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nlink against a library under a different license;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nlink code under a different license against a library under this license;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nmerge code into a work under a different license;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nextend patent grants to any code using code under this license;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nand extend patent protection.\nIt forbids you to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nredistribute any piece of ImageMagick-originated software without proper attribution;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse any marks owned by ImageMagick Studio LLC in any way that might state or imply that\nImageMagick Studio LLC endorses your distribution;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse any marks owned by ImageMagick Studio LLC in any way that might state or imply that you\ncreated the ImageMagick software in question.\nIt requires you to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninclude a copy of the license in any redistribution you may make that includes ImageMagick software;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nprovide clear attribution to ImageMagick Studio LLC for any distributions that include\nImageMagick software.\nIt does not require you to:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ninclude the source of the ImageMagick software itself, or of any modifications you may have\nmade to it, in any redistribution you may assemble that includes it;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsubmit changes that you make to the software back to the ImageMagick Studio LLC (though such\nfeedback is encouraged).\nA few other clarifications include:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nImageMagick is freely available without charge;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nyou may include ImageMagick on a DVD as long as you comply with the terms of the license;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nyou can give modified code away for free or sell it under the terms of the ImageMagick\nlicense or distribute the result under a different license, but you need to acknowledge\nthe use of the ImageMagick software;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe license is compatible with the GPL V3.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "*"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nwhen exporting the ImageMagick software, review its export classification.\n"}]}, {"tag": "text", "content": "\nTerms and Conditions for Use, Reproduction, and Distribution\nThe legally binding and authoritative terms and conditions for use, reproduction, and distribution of\nImageMagick follow:\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nCopyright 1999-2013 ImageMagick Studio LLC, a non-profit organization dedicated to making software\nimaging solutions freely available.\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\nLicense shall mean the terms and conditions for use, reproduction, and distribution as defined by\nSections 1 through 9 of this document.\nLicensor shall mean the copyright owner or entity authorized by the copyright owner that is\ngranting the License.\nLegal Entity shall mean the union of the acting entity and all other entities that control, are\ncontrolled by, or are under common control with that entity. For the purposes of this\ndefinition, control means (i) the power, direct or indirect, to cause the direction or\nmanagement of such entity, whether by contract or otherwise, or (ii) ownership of fifty\npercent (50%) or more of the outstanding shares, or (iii) beneficial ownership of such\nentity.\nYou (or Your) shall mean an individual or Legal Entity exercising permissions granted by this License.\nSource form shall mean the preferred form for making modifications, including but not limited to\nsoftware source code, documentation source, and configuration files.\nObject form shall mean any form resulting from mechanical transformation or translation of a\nSource form, including but not limited to compiled object code, generated documentation, and\nconversions to other media types.\nWork shall mean the work of authorship, whether in Source or Object form, made available under\nthe License, as indicated by a copyright notice that is included in or attached to the work\n(an example is provided in the Appendix below).\nDerivative Works shall mean any work, whether in Source or Object form, that is based on (or\nderived from) the Work and for which the editorial revisions, annotations, elaborations, or\nother modifications represent, as a whole, an original work of authorship. For the purposes of\nthis License, Derivative Works shall not include works that remain separable from, or merely\nlink (or bind by name) to the interfaces of, the Work and Derivative Works thereof.\nContribution shall mean any work of authorship, including the original version of the Work and\nany modifications or additions to that Work or Derivative Works thereof, that is intentionally\nsubmitted to Licensor for inclusion in the Work by the copyright owner or by an individual or\nLegal Entity authorized to submit on behalf of the copyright owner. For the purposes of this\ndefinition, \"submitted\" means any form of electronic, verbal, or written communication sent to\nthe Licensor or its representatives, including but not limited to communication on electronic\nmailing lists, source code control systems, and issue tracking systems that are managed by, or\non behalf of, the Licensor for the purpose of discussing and improving the Work, but excluding\ncommunication that is conspicuously marked or otherwise designated in writing by the copyright\nowner as Not a Contribution.\nContributor shall mean Licensor and any individual or Legal Entity on behalf of whom a\nContribution has been received by Licensor and subsequently incorporated within the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of Copyright License. Subject to the terms and conditions of this License, each Contributor\nhereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable copyright license to reproduce, prepare Derivative Works of, publicly display,\npublicly perform, sublicense, and distribute the Work and such Derivative Works in Source or\nObject form.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant of Patent License. Subject to the terms and conditions of this License, each Contributor\nhereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free,\nirrevocable patent license to make, have made, use, offer to sell, sell, import, and otherwise\ntransfer the Work, where such license applies only to those patent claims licensable by such\nContributor that are necessarily infringed by their Contribution(s) alone or by combination of\ntheir Contribution(s) with the Work to which such Contribution(s) was submitted. If You\ninstitute patent litigation against any entity (including a cross-claim or counterclaim in a\nlawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes\ndirect or contributory patent infringement, then any patent licenses granted to You under this\nLicense for that Work shall terminate as of the date such litigation is filed.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRedistribution. You may reproduce and distribute copies of the Work or Derivative Works thereof\nin any medium, with or without modifications, and in Source or Object form, provided that You\nmeet the following conditions:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must give any other recipients of the Work or Derivative Works a copy of this License; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must cause any modified files to carry prominent notices stating that You changed the files; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must retain, in the Source form of any Derivative Works that You distribute, all\ncopyright, patent, trademark, and attribution notices from the Source form of the Work,\nexcluding those notices that do not pertain to any part of the Derivative Works; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf the Work includes a \"NOTICE\" text file as part of its distribution, then any Derivative\nWorks that You distribute must include a readable copy of the attribution notices\ncontained within such NOTICE file, excluding those notices that do not pertain to any part\nof the Derivative Works, in at least one of the following places: within a NOTICE text\nfile distributed as part of the Derivative Works; within the Source form or documentation,\nif provided along with the Derivative Works; or, within a display generated by the\nDerivative Works, if and wherever such third-party notices normally appear. The contents\nof the NOTICE file are for informational purposes only and do not modify the License. You\nmay add Your own attribution notices within Derivative Works that You distribute,\nalongside or as an addendum to the NOTICE text from the Work, provided that such\nadditional attribution notices cannot be construed as modifying the License.\nYou may add Your own copyright statement to Your modifications and may provide additional or\ndifferent license terms and conditions for use, reproduction, or distribution of Your\nmodifications, or for any such Derivative Works as a whole, provided Your use,\nreproduction, and distribution of the Work otherwise complies with the conditions stated\nin this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubmission of Contributions. Unless You explicitly state otherwise, any Contribution\nintentionally submitted for inclusion in the Work by You to the Licensor shall be under the\nterms and conditions of this License, without any additional terms or conditions.\nNotwithstanding the above, nothing herein shall supersede or modify the terms of any separate\nlicense agreement you may have executed with Licensor regarding such Contributions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademarks. This License does not grant permission to use the trade names, trademarks, service\nmarks, or product names of the Licensor, except as required for reasonable and customary use\nin describing the origin of the Work and reproducing the content of the NOTICE file.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty. Unless required by applicable law or agreed to in writing, Licensor\nprovides the Work (and each Contributor provides its Contributions) on an AS IS BASIS, WITHOUT\nWARRANTIES OR CONDITIONS OF ANY KIND, either express or implied, including, without\nlimitation, any warranties or conditions of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or\nFITNESS FOR A PARTICULAR PURPOSE. You are solely responsible for determining the\nappropriateness of using or redistributing the Work and assume any risks associated with Your\nexercise of permissions under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability. In no event and under no legal theory, whether in tort (including\nnegligence), contract, or otherwise, unless required by applicable law (such as deliberate and\ngrossly negligent acts) or agreed to in writing, shall any Contributor be liable to You for\ndamages, including any direct, indirect, special, incidental, or consequential damages of any\ncharacter arising as a result of this License or out of the use or inability to use the Work\n(including but not limited to damages for loss of goodwill, work stoppage, computer failure or\nmalfunction, or any and all other commercial damages or losses), even if such Contributor has\nbeen advised of the possibility of such damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAccepting Warranty or Additional Liability. While redistributing the Work or Derivative Works\nthereof, You may choose to offer, and charge a fee for, acceptance of support, warranty,\nindemnity, or other liability obligations and/or rights consistent with this License. However,\nin accepting such obligations, You may act only on Your own behalf and on Your sole\nresponsibility, not on behalf of any other Contributor, and only if You agree to indemnify,\ndefend, and hold each Contributor harmless for any liability incurred by, or claims asserted\nagainst, such Contributor by reason of your accepting any such warranty or additional\nliability.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nHow to Apply the License to your Work\nTo apply the ImageMagick License to your work, attach the following boilerplate notice, with the fields\nenclosed by brackets \"[]\" replaced with your own identifying information (don't include the brackets).\nThe text should be enclosed in the appropriate comment syntax for the file format. We also recommend\nthat a file or class name and description of purpose be included on the same \"printed page\" as the\ncopyright notice for easier identification within third-party archives.\nCopyright [yyyy] [name of copyright owner]\nLicensed under the ImageMagick License (the \"License\"); you may not use this file except in compliance\nwith the License. You may obtain a copy of the License at\nhttp://www.imagemagick.org/script/license.php\nUnless required by applicable law or agreed to in writing, software distributed under the License is\ndistributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\nimplied. See the License for the specific language governing permissions and limitations under the\nLicense.\n"}]}, {"tag": "text", "content": "\n"}]