[{"type": "optional", "content": {"type": "text", "content": "The SFL License Agreement"}}, {"type": "text", "content": "\n\n      This license agreement covers your use of the iMatix STANDARD FUNCTION LIBRARY (SFL), its source code,\n         documentation, and executable files, hereinafter referred to as \"the Product\".\n      The Product is Copyright (c) 1991-2000 iMatix Corporation. You may use it and distribute it according to\n         this following License Agreement. If you do not agree with these terms, please remove the Product from\n         your system. By incorporating the Product in your work or distributing the Product to others you\n         implicitly agree to these license terms.\n      Statement Of Copyright\n      The Product is, and remains, Copyright © 1991-2000 iMatix Corporation, with exception of specific\n         copyrights as noted in the individual source files.\n      Conditions Of Use\n      You do not need to provide the source code for the Product as part of your product. However, you must do\n         one of these things to comply with the Product License Agreement:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Provide the source code for Product modules that you use, or\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Make your product freely available according to a license similar to the GNU General Public\n             License, or the Perl Artistic License, or\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Add this phrase to the documentation for your product: \"This product uses parts of the iMatix\n             SFL, Copyright © 1991-2000 iMatix Corporation <http://www.imatix.com>\".\n      Rights Of Usage\n      You may freely and at no cost use the Product in any project, commercial, academic, military, or private,\n           so long as you respect the License Agreement. The License Agreement does not affect any software\n           except the Product. In particular, any application that uses the Product does not itself fall under\n           the License Agreement.\n        You may modify any part of the Product, including sources and documentation, except this License\n           Agreement, which you may not modify.\n        You must clearly indicate any modifications at the start of each source file. The user of any modified\n           Product code must know that the source file is not original.\n        At your discretion, you may rewrite or reuse any part of the Product so that your derived code is not\n           obviously part of the Product. This derived code does not fall under the Product License Agreement\n           directly, but you must include a credit at the start of each source file indicating the original\n           authorship and source of the code, and a statement of copyright as follows:\n            \"Parts copyright (c) 1991-2000 iMatix Corporation.\"\n        Rights Of Distribution\n        You may freely distribute the Product, or any subset of the Product, by any means. The License, in\n             the form of the file called \"LICENSE.TXT\" must accompany any such distribution.\n          You may charge a fee for distributing the Product, for providing a warranty on the Product, for\n             making modifications to the Product, or for any other service provided in relation to the Product.\n             You are not required to ask our permission for any of these activities.\n          At no time will iMatix associate itself with any distribution of the Product except that supplied\n             from the Internet site http://www.imatix.com.\n        Disclaimer Of Warranty\n        The Product is provided as free software, in the hope that it will be useful. It is provided \"as-is\",\n             without warranty of any kind, either expressed or implied, including, but not limited to, the\n             implied warranties of merchantability and fitness for a particular purpose. The entire risk as to\n             the quality and performance of the Product is with you. Should the Product prove defective, the\n             full cost of repair, servicing, or correction lies with you."}]