[{"type": "optional", "content": {"type": "text", "content": "Info-ZIP License"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 1990-2009 Info-ZIP. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      For the purposes of this copyright and license, \"Info-ZIP\" is defined as the following set of\n         individuals:\n      Mark Adler, John Bush, Karl Davis, Harald Denker, Jean-Michel Dubois, Jean-loup Gailly, Hunter Goatley,\n         Ed Gordon, Ian Gorman, Chris Herborth, Dirk Haase, Greg Hartwig, Robert Heath, Jonathan Hudson, Paul\n         Kienitz, David Kirschbaum, Johnny Lee, Onno van der Linden, Igor Mandrichenko, Steve P. Miller, Sergio\n         Monesi, Keith Owens, George Petrov, Greg Roelofs, Kai Uwe Rommel, Steve Salisbury, Dave Smith, Steven\n         M. Schweda, Christian Spieler, Cosmin Truta, Antoine Verheijen, Paul von Behren, Rich Wales, Mike\n         White.\n      This software is provided \"as is,\" without warranty of any kind, express or implied. In no\n         event shall Info-ZIP or its contributors be held liable for any direct, indirect, incidental, special\n         or consequential damages arising out of the use of or inability to use this software.\n      Permission is granted to anyone to use this software for any purpose, including commercial applications,\n         and to alter it and redistribute it freely, subject to the above disclaimer and the following\n         restrictions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code (in whole or in part) must retain the above copyright notice,\n             definition, disclaimer, and this list of conditions.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form (compiled executables and libraries) must reproduce the above\n             copyright notice, definition, disclaimer, and this list of conditions in documentation\n             and/or other materials provided with the distribution. Additional documentation is not\n             needed for executables where a command line license option provides these and a note\n             regarding this option is in the executable's startup banner. The sole exception to\n             this condition is redistribution of a standard UnZipSFX binary (including SFXWiz) as part\n             of a self-extracting archive; that is permitted without inclusion of this license, as long\n             as the normal SFX banner has not been removed from the binary or disabled.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Altered versions--including, but not limited to, ports to new operating systems, existing\n             ports with new graphical interfaces, versions with modified or added functionality, and\n             dynamic, shared, or static library versions not from Info-ZIP--must be plainly marked as\n             such and must not be misrepresented as being the original source or, if binaries, compiled\n             from the original source. Such altered versions also must not be misrepresented as being\n             Info-ZIP releases--including, but not limited to, labeling of the altered versions with\n             the names \"Info-ZIP\" (or any variation thereof, including, but not limited to,\n             different capitalizations), \"Pocket UnZip,\" \"WiZ\" or\n             \"MacZip\" without the explicit permission of Info-ZIP. Such altered versions are\n             further prohibited from misrepresentative use of the Zip-Bugs or Info-ZIP e-mail addresses\n             or the Info-ZIP URL(s), such as to imply Info-ZIP will provide support for the altered\n             versions.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Info-ZIP retains the right to use the names \"Info-ZIP,\" \"Zip,\"\n             \"UnZip,\" \"UnZipSFX,\" \"WiZ,\" \"Pocket UnZip,\"\n             \"Pocket Zip,\" and \"MacZip\" for its own source and binary releases."}]