[{"type": "optional", "content": {"type": "text", "content": "Intel Open Source License"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 1996-2000 Intel Corporation\n           All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the above copyright notice, this list of\n             conditions and the following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of\n             conditions and the following disclaimer in the documentation and/or other materials\n             provided with the distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Neither the name of the Intel Corporation nor the names of its contributors may be used to\n             endorse or promote products derived from this software without specific prior written\n             permission.\n      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR\n         IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n         FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE INTEL OR CONTRIBUTORS BE LIABLE\n         FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n         LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n         INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n         TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\n         ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n      EXPORT LAWS: THIS LICENSE ADDS NO RESTRICTIONS TO THE EXPORT LAWS OF YOUR JURISDICTION. It is\n         licensee's responsibility to comply with any export regulations applicable in licensee's\n         jurisdiction. Under CURRENT (May 2000) U.S. export regulations this software is eligible for export\n         from the U.S. and can be downloaded by or otherwise exported or reexported worldwide EXCEPT to U.S.\n         embargoed destinations which include Cuba, Iraq, Libya, North Korea, Iran, Syria, Sudan, Afghanistan\n         and any other country to which the U.S. has embargoed goods and services."}]