[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nINTERBASE PUBLIC LICENSE\nVersion 1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.0.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Commercial Use\" means distribution or otherwise making the Covered Code\navailable to a third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Contributor'' means each entity that creates or contributes to the creation\nof Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Contributor Version'' means the combination of the Original Code, prior\nModifications used by a Contributor, and the Modifications made by that particular\nContributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Covered Code'' means the Original Code or Modifications or the combination\nof the Original Code and Modifications, in each case including portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Electronic Distribution Mechanism'' means a mechanism generally accepted in\nthe software development community for the electronic transfer of data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Executable'' means Covered Code in any form other than Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Initial Developer'' means the individual or entity identified as the\nInitial Developer in the Source Code notice required by Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Larger Work'' means a work which combines Covered Code or portions thereof\nwith code not governed by the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''License'' means this document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Licensable\" means having the right to grant, to the maximum extent possible,\nwhether at the time of the initial grant or subsequently acquired, any and all of the rights\nconveyed herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Modifications'' means any addition to or deletion from the substance or\nstructure of either the Original Code or any previous Modifications. When Covered Code is\nreleased as a series of files, a Modification is:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "A."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny addition to or deletion from the contents of a file containing Original Code or previous\nModifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "B."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Original Code'' means Source Code of computer software code which is\ndescribed in the Source Code notice required by Exhibit A as Original Code, and which, at the\ntime of its release under this License is not already Covered Code governed by this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Patent Claims\" means any patent claim(s), now owned or hereafter acquired,\nincluding without limitation, method, process, and apparatus claims, in any patent Licensable\nby grantor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n''Source Code'' means the preferred form of the Covered Code for making\nmodifications to it, including all modules it contains, plus any associated interface\ndefinition files, scripts used to control compilation and installation of an Executable, or\nsource code differential comparisons against either the Original Code or another well known,\navailable Covered Code of the Contributor's choice. The Source Code can be in a\ncompressed or archival form, provided the appropriate decompression or de-archiving software\nis widely available for no charge.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You'' (or \"Your\") means an individual or a legal entity exercising\nrights under, and complying with all of the terms of, this License or a future version of this\nLicense issued under Section 6.1. For legal entities, \"You'' includes any\nentity which controls, is controlled by, or is under common control with You. For purposes of\nthis definition, \"control'' means (a) the power, direct or indirect, to cause\nthe direction or management of such entity, whether by contract or otherwise, or (b) ownership\nof more than fifty percent (50%) of the outstanding shares or beneficial ownership of such\nentity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSource Code License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Initial Developer Grant.\nThe Initial Developer hereby grants You a world-wide, royalty-free, non-exclusive license,\nsubject to third party intellectual property claims:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Initial\nDeveloper to use, reproduce, modify, display, perform, sublicense and distribute the\nOriginal Code (or portions thereof) with or without Modifications, and/or as part of a\nLarger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patents Claims infringed by the making, using or selling of Original Code, to make,\nhave made, use, practice, sell, and offer for sale, and/or otherwise dispose of the\nOriginal Code (or portions thereof).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in this Section 2.1(a) and (b) are effective on the date Initial\nDeveloper first distributes Original Code under the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.1(b) above, no patent license is granted: 1) for code that You\ndelete from the Original Code; 2) separate from the Original Code; or 3) for infringements\ncaused by: i) the modification of the Original Code or ii) the combination of the Original\nCode with other software or devices.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor Grant.\nSubject to third party intellectual property claims, each Contributor hereby grants You a\nworld-wide, royalty-free, non-exclusive license\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by\nContributor, to use, reproduce, modify, display, perform, sublicense and distribute the\nModifications created by such Contributor (or portions thereof) either on an unmodified\nbasis, with other Modifications, as Covered Code and/or as part of a Larger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by that\nContributor either alone and/or in combination with its Contributor Version (or portions\nof such combination), to make, use, sell, offer for sale, have made, and/or otherwise\ndispose of: 1) Modifications made by that Contributor (or portions thereof); and 2) the\ncombination of Modifications made by that Contributor with its Contributor Version (or\nportions of such combination).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in Sections 2.2(a) and 2.2(b) are effective on the date Contributor\nfirst makes Commercial Use of the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.2(b) above, no patent license is granted: 1) for any code that\nContributor has deleted from the Contributor Version; 2) separate from the Contributor\nVersion; 3) for infringements caused by: i) third party modifications of Contributor\nVersion or ii) the combination of Modifications made by that Contributor with other\nsoftware (except as part of the Contributor Version) or other devices; or 4) under Patent\nClaims infringed by Covered Code in the absence of Modifications made by that\nContributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution Obligations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of License.\nThe Modifications which You create or to which You contribute are governed by the terms of this\nLicense, including without limitation Section 2.2. The Source Code version of Covered Code may\nbe distributed only under the terms of this License or a future version of this License\nreleased under Section 6.1, and You must include a copy of this License with every copy of the\nSource Code You distribute. You may not offer or impose any terms on any Source Code version\nthat alters or restricts the applicable version of this License or the recipients' rights\nhereunder. However, You may include an additional document offering the additional rights\ndescribed in Section 3.5.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAvailability of Source Code.\nAny Modification which You create or to which You contribute must be made available in Source\nCode form under the terms of this License either on the same media as an Executable version or\nvia an accepted Electronic Distribution Mechanism to anyone to whom you made an Executable\nversion available; and if made available via Electronic Distribution Mechanism, must remain\navailable for at least twelve (12) months after the date it initially became available, or at\nleast six (6) months after a subsequent version of that particular Modification has been made\navailable to such recipients. You are responsible for ensuring that the Source Code version\nremains available even if the Electronic Distribution Mechanism is maintained by a third\nparty.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDescription of Modifications.\nYou must cause all Covered Code to which You contribute to contain a file documenting the changes\nYou made to create that Covered Code and the date of any change. You must include a prominent\nstatement that the Modification is derived, directly or indirectly, from Original Code\nprovided by the Initial Developer and including the name of the Initial Developer in (a) the\nSource Code, and (b) in any notice in an Executable version or related documentation in which\nYou describe the origin or ownership of the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property Matters\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Claims.\nIf Contributor has knowledge that a license under a third party's intellectual property\nrights is required to exercise the rights granted by such Contributor under Sections 2.1\nor 2.2, Contributor must include a text file with the Source Code distribution titled\n\"LEGAL'' which describes the claim and the party making the claim in\nsufficient detail that a recipient will know whom to contact. If Contributor obtains such\nknowledge after the Modification is made available as described in Section 3.2,\nContributor shall promptly modify the LEGAL file in all copies Contributor makes available\nthereafter and shall take other steps (such as notifying appropriate mailing lists or\nnewsgroups) reasonably calculated to inform those who received the Covered Code that new\nknowledge has been obtained.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor APIs.\nIf Contributor's Modifications include an application programming interface and\nContributor has knowledge of patent licenses which are reasonably necessary to implement\nthat API, Contributor must also include this information in the LEGAL file.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentations.\nContributor represents that, except as disclosed pursuant to Section 3.4(a) above,\nContributor believes that Contributor's Modifications are Contributor's original\ncreation(s) and/or Contributor has sufficient rights to grant the rights conveyed by this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRequired Notices.\nYou must duplicate the notice in Exhibit A in each file of the Source Code. If it is not possible\nto put such notice in a particular Source Code file due to its structure, then You must\ninclude such notice in a location (such as a relevant directory) where a user would be likely\nto look for such a notice. If You created one or more Modification(s) You may add your name as\na Contributor to the notice described in Exhibit A. You must also duplicate this License in\nany documentation for the Source Code where You describe recipients' rights or ownership\nrights relating to Covered Code. You may choose to offer, and to charge a fee for, warranty,\nsupport, indemnity or liability obligations to one or more recipients of Covered Code.\nHowever, You may do so only on Your own behalf, and not on behalf of the Initial Developer or\nany Contributor. You must make it absolutely clear than any such warranty, support, indemnity\nor liability obligation is offered by You alone, and You hereby agree to indemnify the Initial\nDeveloper and every Contributor for any liability incurred by the Initial Developer or such\nContributor as a result of warranty, support, indemnity or liability terms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Versions.\nYou may distribute Covered Code in Executable form only if the requirements of Section 3.1-3.5\nhave been met for that Covered Code, and if You include a notice stating that the Source Code\nversion of the Covered Code is available under the terms of this License, including a\ndescription of how and where You have fulfilled the obligations of Section 3.2. The notice\nmust be conspicuously included in any notice in an Executable version, related documentation\nor collateral in which You describe recipients' rights relating to the Covered Code. You\nmay distribute the Executable version of Covered Code or ownership rights under a license of\nYour choice, which may contain terms different from this License, provided that You are in\ncompliance with the terms of this License and that the license for the Executable version does\nnot attempt to limit or alter the recipient's rights in the Source Code version from the\nrights set forth in this License. If You distribute the Executable version under a different\nlicense You must make it absolutely clear that any terms which differ from this License are\noffered by You alone, not by the Initial Developer or any Contributor. You hereby agree to\nindemnify the Initial Developer and every Contributor for any liability incurred by the\nInitial Developer or such Contributor as a result of any such terms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works.\nYou may create a Larger Work by combining Covered Code with other code not governed by the terms\nof this License and distribute the Larger Work as a single product. In such a case, You must\nmake sure the requirements of this License are fulfilled for the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect to some\nor all of the Covered Code due to statute, judicial order, or regulation then You must: (a)\ncomply with the terms of this License to the maximum extent possible; and (b) describe the\nlimitations and the code they affect. Such description must be included in the LEGAL file\ndescribed in Section 3.4 and must be included with all distributions of the Source Code.\nExcept to the extent prohibited by statute or regulation, such description must be\nsufficiently detailed for a recipient of ordinary skill to be able to understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of this License.\nThis License applies to code to which the Initial Developer has attached the notice in Exhibit A\nand to related Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions.\nBorland Software Corporation (''Interbase'') may publish revised and/or new\nversions of the License from time to time. Each version will be given a distinguishing version\nnumber.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions.\nOnce Covered Code has been published under a particular version of the License, You may always\ncontinue to use it under the terms of that version. You may also choose to use such Covered\nCode under the terms of any subsequent version of the License published by Interbase. No one\nother than Interbase has the right to modify the terms applicable to Covered Code created\nunder this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDerivative Works.\nIf You create or use a modified version of this License (which you may only do in order to apply\nit to code which is not already Covered Code governed by this License), You must (a) rename\nYour license so that the phrases ''Mozilla'',\n''MOZILLAPL'', ''MOZPL'',\n''Netscape'', \"MPL\", ''NPL\",\n\"Interbase\", \"ISC\", \"IB'' or any confusingly similar phrase\ndo not appear in your license (except to note that your license differs from this License) and\n(b) otherwise make it clear that Your version of the license contains terms which differ from\nthe Mozilla Public License and Netscape Public License. (Filling in the name of the Initial\nDeveloper, Original Code or Contributor in the notice described in Exhibit A shall not of\nthemselves be deemed to be modifications of this License.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOrigin of the Interbase Public License.\nThe Interbase public license is based on the Mozilla Public License V 1.1 with the following changes:\nThe license is published by Borland Software Corporation. Only Borland Software Corporation\ncan modify the terms applicable to Covered Code.\nThe license can be modified used for code which is not already governed by this license.\nModified versions of the license must be renamed to avoid confusion with Netscape?s or\nInterbase Software?s license and must include a description of changes from the\nInterbase Public License.\nThe name of the license in Exhibit A is the \"Interbase Public License\".\nThe reference to an alternative license in Exhibit A has been removed.\nAmendments I, II, III, V, and VI have been deleted.\nExhibit A, Netscape Public License has been deleted\nA new amendment (II) has been added, describing the required and restricted rights to use\nthe trademarks of Borland Software Corporation\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISCLAIMER OF WARRANTY.\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS'' BASIS, WITHOUT WARRANTY\nOF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\nCOVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING.\nTHE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY\nCOVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER\nCONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER\nOF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS\nAUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTERMINATION.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to comply\nwith terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\nAll sublicenses to the Covered Code which are properly granted shall survive any termination\nof this License. Provisions which, by their nature, must remain in effect beyond the\ntermination of this License shall survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You initiate litigation by asserting a patent infringement claim (excluding declatory judgment\nactions) against Initial Developer or a Contributor (the Initial Developer or Contributor\nagainst whom You file such action is referred to as \"Participant\") alleging\nthat:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsuch Participant's Contributor Version directly or indirectly infringes any patent, then\nany and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of\nthis License shall, upon 60 days notice from Participant terminate prospectively, unless\nif within 60 days after receipt of notice You either: (i) agree in writing to pay\nParticipant a mutually agreeable reasonable royalty for Your past and future use of\nModifications made by such Participant, or (ii) withdraw Your litigation claim with\nrespect to the Contributor Version against such Participant. If within 60 days of notice,\na reasonable royalty and payment arrangement are not mutually agreed upon in writing by\nthe parties or the litigation claim is not withdrawn, the rights granted by Participant to\nYou under Sections 2.1 and/or 2.2 automatically terminate at the expiration of the 60 day\nnotice period specified above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany software, hardware, or device, other than such Participant's Contributor Version,\ndirectly or indirectly infringes any patent, then any rights granted to You by such\nParticipant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You\nfirst made, used, sold, distributed, or had made, Modifications made by that\nParticipant.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such\nParticipant's Contributor Version directly or indirectly infringes any patent where such\nclaim is resolved (such as by license or settlement) prior to the initiation of patent\ninfringement litigation, then the reasonable value of the licenses granted by such Participant\nunder Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of\nany payment or license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT,\nOR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\nCOVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR ANY\nINDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING, WITHOUT\nLIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR MALFUNCTION, OR\nANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF\nTHE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR\nDEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE\nLAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF\nINCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT APPLY TO\nYOU.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nU.S. GOVERNMENT END USERS.\nThe Covered Code is a ''commercial item,'' as that term is defined in 48\nC.F.R. 2.101 (Oct. 1995), consisting of ''commercial computer software''\nand ''commercial computer software documentation,'' as such terms are used\nin 48 C.F.R. 12.212 (Sept. 1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1\nthrough 227.7202-4 (June 1995), all U.S. Government End Users acquire Covered Code with only\nthose rights set forth herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMISCELLANEOUS.\nThis License represents the complete agreement concerning subject matter hereof. If any provision\nof this License is held to be unenforceable, such provision shall be reformed only to the\nextent necessary to make it enforceable. This License shall be governed by California law\nprovisions (except to the extent applicable law, if any, provides otherwise), excluding its\nconflict-of-law provisions. With respect to disputes in which at least one party is a citizen\nof, or an entity chartered or registered to do business in the United States of America, any\nlitigation relating to this License shall be subject to the jurisdiction of the Federal Courts\nof the Northern District of California, with venue lying in Santa Clara County, California,\nwith the losing party responsible for costs, including without limitation, court costs and\nreasonable attorneys' fees and expenses. The application of the United Nations Convention\non Contracts for the International Sale of Goods is expressly excluded. Any law or regulation\nwhich provides that the language of a contract shall be construed against the drafter shall\nnot apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRESPONSIBILITY FOR CLAIMS.\nAs between Initial Developer and the Contributors, each party is responsible for claims and\ndamages arising, directly or indirectly, out of its utilization of rights under this License\nand You agree to work with Initial Developer and Contributors to distribute such\nresponsibility on an equitable basis. Nothing herein is intended or shall be deemed to\nconstitute any admission of liability.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMULTIPLE-LICENSED CODE.\nInitial Developer may designate portions of the Covered Code as \"Multiple-Licensed\".\n\"Multiple-Licensed\" means that the Initial Developer permits you to utilize portions\nof the Covered Code under Your choice of the NPL or the alternative licenses, if any,\nspecified by the Initial Developer in the file described in Exhibit A.\nEXHIBIT A - InterBase Public License.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\""}]}, {"tag": "text", "content": "The contents of this file are subject to the Interbase Public License Version 1.0 (the\n\"License\"); you may not use this file except in compliance with the License. You may\nobtain a copy of the License at http://www.Interbase.com/IPL.html\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT\nWARRANTY OF ANY KIND, either express or implied. See the License for the specific language\ngoverning rights and limitations under the License.\nThe Original Code was created by InterBase Software Corp and its successors.\nPortions created by Borland/Inprise are Copyright (C) Borland/Inprise. All Rights Reserved.\nContributor(s): "}, {"tag": "var", "name": "contributor", "content": [{"tag": "text", "content": "______________________________________"}], "pattern": ".+"}, {"tag": "text", "content": ".\nAMENDMENTS\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "I."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInterBase and logo. This License does not grant any rights to use the trademarks\n\"Interbase'', \"Java\" or \"JavaScript\" even if such marks are\nincluded in the Original Code or Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "II."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademark Usage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "II.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdvertising Materials. All advertising materials mentioning features or use of the covered Code\nmust display the following acknowledgement: \"This product includes software developed by Borland\nSoftware Corp. \"\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "II.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEndorsements. The names \"InterBase,\" \"ISC,\" and \"IB\" must not be used\nto endorse or promote Contributor Versions or Larger Works without the prior written permission of\nInterbase.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "II.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nProduct Names. Contributor Versions and Larger Works may not be called \"InterBase\" or\n\"Interbase\" nor may the word \"InterBase\" appear in their names without the prior\nwritten permission of Interbase.\n"}]