[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nLicence Art Libre 1.3 (LAL 1.3)\n"}]}, {"type": "text", "content": "\nPréambule :\nAvec la Licence Art Libre, l’autorisation est donnée de copier, de\ndiffuser et de transformer librement les œuvres dans le respect des\ndroits de l’auteur.\nLoin d’ignorer ces droits, la Licence Art Libre les reconnaît et les\nprotège. Elle en reformule l’exercice en permettant à tout un chacun\nde faire un usage créatif des productions de l’esprit quels que soient\nleur genre et leur forme d’expression.\nSi, en règle générale, l’application du droit d’auteur conduit à\nrestreindre l’accès aux œuvres de l’esprit, la Licence Art Libre, au\ncontraire, le favorise. L’intention est d’autoriser l’utilisation des\nressources d’une œuvre ; créer de nouvelles conditions de création\npour amplifier les possibilités de création. La Licence Art Libre\npermet d’avoir jouissance des œuvres tout en reconnaissant les droits\net les responsabilités de chacun.\nAvec le développement du numérique, l’invention d’internet et des\nlogiciels libres, les modalités de création ont évolué : les\nproductions de l’esprit s’offrent naturellement à la circulation, à\nl’échange et aux transformations. Elles se prêtent favorablement à la\nréalisation d’œuvres communes que chacun peut augmenter pour\nl’avantage de tous.\nC’est la raison essentielle de la Licence Art Libre : promouvoir et\nprotéger ces productions de l’esprit selon les principes du copyleft :\nliberté d’usage, de copie, de diffusion, de transformation et\ninterdiction d’appropriation exclusive.\nDéfinitions :\nNous désignons par « œuvre », autant l’œuvre initiale, les œuvres\nconséquentes, que l’œuvre commune telles que définies ci-après :\nL’œuvre commune : Il s’agit d’une œuvre qui comprend l’œuvre initiale\nainsi que toutes les contributions postérieures (les originaux\nconséquents et les copies). Elle est créée à l’initiative de l’auteur\ninitial qui par cette licence définit les conditions selon lesquelles\nles contributions sont faites.\nL’œuvre initiale : C’est-à-dire l’œuvre créée par l’initiateur de\nl’œuvre commune dont les copies vont être modifiées par qui le\nsouhaite.\nLes œuvres conséquentes : C’est-à-dire les contributions des auteurs\nqui participent à la formation de l’œuvre commune en faisant usage des\ndroits de reproduction, de diffusion et de modification que leur\nconfère la licence.\nOriginaux (sources ou ressources de l’œuvre) : Chaque exemplaire daté\nde l’œuvre initiale ou conséquente que leurs auteurs présentent comme\nréférence pour toutes actualisations, interprétations, copies ou\nreproductions ultérieures.\nCopie : Toute reproduction d’un original au sens de cette licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1-"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nOBJET.\nCette licence a pour objet de définir les conditions selon\nlesquelles vous pouvez jouir librement de l’œuvre.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nL’ÉTENDUE DE LA JOUISSANCE.\nCette œuvre est soumise au droit d’auteur, et l’auteur par cette\nlicence vous indique quelles sont vos libertés pour la copier, la\ndiffuser et la modifier.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLA LIBERTÉ DE COPIER (OU DE REPRODUCTION).\nVous avez la liberté de copier cette œuvre pour vous, vos amis ou\ntoute autre personne, quelle que soit la technique employée.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLA LIBERTÉ DE DIFFUSER (INTERPRÉTER, REPRÉSENTER, DISTRIBUER).\nVous pouvez diffuser librement les copies de ces œuvres, modifiées\nou non, quel que soit le support, quel que soit le lieu, à titre\nonéreux ou gratuit, si vous respectez toutes les conditions\nsuivantes :\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\njoindre aux copies cette licence à l’identique ou indiquer\nprécisément où se trouve la licence ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nindiquer au destinataire le nom de chaque auteur des originaux,\ny compris le vôtre si vous avez modifié l’œuvre ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nindiquer au destinataire où il pourrait avoir accès aux\noriginaux (initiaux et/ou conséquents).\nLes auteurs des originaux pourront, s’ils le souhaitent, vous\nautoriser à diffuser l’original dans les mêmes conditions que les\ncopies.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLA LIBERTÉ DE MODIFIER.\nVous avez la liberté de modifier les copies des originaux (initiaux\net conséquents) dans le respect des conditions suivantes :\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\ncelles prévues à l’article 2.2 en cas de diffusion de la copie\nmodifiée ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nindiquer qu’il s’agit d’une œuvre modifiée et, si possible, la\nnature de la modification ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\ndiffuser cette œuvre conséquente avec la même licence ou avec\ntoute licence compatible ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLes auteurs des originaux pourront, s’ils le souhaitent, vous\nautoriser à modifier l’original dans les mêmes conditions que\nles copies.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDROITS CONNEXES.\nLes actes donnant lieu à des droits d’auteur ou des droits voisins\nne doivent pas constituer un obstacle aux libertés conférées par\ncette licence.\nC’est pourquoi, par exemple, les interprétations\ndoivent être soumises à la même licence ou une licence compatible.\nDe même, l’intégration de l’œuvre à une base de données, une\ncompilation ou une anthologie ne doit pas faire obstacle à la\njouissance de l’œuvre telle que définie par cette licence.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nL’ INTÉGRATION DE L’ŒUVRE.\nToute intégration de cette œuvre à un ensemble non soumis à la LAL\ndoit assurer l’exercice des libertés conférées par cette\nlicence.\nSi l’œuvre n’est plus accessible indépendamment de l’ensemble, alors\nl’intégration n’est possible qu’à condition que l’ensemble soit\nsoumis à la LAL ou une licence compatible.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCRITÈRES DE COMPATIBILITÉ.\nUne licence est compatible avec la LAL si et seulement si :\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nelle accorde l’autorisation de copier, diffuser et modifier des\ncopies de l’œuvre, y compris à des fins lucratives, et sans\nautres restrictions que celles qu’impose le respect des autres\ncritères de compatibilité ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nelle garantit la paternité de l’œuvre et l’accès aux versions\nantérieures de l’œuvre quand cet accès est possible ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nelle reconnaît la LAL également compatible (réciprocité) ;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nelle impose que les modifications faites sur l’œuvre soient\nsoumises à la même licence ou encore à une licence répondant aux\ncritères de compatibilité posés par la LAL.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVOS DROITS INTELLECTUELS.\nLa LAL n’a pas pour objet de nier vos droits d’auteur sur votre\ncontribution ni vos droits connexes. En choisissant de contribuer à\nl’évolution de cette œuvre commune, vous acceptez seulement d’offrir\naux autres les mêmes autorisations sur votre contribution que celles\nqui vous ont été accordées par cette licence. Ces autorisations\nn’entraînent pas un dessaisissement de vos droits intellectuels.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVOS RESPONSABILITÉS.\nLa liberté de jouir de l’œuvre tel que permis par la LAL (liberté de\ncopier, diffuser, modifier) implique pour chacun la responsabilité\nde ses propres faits.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLA DURÉE DE LA LICENCE.\nCette licence prend effet dès votre acceptation de ses dispositions.\nLe fait de copier, de diffuser, ou de modifier l’œuvre constitue une\nacceptation tacite.\nCette licence a pour durée la durée des droits d’auteur attachés à\nl’œuvre. Si vous ne respectez pas les termes de cette licence, vous\nperdez automatiquement les droits qu’elle vous confère.\nSi le régime juridique auquel vous êtes soumis ne vous permet pas de\nrespecter les termes de cette licence, vous ne pouvez pas vous\nprévaloir des libertés qu’elle confère.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLES DIFFÉRENTES VERSIONS DE LA LICENCE.\nCette licence pourra être modifiée régulièrement, en vue de son\namélioration, par ses auteurs (les acteurs du mouvement Copyleft\nAttitude) sous la forme de nouvelles versions numérotées.\nVous avez toujours le choix entre vous contenter des dispositions\ncontenues dans la version de la LAL sous laquelle la copie vous a\nété communiquée ou alors, vous prévaloir des dispositions d’une des\nversions ultérieures.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLES SOUS-LICENCES.\nLes sous-licences ne sont pas autorisées par la présente. Toute\npersonne qui souhaite bénéficier des libertés qu’elle confère sera\nliée directement aux auteurs de l’œuvre commune.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLE CONTEXTE JURIDIQUE.\nCette licence est rédigée en référence au droit français et à la\nConvention de Berne relative au droit d’auteur.\n"}]