[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nLicence Art Libre\n[ Copyleft Attitude ]\nVersion 1.2\n"}]}, {"tag": "text", "content": "\nPréambule :\nAvec cette Licence Art Libre, l’autorisation est donnée de\ncopier, de diffuser et de transformer librement les oeuvres\ndans le respect des droits de l’auteur.\nLoin d’ignorer les droits de l’auteur, cette licence les\nreconnaît et les protège. Elle en reformule le principe en\npermettant au public de faire un usage créatif des oeuvres\nd’art.\nAlors que l’usage fait du droit de la propriété littéraire\net artistique conduit à restreindre l’accès du public\nà l’oeuvre, la Licence Art Libre a pour but de le\nfavoriser.\nL’intention est d’ouvrir l’accès et d’autoriser\nl’utilisation des ressources d’une oeuvre par le plus\ngrand nombre. En avoir jouissance pour en multiplier\nles réjouissances, créer de nouvelles conditions de\ncréation pour amplifier les possibilités de création.\nDans le respect des auteurs avec la reconnaissance et\nla défense de leur droit moral.\nEn effet, avec la venue du numérique, l’invention de l’internet\net des logiciels libres, un nouveau mode de création et de\nproduction est apparu. Il est aussi l’amplification de ce qui\na été expérimenté par nombre d’artistes contemporains.\nLe savoir et la création sont des ressources qui doivent\ndemeurer libres pour être encore véritablement du\nsavoir et de la création. C’est à dire rester une\nrecherche fondamentale qui ne soit pas directement\nliée à une application concrète. Créer c’est découvrir\nl’inconnu, c’est inventer le réel avant tout souci de\nréalisme.\nAinsi, l’objet de l’art n’est pas confondu avec l’objet\nd’art fini et défini comme tel.\nC’est la raison essentielle de cette Licence Art Libre : promouvoir et protéger des pratiques artistiques libérées des seules règles de l’économie de marché.\nDÉFINITIONS\n– L’oeuvre :\nil s’agit d’une oeuvre commune qui comprend l’oeuvre originelle ainsi que toutes les contributions postérieures (les originaux conséquents et les copies). Elle est créée à l’initiative de l’auteur originel qui par cette licence définit les conditions selon lesquelles les contributions sont faites.\n– L’oeuvre originelle :\nc’est-à-dire l’oeuvre créée par l’initiateur de l’oeuvre commune dont les copies vont être modifiées par qui le souhaite.\n– Les oeuvres conséquentes :\nc’est-à-dire les propositions des auteurs qui contribuent à la formation de l’oeuvre en faisant usage des droits de reproduction, de diffusion et de modification que leur confère la licence.\n– Original (source ou ressource de l’oeuvre) :\nexemplaire daté de l’oeuvre, de sa définition, de sa partition ou de son programme que l’auteur présente comme référence pour toutes actualisations, interprétations, copies ou reproductions ultérieures.\n– Copie :\ntoute reproduction d’un original au sens de cette licence.\n– Auteur de l’oeuvre originelle :\nc’est la personne qui a créé l’oeuvre à l’origine d’une arborescence de cette oeuvre modifiée. Par cette licence, l’auteur détermine les conditions dans lesquelles ce travail se fait.\n– Contributeur :\ntoute personne qui contribue à la création de l’oeuvre. Il est l’auteur d’une oeuvre originale résultant de la modification d’une copie de l’oeuvre originelle ou de la modification d’une copie d’une oeuvre conséquente.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOBJET\nCette licence a pour objet de définir les\nconditions selon lesquelles vous pouvez jouir\nlibrement de cette oeuvre.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nL’ÉTENDUE DE LA JOUISSANCE\nCette oeuvre est soumise au droit d’auteur, et\nl’auteur par cette licence vous indique quelles sont vos libertés pour la copier, la diffuser et la modifier:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLA LIBERTÉ DE COPIER (OU DE REPRODUCTION)\nVous avez la liberté de copier cette oeuvre pour un\nusage personnel, pour vos amis, ou toute autre\npersonne et quelque soit la technique\nemployée.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLA LIBERTÉ DE DIFFUSER, D’INTERPRÉTER (OU DE REPRÉSENTATION)\nVous pouvez diffuser librement les copies de ces\noeuvres, modifiées ou non, quel que soit le support, quel que soit le lieu, à titre onéreux ou gratuit si vous respectez toutes les conditions suivantes:\n– joindre aux copies, cette licence à l’identique,\nou indiquer précisément où se trouve la licence,\n– indiquer au destinataire le nom de l’auteur des originaux,\n– indiquer au destinataire où il pourra avoir accès aux originaux\n(originels et/ou conséquents).\nL’auteur de l’original pourra, s’il le souhaite, vous autoriser à diffuser l’original dans les mêmes conditions que les copies.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLA LIBERTÉ DE MODIFIER\nVous avez la liberté de modifier les copies des\noriginaux (originels et conséquents), qui peuvent être partielles ou non, dans le respect des conditions prévues à l’article 2.2 en cas de diffusion (ou représentation) de la copie modifiée. L’auteur de l’original pourra, s’il le souhaite, vous autoriser à modifier l’original dans les mêmes conditions que les copies.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nL’INCORPORATION DE L’OEUVRE\nTous les éléments de cette oeuvre doivent demeurer\nlibres, c’est pourquoi il ne vous est pas\npermis d’intégrer les originaux (originels et\nconséquents) dans une autre oeuvre qui ne\nserait pas soumise à cette licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVOS DROITS D’AUTEUR\nCette licence n’a pas pour objet de nier vos droits\nd’auteur sur votre contribution. En\nchoisissant de contribuer à l’évolution de\ncette oeuvre, vous acceptez seulement d’offrir\naux autres les mêmes droits sur votre\ncontribution que ceux qui vous ont été\naccordés par cette licence.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLA DURÉE DE LA LICENCE\nCette licence prend effet dès votre acceptation de\nses dispositions. Le fait de copier, de\ndiffuser, ou de modifier l’oeuvre constitue\nune acception tacite.\nCette licence a pour durée la durée des droits d’auteur attachés à l’oeuvre.\nSi vous ne respectez pas les termes de cette licence, vous perdez automatiquement les droits qu’elle vous confère.\nSi le régime juridique auquel vous êtes soumis ne vous permet pas de respecter les termes de cette licence, vous ne pouvez pas vous prévaloir des libertés qu’elle confère.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLES DIFFÉRENTES VERSIONS DE LA LICENCE\nCette licence pourra être modifiée régulièrement,\nen vue de son amélioration, par ses auteurs\n(les acteurs du mouvement « copyleft\nattitude ») sous la forme de nouvelles\nversions numérotées.\nVous avez toujours le choix entre vous contenter\ndes dispositions contenues dans la version\nsous laquelle la copie vous a été communiquée\nou alors, vous prévaloir des dispositions\nd’une des versions ultérieures.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLES SOUS-LICENCES\nLes sous licences ne sont pas autorisées par la\nprésente. Toute personne qui souhaite\nbénéficier des libertés qu’elle confère sera\nliée directement à l’auteur de l’oeuvre\noriginelle.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLA LOI APPLICABLE AU CONTRAT\nCette licence est soumise au droit français.\n"}]