[{"type": "optional", "content": {"type": "text", "content": "GNU LESSER GENERAL PUBLIC LICENSE\n        Version 3, 29 June 2007"}}, {"type": "text", "content": "\n    Copyright (C) 2007 Free Software Foundation, Inc.\n      <https://fsf.org/>\n    Everyone is permitted to copy and distribute verbatim copies\n      of this license document, but changing it is not allowed.\n    This version of the GNU Lesser General Public License incorporates\n      the terms and conditions of version 3 of the GNU General Public\n      License, supplemented by the additional permissions listed below.\n    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Additional Definitions.\n        As used herein, \"this License\" refers to version 3 of\n              the GNU Lesser General Public License, and the \"GNU GPL\"\n              refers to version 3 of the GNU General Public License.\n          \"The Library\" refers to a covered work governed by this License,\n              other than an Application or a Combined Work as defined below.\n          An \"Application\" is any work that makes use of an interface\n              provided by the Library, but which is not otherwise based on the\n              Library. Defining a subclass of a class defined by the Library\n              is deemed a mode of using an interface provided by the Library.\n          A \"Combined Work\" is a work produced by combining or\n              linking an Application with the Library. The particular\n              version of the Library with which the Combined\n              Work was made is also called the \"Linked Version\".\n          The \"Minimal Corresponding Source\" for a Combined\n              Work means the Corresponding Source for the Combined\n              Work, excluding any source code for portions of the\n              Combined Work that, considered in isolation, are based\n              on the Application, and not on the Linked Version.\n          The \"Corresponding Application Code\" for a Combined\n              Work means the object code and/or source code for the\n              Application, including any data and utility programs needed\n              for reproducing the Combined Work from the Application,\n              but excluding the System Libraries of the Combined Work.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Exception to Section 3 of the GNU GPL.\n        You may convey a covered work under sections 3 and 4 of this\n        License without being bound by section 3 of the GNU GPL.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Conveying Modified Versions.\n        If you modify a copy of the Library, and, in your\n        modifications, a facility refers to a function or data\n        to be supplied by an Application that uses the facility\n        (other than as an argument passed when the facility is\n        invoked), then you may convey a copy of the modified version:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            under this License, provided that you make a good faith\n            effort to ensure that, in the event an Application does not\n            supply the function or data, the facility still operates, and\n            performs whatever part of its purpose remains meaningful, or\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            under the GNU GPL, with none of the additional\n            permissions of this License applicable to that copy.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Object Code Incorporating Material from Library Header Files.\n        The object code form of an Application may incorporate material from\n        a header file that is part of the Library. You may convey such object\n        code under terms of your choice, provided that, if the incorporated\n        material is not limited to numerical parameters, data structure\n        layouts and accessors, or small macros, inline functions and templates\n        (ten or fewer lines in length), you do both of the following:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Give prominent notice with each copy of the object\n            code that the Library is used in it and that the\n            Library and its use are covered by this License.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Accompany the object code with a copy of\n            the GNU GPL and this license document.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Combined Works.\n        You may convey a Combined Work under terms of your choice that, taken\n        together, effectively do not restrict modification of the portions of\n        the Library contained in the Combined Work and reverse engineering for\n        debugging such modifications, if you also do each of the following:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Give prominent notice with each copy of the Combined\n            Work that the Library is used in it and that the\n            Library and its use are covered by this License.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Accompany the Combined Work with a copy\n            of the GNU GPL and this license document.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            For a Combined Work that displays copyright notices during\n            execution, include the copyright notice for the Library\n            among these notices, as well as a reference directing the\n            user to the copies of the GNU GPL and this license document.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Do one of the following:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                Convey the Minimal Corresponding Source under the terms\n                of this License, and the Corresponding Application Code\n                in a form suitable for, and under terms that permit,\n                the user to recombine or relink the Application with\n                a modified version of the Linked Version to produce a\n                modified Combined Work, in the manner specified by section\n                6 of the GNU GPL for conveying Corresponding Source.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                Use a suitable shared library mechanism for linking\n                with the Library. A suitable mechanism is one that\n                (a) uses at run time a copy of the Library already\n                present on the user's computer system, and (b) will\n                operate properly with a modified version of the Library\n                that is interface-compatible with the Linked Version.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Provide Installation Information, but only if you would otherwise\n            be required to provide such information under section 6 of the GNU\n            GPL, and only to the extent that such information is necessary to\n            install and execute a modified version of the Combined Work produced\n            by recombining or relinking the Application with a modified version\n            of the Linked Version. (If you use option 4d0, the Installation\n            Information must accompany the Minimal Corresponding Source and\n            Corresponding Application Code. If you use option 4d1, you must\n            provide the Installation Information in the manner specified by\n            section 6 of the GNU GPL for conveying Corresponding Source.)\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Combined Libraries.\n        You may place library facilities that are a work based on\n        the Library side by side in a single library together with\n        other library facilities that are not Applications and are not\n        covered by this License, and convey such a combined library\n        under terms of your choice, if you do both of the following:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Accompany the combined library with a copy of the same work\n            based on the Library, uncombined with any other library\n            facilities, conveyed under the terms of this License.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Give prominent notice with the combined library that part\n            of it is a work based on the Library, and explaining where\n            to find the accompanying uncombined form of the same work.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Revised Versions of the GNU Lesser General Public License.\n        The Free Software Foundation may publish revised and/or new versions\n          of the GNU Lesser General Public License from time to time. Such\n          new versions will be similar in spirit to the present version,\n          but may differ in detail to address new problems or concerns.\n        Each version is given a distinguishing version number. If the Library\n          as you received it specifies that a certain numbered version of the\n          GNU Lesser General Public License \"or any later version\" applies\n          to it, you have the option of following the terms and conditions\n          either of that published version or of any later version published\n          by the Free Software Foundation. If the Library as you received it\n          does not specify a version number of the GNU Lesser General Public\n          License, you may choose any version of the GNU Lesser General\n          Public License ever published by the Free Software Foundation.\n        If the Library as you received it specifies that a proxy\n          can decide whether future versions of the GNU Lesser\n          General Public License shall apply, that proxy's public\n          statement of acceptance of any version is permanent\n          authorization for you to choose that version for the Library."}]