[{"type": "optional", "content": {"type": "text", "content": "GNU LESSER GENERAL PUBLIC LICENSE\n        \nVersion 3, 29 June 2007"}}, {"type": "text", "content": "\n      \nCopyright (C) 2007 Free Software Foundation, Inc. <https://fsf.org/>\n\n      \nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is\n         not allowed.\n\n      \nThis version of the GNU Lesser General Public License incorporates the terms and conditions of version 3\n         of the GNU General Public License, supplemented by the additional permissions listed below.\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Additional Definitions.\n          As used herein, \"this License\" refers to version 3 of the GNU Lesser General Public\n                 License, and the \"GNU GPL\" refers to version 3 of the GNU General Public\n                 License.\n               \n\"The Library\" refers to a covered work governed by this License, other than an\n                 Application or a Combined Work as defined below.\n               \nAn \"Application\" is any work that makes use of an interface provided by the Library,\n                 but which is not otherwise based on the Library. Defining a subclass of a class defined by the\n                 Library is deemed a mode of using an interface provided by the Library.\n               \nA \"Combined Work\" is a work produced by combining or linking an Application with the\n                 Library. The particular version of the Library with which the Combined Work was made is also\n                 called the \"Linked Version\".\n               \nThe \"Minimal Corresponding Source\" for a Combined Work means the Corresponding Source\n                 for the Combined Work, excluding any source code for portions of the Combined Work that,\n                 considered in isolation, are based on the Application, and not on the Linked Version.\n               \nThe \"Corresponding Application Code\" for a Combined Work means the object code and/or\n                 source code for the Application, including any data and utility programs needed for\n                 reproducing the Combined Work from the Application, but excluding the System Libraries of the\n                 Combined Work.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Exception to Section 3 of the GNU GPL.\n            \nYou may convey a covered work under sections 3 and 4 of this License without being bound by\n                 section 3 of the GNU GPL.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Conveying Modified Versions.\n            \nIf you modify a copy of the Library, and, in your modifications, a facility refers to a\n                 function or data to be supplied by an Application that uses the facility (other than\n                 as an argument passed when the facility is invoked), then you may convey a copy of the\n                 modified version:\n\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              under this License, provided that you make a good faith effort to ensure that, in the event\n                 an Application does not supply the function or data, the facility still operates, and\n                 performs whatever part of its purpose remains meaningful, or\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              under the GNU GPL, with none of the additional permissions of this License applicable to that copy.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Object Code Incorporating Material from Library Header Files.\n            \nThe object code form of an Application may incorporate material from a header file that is\n                 part of the Library. You may convey such object code under terms of your choice,\n                 provided that, if the incorporated material is not limited to numerical parameters,\n                 data structure layouts and accessors, or small macros, inline functions and templates\n                 (ten or fewer lines in length), you do both of the following:\n\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Give prominent notice with each copy of the object code that the Library is used in it and\n                 that the Library and its use are covered by this License.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Accompany the object code with a copy of the GNU GPL and this license document.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Combined Works.\n            \nYou may convey a Combined Work under terms of your choice that, taken together, effectively\n                 do not restrict modification of the portions of the Library contained in the Combined\n                 Work and reverse engineering for debugging such modifications, if you also do each of\n                 the following:\n\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Give prominent notice with each copy of the Combined Work that the Library is used in it and\n                 that the Library and its use are covered by this License.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Accompany the Combined Work with a copy of the GNU GPL and this license document.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              For a Combined Work that displays copyright notices during execution, include the copyright\n                 notice for the Library among these notices, as well as a reference directing the user to\n                 the copies of the GNU GPL and this license document.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Do one of the following:\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "0)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Convey the Minimal Corresponding Source under the terms of this License, and the\n                     Corresponding Application Code in a form suitable for, and under terms that permit,\n                     the user to recombine or relink the Application with a modified version of the Linked\n                     Version to produce a modified Combined Work, in the manner specified by section 6 of\n                     the GNU GPL for conveying Corresponding Source.\n                     \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Use a suitable shared library mechanism for linking with the Library. A suitable\n                     mechanism is one that (a) uses at run time a copy of the Library already present on\n                     the user's computer system, and (b) will operate properly with a modified version\n                     of the Library that is interface-compatible with the Linked Version.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "e)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Provide Installation Information, but only if you would otherwise be required to provide such\n                 information under section 6 of the GNU GPL, and only to the extent that such information\n                 is necessary to install and execute a modified version of the Combined Work produced by\n                 recombining or relinking the Application with a modified version of the Linked Version.\n                 (If you use option 4d0, the Installation Information must accompany the Minimal\n                 Corresponding Source and Corresponding Application Code. If you use option 4d1, you must\n                 provide the Installation Information in the manner specified by section 6 of the GNU GPL\n                 for conveying Corresponding Source.)\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Combined Libraries.\n            \nYou may place library facilities that are a work based on the Library side by side in a\n                 single library together with other library facilities that are not Applications and\n                 are not covered by this License, and convey such a combined library under terms of\n                 your choice, if you do both of the following:\n\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Accompany the combined library with a copy of the same work based on the Library, uncombined\n                 with any other library facilities, conveyed under the terms of this License.\n               \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Give prominent notice with the combined library that part of it is a work based on the\n                 Library, and explaining where to find the accompanying uncombined form of the same\n                 work.\n        \n"}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Revised Versions of the GNU Lesser General Public License.\n          \nThe Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public\n             License from time to time. Such new versions will be similar in spirit to the present version, but may\n             differ in detail to address new problems or concerns.\n\n            \nEach version is given a distinguishing version number. If the Library as you received it specifies that a\n             certain numbered version of the GNU Lesser General Public License \"or any later version\"\n             applies to it, you have the option of following the terms and conditions either of that published\n             version or of any later version published by the Free Software Foundation. If the Library as you\n             received it does not specify a version number of the GNU Lesser General Public License, you may choose\n             any version of the GNU Lesser General Public License ever published by the Free Software\n             Foundation.\n\n            \nIf the Library as you received it specifies that a proxy can decide whether future versions of the GNU\n             Lesser General Public License shall apply, that proxy's public statement of acceptance of any version\n             is permanent authorization for you to choose that version for the Library."}]