[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nLesser General Public License For Linguistic Resources\n"}]}, {"type": "text", "content": "\nPreamble\nThe licenses for most data are designed to take away your freedom to share and change it. By contrast,\nthis License is intended to guarantee your freedom to share and change free data--to make sure the\ndata are free for all their users.\nThis License, the Lesser General Public License for Linguistic Resources, applies to some specially\ndesignated linguistic resources -- typically lexicons and grammars.\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "0."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License Agreement applies to any Linguistic Resource which contains a notice placed by the\ncopyright holder or other authorized party saying it may be distributed under the terms of\nthis Lesser General Public License for Linguistic Resources (also called \"this\nLicense\"). Each licensee is addressed as \"you\".\nA \"linguistic resource\" means a collection of data about language prepared so as to be\nused with application programs.\nThe \"Linguistic Resource\", below, refers to any such work which has been distributed\nunder these terms. A \"work based on the Linguistic Resource\" means either the\nLinguistic Resource or any derivative work under copyright law: that is to say, a work\ncontaining the Linguistic Resource or a portion of it, either verbatim or with modifications\nand/or translated straightforwardly into another language. (Hereinafter, translation is\nincluded without limitation in the term \"modification\".)\n\"Legible form\" for a linguistic resource means the preferred form of the resource for\nmaking modifications to it.\nActivities other than copying, distribution and modification are not covered by this License;\nthey are outside its scope. The act of running a program using the Linguistic Resource is not\nrestricted, and output from such a program is covered only if its contents constitute a work\nbased on the Linguistic Resource (independent of the use of the Linguistic Resource in a tool\nfor writing it). Whether that is true depends on what the program that uses the Linguistic\nResource does.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou may copy and distribute verbatim copies of the Linguistic Resource as you receive it, in any\nmedium, provided that you conspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the notices that refer to this\nLicense and to the absence of any warranty; and distribute a copy of this License along with\nthe Linguistic Resource.\nYou may charge a fee for the physical act of transferring a copy, and you may at your option\noffer warranty protection in exchange for a fee.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou may modify your copy or copies of the Linguistic Resource or any portion of it, thus forming\na work based on the Linguistic Resource, and copy and distribute such modifications or work\nunder the terms of Section 1 above, provided that you also meet all of these conditions:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe modified work must itself be a linguistic resource.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou must cause the files modified to carry prominent notices stating that you changed the\nfiles and the date of any change.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou must cause the whole of the work to be licensed at no charge to all third parties under\nthe terms of this License.\nThese requirements apply to the modified work as a whole. If identifiable sections of that\nwork are not derived from the Linguistic Resource, and can be reasonably considered\nindependent and separate works in themselves, then this License, and its terms, do not\napply to those sections when you distribute them as separate works. But when you\ndistribute the same sections as part of a whole which is a work based on the Linguistic\nResource, the distribution of the whole must be on the terms of this License, whose\npermissions for other licensees extend to the entire whole, and thus to each and every\npart regardless of who wrote it.\nThus, it is not the intent of this section to claim rights or contest your rights to work\nwritten entirely by you; rather, the intent is to exercise the right to control the\ndistribution of derivative or collective works based on the Linguistic Resource.\nIn addition, mere aggregation of another work not based on the Linguistic Resource with the\nLinguistic Resource (or with a work based on the Linguistic Resource) on a volume of a\nstorage or distribution medium does not bring the other work under the scope of this\nLicense.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA program that contains no derivative of any portion of the Linguistic Resource, but is designed\nto work with the Linguistic Resource (or an encrypted form of the Linguistic Resource) by\nreading it or being compiled or linked with it, is called a \"work that uses the\nLinguistic Resource\". Such a work, in isolation, is not a derivative work of the\nLinguistic Resource, and therefore falls outside the scope of this License.\nHowever, combining a \"work that uses the Linguistic Resource\" with the Linguistic\nResource (or an encrypted form of the Linguistic Resource) creates a package that is a\nderivative of the Linguistic Resource (because it contains portions of the Linguistic\nResource), rather than a \"work that uses the Linguistic Resource\". If the package is\na derivative of the Linguistic Resource, you may distribute the package under the terms of\nSection 4. Any works containing that package also fall under Section 4.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAs an exception to the Sections above, you may also combine a \"work that uses the Linguistic\nResource\" with the Linguistic Resource (or an encrypted form of the Linguistic Resource)\nto produce a package containing portions of the Linguistic Resource, and distribute that\npackage under terms of your choice, provided that the terms permit modification of the package\nfor the customer's own use and reverse engineering for debugging such modifications.\nYou must give prominent notice with each copy of the package that the Linguistic Resource is used\nin it and that the Linguistic Resource and its use are covered by this License. You must\nsupply a copy of this License. If the package during execution displays copyright notices, you\nmust include the copyright notice for the Linguistic Resource among them, as well as a\nreference directing the user to the copy of this License. Also, you must do one of these\nthings:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAccompany the package with the complete corresponding machine-readable legible form of the\nLinguistic Resource including whatever changes were used in the package (which must be\ndistributed under Sections 1 and 2 above); and, if the package contains an encrypted form\nof the Linguistic Resource, with the complete machine-readable \"work that uses the\nLinguistic Resource\", as object code and/or source code, so that the user can modify\nthe Linguistic Resource and then encrypt it to produce a modified package containing the\nmodified Linguistic Resource.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUse a suitable mechanism for combining with the Linguistic Resource. A suitable mechanism is\none that will operate properly with a modified version of the Linguistic Resource, if the\nuser installs one, as long as the modified version is interface-compatible with the\nversion that the package was made with.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAccompany the package with a written offer, valid for at least three years, to give the same\nuser the materials specified in Subsection 4a, above, for a charge no more than the cost\nof performing this distribution.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf distribution of the package is made by offering access to copy from a designated place,\noffer equivalent access to copy the above specified materials from the same place.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVerify that the user has already received a copy of these materials or that you have already\nsent this user a copy.\nIf the package includes an encrypted form of the Linguistic Resource, the required form of\nthe \"work that uses the Linguistic Resource\" must include any data and utility\nprograms needed for reproducing the package from it. However, as a special exception, the\nmaterials to be distributed need not include anything that is normally distributed (in\neither source or binary form) with the major components (compiler, kernel, and so on) of\nthe operating system on which the executable runs, unless that component itself\naccompanies the executable.\nIt may happen that this requirement contradicts the license restrictions of proprietary\nlibraries that do not normally accompany the operating system. Such a contradiction means\nyou cannot use both them and the Linguistic Resource together in a package that you\ndistribute.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou may not copy, modify, sublicense, link with, or distribute the Linguistic Resource except as\nexpressly provided under this License. Any attempt otherwise to copy, modify, sublicense, link\nwith, or distribute the Linguistic Resource is void, and will automatically terminate your\nrights under this License. However, parties who have received copies, or rights, from you\nunder this License will not have their licenses terminated so long as such parties remain in\nfull compliance.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nYou are not required to accept this License, since you have not signed it. However, nothing else\ngrants you permission to modify or distribute the Linguistic Resource or its derivative works.\nThese actions are prohibited by law if you do not accept this License. Therefore, by modifying\nor distributing the Linguistic Resource (or any work based on the Linguistic Resource), you\nindicate your acceptance of this License to do so, and all its terms and conditions for\ncopying, distributing or modifying the Linguistic Resource or works based on it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEach time you redistribute the Linguistic Resource (or any work based on the Linguistic\nResource), the recipient automatically receives a license from the original licensor to copy,\ndistribute, link with or modify the Linguistic Resource subject to these terms and conditions.\nYou may not impose any further restrictions on the recipients' exercise of the rights\ngranted herein. You are not responsible for enforcing compliance by third parties with this\nLicense.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf, as a consequence of a court judgment or allegation of patent infringement or for any other\nreason (not limited to patent issues), conditions are imposed on you (whether by court order,\nagreement or otherwise) that contradict the conditions of this License, they do not excuse you\nfrom the conditions of this License. If you cannot distribute so as to satisfy simultaneously\nyour obligations under this License and any other pertinent obligations, then as a consequence\nyou may not distribute the Linguistic Resource at all. For example, if a patent license would\nnot permit royalty-free redistribution of the Linguistic Resource by all those who receive\ncopies directly or indirectly through you, then the only way you could satisfy both it and\nthis License would be to refrain entirely from distribution of the Linguistic Resource.\nIf any portion of this section is held invalid or unenforceable under any particular\ncircumstance, the balance of the section is intended to apply, and the section as a whole is\nintended to apply in other circumstances.\nIt is not the purpose of this section to induce you to infringe any patents or other property\nright claims or to contest validity of any such claims; this section has the sole purpose of\nprotecting the integrity of the free resource distribution system which is implemented by\npublic license practices. Many people have made generous contributions to the wide range of\ndata distributed through that system in reliance on consistent application of that system; it\nis up to the author/donor to decide if he or she is willing to distribute resources through\nany other system and a licensee cannot impose that choice.\nThis section is intended to make thoroughly clear what is believed to be a consequence of the\nrest of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf the distribution and/or use of the Linguistic Resource is restricted in certain countries\neither by patents or by copyrighted interfaces, the original copyright holder who places the\nLinguistic Resource under this License may add an explicit geographical distribution\nlimitation excluding those countries, so that distribution is permitted only in or among\ncountries not thus excluded. In such case, this License incorporates the limitation as if\nwritten in the body of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Free Software Foundation may publish revised and/or new versions of the Lesser General Public\nLicense for Linguistic Resources from time to time. Such new versions will be similar in\nspirit to the present version, but may differ in detail to address new problems or\nconcerns.\nEach version is given a distinguishing version number. If the Linguistic Resource specifies a\nversion number of this License which applies to it and \"any later version\", you have\nthe option of following the terms and conditions either of that version or of any later\nversion published by the Free Software Foundation. If the Linguistic Resource does not specify\na license version number, you may choose any version ever published by the Free Software\nFoundation.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf you wish to incorporate parts of the Linguistic Resource into other free programs whose\ndistribution conditions are incompatible with these, write to the author to ask for\npermission.\nNO WARRANTY\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nBECAUSE THE LINGUISTIC RESOURCE IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE\nLINGUISTIC RESOURCE, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED\nIN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE LINGUISTIC RESOURCE \"AS\nIS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE\nRISK AS TO THE QUALITY AND PERFORMANCE OF THE LINGUISTIC RESOURCE IS WITH YOU. SHOULD THE\nLINGUISTIC RESOURCE PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\nCORRECTION.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "13."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER,\nOR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE LINGUISTIC RESOURCE AS PERMITTED\nABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR\nCONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE LINGUISTIC RESOURCE\n(INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES\nSUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE LINGUISTIC RESOURCE TO OPERATE WITH ANY\nOTHER SOFTWARE), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF\nSUCH DAMAGES.\nEND OF TERMS AND CONDITIONS\n"}]