[{"type": "text", "content": "This copy of the libpng notices is provided for your convenience. In case of any discrepancy between this\n         copy and the notices in the file png.h that is included in the libpng distribution, the latter shall\n         prevail.\n      COPYRIGHT NOTICE, DISCLAIMER, and LICENSE:\n      If you modify libpng you may insert additional notices immediately following this sentence.\n      This code is released under the libpng license.\n      libpng versions 1.2.6, August 15, 2004, through 1.4.5, December 9, 2010, are Copyright (c) 2004,\n         2006-2010 Glenn Randers-Pehrson, and are distributed according to the same disclaimer and license as\n         libpng-1.2.5 with the following individual added to the list of Contributing Authors\n      Cosmin Truta\n      libpng versions 1.0.7, July 1, 2000, through 1.2.5 - October 3, 2002, are\n        Copyright (c) 2000-2002 Glenn Randers-Pehrson, and are distributed according to the same disclaimer\n             and license as libpng-1.0.6 with the following individuals added to the list of Contributing\n             Authors\n      Simon-Pierre Cadieux\n        Eric S. Raymond\n        Gilles Vollant\n      and with the following additions to the disclaimer:\n      There is no warranty against interference with your enjoyment of the library or against infringement.\n         There is no warranty that our efforts or the library will fulfill any of your particular purposes or\n         needs. This library is provided with all faults, and the entire risk of satisfactory quality,\n         performance, accuracy, and effort is with the user.\n      libpng versions 0.97, January 1998, through 1.0.6, March 20, 2000, are\n        Copyright (c) 1998, 1999 Glenn Randers-Pehrson, and are distributed according to the same\n             disclaimer and license as libpng-0.96, with the following individuals added to the list of\n             Contributing Authors:\n      Tom Lane\n        Glenn Randers-Pehrson\n        Willem van Schaik\n      libpng versions 0.89, June 1996, through 0.96, May 1997, are\n        Copyright (c) 1996, 1997 Andreas Digger\n        Distributed according to the same disclaimer and license as libpng-0.88, with the following\n             individuals added to the list of Contributing Authors:\n      John Bowler\n        Kevin Bracey\n        Sam Bushell\n        Magnus Holmgren\n        Greg Roelofs\n        Tom Tanner\n      libpng versions 0.5, May 1995, through 0.88, January 1996, are\n        Copyright (c) 1995, 1996 Guy Eric Schalnat, Group 42, Inc.\n      For the purposes of this copyright and license, \"Contributing Authors\" is defined as the following set of\n         individuals:\n      Andreas Dilger\n        Dave Martindale\n        Guy Eric Schalnat\n        Paul Schmidt\n        Tim Wegner\n      The PNG Reference Library is supplied \"AS IS\". The Contributing Authors and Group 42, Inc. disclaim all\n         warranties, expressed or implied, including, without limitation, the warranties of merchantability and\n         of fitness for any purpose. The Contributing Authors and Group 42, Inc. assume no liability for\n         direct, indirect, incidental, special, exemplary, or consequential damages, which may result from the\n         use of the PNG Reference Library, even if advised of the possibility of such damage.\n      Permission is hereby granted to use, copy, modify, and distribute this source code, or portions hereof,\n         for any purpose, without fee, subject to the following restrictions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The origin of this source code must not be misrepresented.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Altered versions must be plainly marked as such and must not be misrepresented as being the\n             original source.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This Copyright notice may not be removed or altered from any source or altered source distribution.\n      The Contributing Authors and Group 42, Inc. specifically permit, without fee, and encourage the use of\n         this source code as a component to supporting the PNG file format in commercial products. If you use\n         this source code in a product, acknowledgment is not required but would be appreciated.\n      A \"png_get_copyright\" function is available, for convenient use in \"about\" boxes and the like:\n      printf(\"%s\",png_get_copyright(NULL));\n      Also, the PNG logo (in PNG format, of course) is supplied in the files \"pngbar.png\" and \"pngbar.jpg\n         (88x31) and \"pngnow.png\" (98x31).\n      Libpng is OSI Certified Open Source Software. OSI Certified Open Source is a certification mark of the\n         Open Source Initiative.\n      Glenn Randers-Pehrson\n        glennrp at users.sourceforge.net\n        December 9, 2010"}]