[{"type": "optional", "content": {"type": "text", "content": "Lucent Public License Version 1.0"}}, {"type": "text", "content": "\n\n      THE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS PUBLIC LICENSE (\"AGREEMENT\"). ANY USE,\n         REPRODUCTION OR DISTRIBUTION OF THE PROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DEFINITIONS\n          \"Contribution\" means:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            in the case of\n              "}, {"type": "var", "name": "organization", "content": {"type": "text", "content": "<ORGANIZATION>"}, "pattern": ".+"}, {"type": "text", "content": " (\"\n              "}, {"type": "var", "name": "owner", "content": {"type": "text", "content": "<OWNER>"}, "pattern": ".+"}, {"type": "text", "content": "\"), the Original Program, and\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            in the case of each Contributor,\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "i."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              changes to the Program, and\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "ii."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              additions to the Program; where such changes and/or additions to the Program originate\n                 from and are \"Contributed\" by that particular Contributor.\n              A Contribution is \"Contributed\" by a Contributor only (i) if it was added to the Program\n                 by such Contributor itself or anyone acting on such Contributor's behalf, and (ii) the\n                 Contributor explicitly consents, in accordance with Section 3C, to characterization of\n                 the changes and/or additions as Contributions. Contributions do not include additions\n                 to the Program which: (i) are separate modules of software distributed in conjunction\n                 with the Program under their own license agreement, and (ii) are not derivative works\n                 of the Program.\n                        \"Contributor\" means\n                "}, {"type": "var", "name": "owner", "content": {"type": "text", "content": "<OWNER>"}, "pattern": ".+"}, {"type": "text", "content": " and any other entity that has\n                Contributed a Contribution to the Program.\n                        \"Distributor\" means a Recipient that distributes the Program, modifications to the\n                 Program, or any part thereof.\n                        \"Licensed Patents\" mean patent claims licensable by a Contributor which are necessarily\n                 infringed by the use or sale of its Contribution alone or when combined with the\n                 Program.\n                        \"Original Program\" means the original version of the software accompanying this Agreement\n                 as released by\n                "}, {"type": "var", "name": "owner", "content": {"type": "text", "content": "<OWNER>"}, "pattern": ".+"}, {"type": "text", "content": ", including source code, object code and\n                documentation, if any.\n                        \"Program\" means the Original Program and Contributions or any part thereof\n                        \"Recipient\" means anyone who receives the Program under this Agreement, including all Contributors.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          GRANT OF RIGHTS\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Subject to the terms of this Agreement, each Contributor hereby grants Recipient a\n               non-exclusive, worldwide, royalty-free copyright license to reproduce, prepare derivative\n               works of, publicly display, publicly perform, distribute and sublicense the Contribution\n               of such Contributor, if any, and such derivative works, in source code and object code\n               form.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Subject to the terms of this Agreement, each Contributor hereby grants Recipient a\n               non-exclusive, worldwide, royalty-free patent license under Licensed Patents to make, use,\n               sell, offer to sell, import and otherwise transfer the Contribution of such Contributor,\n               if any, in source code and object code form. The patent license granted by a Contributor\n               shall also apply to the combination of the Contribution of that Contributor and the\n               Program if, at the time the Contribution is added by the Contributor, such addition of the\n               Contribution causes such combination to be covered by the Licensed Patents. The patent\n               license granted by a Contributor shall not apply to (i) any other combinations which\n               include the Contribution, nor to (ii) Contributions of other Contributors. No hardware per\n               se is licensed hereunder.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Recipient understands that although each Contributor grants the licenses to its Contributions\n               set forth herein, no assurances are provided by any Contributor that the Program does not\n               infringe the patent or other intellectual property rights of any other entity. Each\n               Contributor disclaims any liability to Recipient for claims brought by any other entity\n               based on infringement of intellectual property rights or otherwise. As a condition to\n               exercising the rights and licenses granted hereunder, each Recipient hereby assumes sole\n               responsibility to secure any other intellectual property rights needed, if any. For\n               example, if a third party patent license is required to allow Recipient to distribute the\n               Program, it is Recipient's responsibility to acquire that license before distributing the\n               Program.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Each Contributor represents that to its knowledge it has sufficient copyright rights in its\n               Contribution, if any, to grant the copyright license set forth in this Agreement.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          REQUIREMENTS\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Distributor may choose to distribute the Program in any form under this Agreement or under\n               its own license agreement, provided that:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              it complies with the terms and conditions of this Agreement;\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              if the Program is distributed in source code or other tangible form, a copy of this\n                 Agreement or Distributor's own license agreement is included with each copy of the\n                 Program; and\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              if distributed under Distributor's own license agreement, such license agreement:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                effectively disclaims on behalf of all Contributors all warranties and conditions,\n                   express and implied, including warranties or conditions of title and\n                   non-infringement, and implied warranties or conditions of merchantability and\n                   fitness for a particular purpose;\n                           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                effectively excludes on behalf of all Contributors all liability for damages,\n                   including direct, indirect, special, incidental and consequential damages, such as\n                   lost profits; and\n                           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                states that any provisions which differ from this Agreement are offered by that\n                   Contributor alone and not by any other party.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Each Distributor must include the following in a conspicuous location in the Program:\n            Copyright (C)\n              "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "<YEAR>, <ORGANIZATION>"}, "pattern": ".+"}, {"type": "text", "content": " and others. All\n              Rights Reserved.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "C."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            In addition, each Contributor must identify itself as the originator of its Contribution, if\n               any, and indicate its consent to characterization of its additions and/or changes as a\n               Contribution, in a manner that reasonably allows subsequent Recipients to identify the\n               originator of the Contribution. Once consent is granted, it may not thereafter be\n               revoked.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          COMMERCIAL DISTRIBUTION\n          Commercial distributors of software may accept certain responsibilities with respect to end\n             users, business partners and the like. While this license is intended to facilitate the\n             commercial use of the Program, the Distributor who includes the Program in a commercial\n             product offering should do so in a manner which does not create potential liability for\n             Contributors. Therefore, if a Distributor includes the Program in a commercial product\n             offering, such Distributor (\"Commercial Distributor\") hereby agrees to defend and indemnify\n             every Contributor (\"Indemnified Contributor\") against any losses, damages and costs\n             (collectively \"Losses\") arising from claims, lawsuits and other legal actions brought by a\n             third party against the Indemnified Contributor to the extent caused by the acts or omissions\n             of such Commercial Distributor in connection with its distribution of the Program in a\n             commercial product offering. The obligations in this section do not apply to any claims or\n             Losses relating to any actual or alleged intellectual property infringement. In order to\n             qualify, an Indemnified Contributor must: a) promptly notify the Commercial Distributor in\n             writing of such claim, and b) allow the Commercial Distributor to control, and cooperate with\n             the Commercial Distributor in, the defense and any related settlement negotiations. The\n             Indemnified Contributor may participate in any such claim at its own expense.\n            For example, a Distributor might include the Program in a commercial product offering, Product X.\n             That Distributor is then a Commercial Distributor. If that Commercial Distributor then makes\n             performance claims, or offers warranties related to Product X, those performance claims and\n             warranties are such Commercial Distributor's responsibility alone. Under this section, the\n             Commercial Distributor would have to defend claims against the Contributors related to those\n             performance claims and warranties, and if a court requires any Contributor to pay any damages\n             as a result, the Commercial Distributor must pay those damages.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          NO WARRANTY\n          EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED ON AN \"AS IS\" BASIS,\n             WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED INCLUDING, WITHOUT\n             LIMITATION, ANY WARRANTIES OR CONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR\n             FITNESS FOR A PARTICULAR PURPOSE. Each Recipient is solely responsible for determining the\n             appropriateness of using and distributing the Program and assumes all risks associated with\n             its exercise of rights under this Agreement, including but not limited to the risks and costs\n             of program errors, compliance with applicable laws, damage to or loss of data, programs or\n             equipment, and unavailability or interruption of operations.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DISCLAIMER OF LIABILITY\n          EXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY CONTRIBUTORS SHALL\n             HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n             DAMAGES (INCLUDING WITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF\n             LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n             ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION OF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS\n             GRANTED HEREUNDER, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          GENERAL\n      If any provision of this Agreement is invalid or unenforceable under applicable law, it shall not affect\n         the validity or enforceability of the remainder of the terms of this Agreement, and without further\n         action by the parties hereto, such provision shall be reformed to the minimum extent necessary to make\n         such provision valid and enforceable.\n            If Recipient institutes patent litigation against a Contributor with respect to a patent applicable to\n         software (including a cross-claim or counterclaim in a lawsuit), then any patent licenses granted by\n         that Contributor to such Recipient under this Agreement shall terminate as of the date such litigation\n         is filed. In addition, if Recipient institutes patent litigation against any entity (including a\n         cross-claim or counterclaim in a lawsuit) alleging that the Program itself (excluding combinations of\n         the Program with other software or hardware) infringes such Recipient's patent(s), then such\n         Recipient's rights granted under Section 2(b) shall terminate as of the date such litigation is\n         filed.\n            All Recipient's rights under this Agreement shall terminate if it fails to comply with any of the\n         material terms or conditions of this Agreement and does not cure such failure in a reasonable period\n         of time after becoming aware of such noncompliance. If all Recipient's rights under this Agreement\n         terminate, Recipient agrees to cease use and distribution of the Program as soon as reasonably\n         practicable. However, Recipient's obligations under this Agreement and any licenses granted by\n         Recipient relating to the Program shall continue and survive.\n            "}, {"type": "var", "name": "owner", "content": {"type": "text", "content": "<OWNER>"}, "pattern": ".+"}, {"type": "text", "content": " may publish new versions (including revisions) of this\n        Agreement from time to time. Each new version of the Agreement will be given a distinguishing version\n        number. The Program (including Contributions) may always be distributed subject to the version of the\n        Agreement under which it was received. In addition, after a new version of the Agreement is published,\n        Contributor may elect to distribute the Program (including its Contributions) under the new version. No\n        one other than\n        "}, {"type": "var", "name": "owner", "content": {"type": "text", "content": "<OWNER>"}, "pattern": ".+"}, {"type": "text", "content": " has the right to modify this Agreement. Except as\n        expressly stated in Sections 2(a) and 2(b) above, Recipient receives no rights or licenses to the\n        intellectual property of any Contributor under this Agreement, whether expressly, by implication,\n        estoppel or otherwise. All rights in the Program not expressly granted under this Agreement are\n        reserved.\n            This Agreement is governed by the laws of the State of\n        "}, {"type": "var", "name": "state", "content": {"type": "text", "content": "<STATE>"}, "pattern": ".+"}, {"type": "text", "content": " and the intellectual property laws of the United States\n        of America. No party to this Agreement will bring a legal action under this Agreement more than one year\n        after the cause of action arose. Each party waives its rights to a jury trial in any resulting\n        litigation."}]