[{"type": "optional", "content": {"type": "text", "content": "LaTeX Project Public License\n         LPPL Version 1.0 1999-03-01"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright 1999 LaTeX3 Project"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Everyone is permitted to copy and distribute verbatim copies of this license document, but modification\n         is not allowed.\n      Preamble\n      The LaTeX Project Public License (LPPL) is the license under which the base LaTeX distribution is\n         distributed. As described below you may use this licence for any software that you wish to\n         distribute.\n      It may be particularly suitable if your software is TeX related (such as a LaTeX package file) but it may\n         be used for any software, even if it is unrelated to TeX.\n      To use this license, the files of your distribution should have an explicit copyright notice giving your\n         name and the year, together with a reference to this license.\n      A typical example would be\n      "}, {"type": "optional", "content": {"type": "text", "content": "%%"}}, {"type": "text", "content": " "}, {"type": "var", "name": "filename", "content": {"type": "text", "content": "pig.sty"}, "pattern": ".+"}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "%%"}}, {"type": "text", "content": " Copyright "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "2001 M. Y. Name"}, "pattern": ".+"}, {"type": "text", "content": "\n      % This program can redistributed and/or modified under the terms\n        "}, {"type": "optional", "content": {"type": "text", "content": "%"}}, {"type": "text", "content": " of the LaTeX Project Public License Distributed from CTAN\n        "}, {"type": "optional", "content": {"type": "text", "content": "%"}}, {"type": "text", "content": " archives in directory macros/latex/base/lppl.txt; either\n        "}, {"type": "optional", "content": {"type": "text", "content": "%"}}, {"type": "text", "content": " version 1 of the License, or (at your option) any later version.\n      Given such a notice in the file, the conditions of this document would apply, with:\n      `The Program' referring to the software `pig.sty' and `The Copyright Holder' referring to the person `M.\n         Y. Name'.\n      To see a real example, see the file legal.txt which carries the copyright notice for the base latex\n         distribution.\n      This license gives terms under which files of The Program may be distributed and modified. Individual\n         files may have specific further constraints on modification, but no file should have restrictions on\n         distribution other than those specified below.\n      This is to ensure that a distributor wishing to distribute a complete unmodified copy of The Program need\n         only check the conditions in this file, and does not need to check every file in The Program for extra\n         restrictions. If you do need to modify the distribution terms of some files, do not refer to this\n         license, instead distribute The Program under a different license. You may use the parts of the text\n         of LPPL as a model for your own license, but your license should not directly refer to the LPPL or\n         otherwise give the impression that The Program is distributed under the LPPL.\n      The LaTeX Project Public License\n        ================================\n        Terms And Conditions For Copying, Distribution And Modification\n        ===============================================================\n\n      WARRANTY\n        ========\n      There is no warranty for The Program, to the extent permitted by applicable law. Except when otherwise\n         stated in writing, The Copyright Holder provides The Program `as is' without warranty of any kind,\n         either expressed or implied, including, but not limited to, the implied warranties of merchantability\n         and fitness for a particular purpose. The entire risk as to the quality and performance of the program\n         is with you. Should The Program prove defective, you assume the cost of all necessary servicing,\n         repair or correction.\n      In no event unless required by applicable law or agreed to in writing will The Copyright Holder, or any\n         of the individual authors named in the source for The Program, be liable to you for damages, including\n         any general, special, incidental or consequential damages arising out of any use of The Program or out\n         of inability to use The Program (including but not limited to loss of data or data being rendered\n         inaccurate or losses sustained by you or by third parties as a result of a failure of The Program to\n         operate with any other programs), even if such holder or other party has been advised of the\n         possibility of such damages.\n      DISTRIBUTION\n        ============\n      Redistribution of unchanged files is allowed provided that all files that make up the distribution of The\n         Program are distributed. In particular this means that The Program has to be distributed including its\n         documentation if documentation was part of the original distribution.\n      The distribution of The Program will contain a prominent file listing all the files covered by this\n         license.\n      If you receive only some of these files from someone, complain!\n      The distribution of changed versions of certain files included in the The Program, and the reuse of code\n         from The Program, are allowed under the following restrictions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          It is allowed only if the legal notice in the file does not expressly forbid it. See note\n           below, under \"Conditions on individual files\".\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You rename the file before you make any changes to it, unless the file explicitly says that\n           renaming is not required. Any such changed files must be distributed under a license that\n           forbids distribution of those files, and any files derived from them, under the names used\n           by the original files in the distribution of The Program.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You change any `identification string' in The Program to clearly indicate that the file is\n           not part of the standard system.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If The Program includes an `error report address' so that errors may be reported to The\n           Copyright Holder, or other specified addresses, this address must be changed in any\n           modified versions of The Program, so that reports for files not maintained by the original\n           program maintainers are directed to the maintainers of the changed files.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You acknowledge the source and authorship of the original version in the modified file.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You also distribute the unmodified version of the file or alternatively provide sufficient\n               information so that the user of your modified file can be reasonably expected to be able\n               to obtain an original, unmodified copy of The Program. For example, you may specify a URL\n               to a site that you expect will freely provide the user with a copy of The Program (either\n               the version on which your modification is based, or perhaps a later version).\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If The Program is intended to be used with, or is based on, LaTeX, then files with the\n               following file extensions which have special meaning in LaTeX Software, have special\n               modification rules under the license:\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Files with extension `.ins' (installation files): these files may not be modified at all\n                 because they contain the legal notices that are placed in the generated files.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Files with extension `.fd' (LaTeX font definitions files): these files are allowed to be\n                 modified without changing the name, but only to enable use of all available fonts and\n                 to prevent attempts to access unavailable fonts. However, modified files are not\n                 allowed to be distributed in place of original files.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Files with extension `.cfg' (configuration files): these files can be created or modified\n                 to enable easy configuration of the system. The documentation in cfgguide.tex in the\n                 base LaTeX distribution describes when it makes sense to modify or generate such\n                 files.\n      The above restrictions are not intended to prohibit, and hence do not apply to, the updating, by any\n         method, of a file so that it becomes identical to the latest version of that file in The Program.\n      ========================================================================\n      NOTES\n        =====\n      We believe that these requirements give you the freedom you to make modifications that conform with\n         whatever technical specifications you wish, whilst maintaining the availability, integrity and\n         reliability of The Program. If you do not see how to achieve your goal whilst adhering to these\n         requirements then read the document cfgguide.tex in the base LaTeX distribution for suggestions.\n      Because of the portability and exchangeability aspects of systems like LaTeX, The LaTeX3 Project\n         deprecates the distribution of non-standard versions of components of LaTeX or of generally available\n         contributed code for them but such distributions are permitted under the above restrictions.\n      The document modguide.tex in the base LaTeX distribution details the reasons for the legal requirements\n         detailed above. Even if The Program is unrelated to LaTeX, the argument in modguide.tex may still\n         apply, and should be read before a modified version of The Program is distributed.\n      Conditions on individual files\n        ==============================\n      The individual files may bear additional conditions which supersede the general conditions on\n         distribution and modification contained in this file. If there are any such files, the distribution of\n         The Program will contain a prominent file that lists all the exceptional files.\n      Typical examples of files with more restrictive modification conditions would be files that contain the\n         text of copyright notices.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The conditions on individual files differ only in the extent of *modification* that is allowed.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The conditions on *distribution* are the same for all the files. Thus a (re)distributor of a\n             complete, unchanged copy of The Program need meet only the conditions in this file; it is not\n             necessary to check the header of every file in the distribution to check that a distribution\n             meets these requirements."}]