[{"type": "optional", "content": {"type": "text", "content": "MakeIndex Distribution Notice\n         11/11/1989"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (C) 1989 by Chen & Harrison International Systems, Inc.\n        Copyright (C) 1988 by Olivetti Research Center\n        Copyright (C) 1987 by Regents of the University of California\n         Author:\n        Pehong Chen (phc@renoir.berkeley.edu)\n        Chen & Harrison International Systems, Inc.\n        Palo Alto, California\n        USA"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Permission is hereby granted to make and distribute original copies of this program provided that the\n         copyright notice and this permission notice are preserved and provided that the recipient is not asked\n         to waive or limit his right to redistribute copies as allowed by this permission notice and provided\n         that anyone who receives an executable form of this program is granted access to a machine-readable\n         form of the source code for this program at a cost not greater than reasonable reproduction, shipping,\n         and handling costs. Executable forms of this program distributed without the source code must be\n         accompanied by a conspicuous copy of this permission notice and a statement that tells the recipient\n         how to obtain the source code.\n      Permission is granted to distribute modified versions of all or part of this program under the conditions\n         above with the additional requirement that the entire modified work must be covered by a permission\n         notice identical to this permission notice. Anything distributed with and usable only in conjunction\n         with something derived from this program, whose useful purpose is to extend or adapt or add\n         capabilities to this program, is to be considered a modified version of this program under the\n         requirement above. Ports of this program to other systems not supported in the distribution are also\n         considered modified versions. All modified versions should be reported back to the author.\n      This program is distributed with no warranty of any sort. No contributor accepts responsibility for the\n         consequences of using this program or for whether it serves any particular purpose."}]