[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nMozilla Public License Version 2.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means each individual or legal entity that creates, contributes to\nthe creation of, or owns Covered Software.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor Version\" means the combination of the Contributions of others (if any)\nused by a Contributor and that particular Contributor's Contribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contribution\" means Covered Software of a particular Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Covered Software\" means Source Code Form to which the initial Contributor has\nattached the notice in Exhibit A, the Executable Form of such Source Code Form, and\nModifications of such Source Code Form, in each case including portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Incompatible With Secondary Licenses\" means\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthat the initial Contributor has attached the notice described in Exhibit B to the\nCovered Software; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthat the Covered Software was made available under the terms of version 1.1 or earlier of\nthe License, but not also under the terms of a Secondary License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Executable Form\" means any form of the work other than Source Code Form.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work that combines Covered Software with other material, in a\nseparate file or files, that is not Covered Software.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"License\" means this document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Licensable\" means having the right to grant, to the maximum extent possible,\nwhether at the time of the initial grant or subsequently, any and all of the rights\nconveyed by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" means any of the following:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany file in Source Code Form that results from an addition to, deletion from, or\nmodification of the contents of Covered Software; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany new file in Source Code Form that contains any Covered Software.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Patent Claims\" of a Contributor means any patent claim(s), including without\nlimitation, method, process, and apparatus claims, in any patent Licensable by such\nContributor that would be infringed, but for the grant of the License, by the making,\nusing, selling, offering for sale, having made, import, or transfer of either its\nContributions or its Contributor Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Secondary License\" means either the GNU General Public License, Version 2.0, the\nGNU Lesser General Public License, Version 2.1, the GNU Affero General Public License,\nVersion 3.0, or any later versions of those licenses.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code Form\" means the form of the work preferred for making modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" (or \"Your\") means an individual or a legal entity exercising rights\nunder this License. For legal entities, \"You\" includes any entity that controls,\nis controlled by, or is under common control with You. For purposes of this definition,\n\"control\" means (a) the power, direct or indirect, to cause the direction or\nmanagement of such entity, whether by contract or otherwise, or (b) ownership of more than\nfifty percent (50%) of the outstanding shares or beneficial ownership of such entity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicense Grants and Conditions\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrants\nEach Contributor hereby grants You a world-wide, royalty-free, non-exclusive license:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by such\nContributor to use, reproduce, make available, modify, display, perform, distribute,\nand otherwise exploit its Contributions, either on an unmodified basis, with\nModifications, or as part of a Larger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims of such Contributor to make, use, sell, offer for sale, have made,\nimport, and otherwise transfer either its Contributions or its Contributor\nVersion.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffective Date\nThe licenses granted in Section 2.1 with respect to any Contribution become effective\nfor each Contribution on the date the Contributor first distributes such\nContribution.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitations on Grant Scope\nThe licenses granted in this Section 2 are the only rights granted under this License.\nNo additional rights or licenses will be implied from the distribution or\nlicensing of Covered Software under this License. Notwithstanding Section 2.1(b)\nabove, no patent license is granted by a Contributor:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nfor any code that a Contributor has removed from Covered Software; or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nfor infringements caused by: (i) Your and any other third party's modifications of\nCovered Software, or (ii) the combination of its Contributions with other software\n(except as part of its Contributor Version); or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by Covered Software in the absence of its Contributions.\nThis License does not grant any rights in the trademarks, service marks, or logos of any\nContributor (except as may be necessary to comply with the notice requirements in\nSection 3.4).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubsequent Licenses\nNo Contributor makes additional grants as a result of Your choice to distribute the\nCovered Software under a subsequent version of this License (see Section 10.2) or\nunder the terms of a Secondary License (if permitted under the terms of Section\n3.3).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentation\nEach Contributor represents that the Contributor believes its Contributions are its\noriginal creation(s) or it has sufficient rights to grant the rights to its\nContributions conveyed by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFair Use\nThis License is not intended to limit any rights You have under applicable copyright\ndoctrines of fair use, fair dealing, or other equivalents.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nConditions\nSections 3.1, 3.2, 3.3, and 3.4 are conditions of the licenses granted in Section 2.1.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nResponsibilities\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Source Form\nAll distribution of Covered Software in Source Code Form, including any Modifications\nthat You create or to which You contribute, must be under the terms of this\nLicense. You must inform recipients that the Source Code Form of the Covered\nSoftware is governed by the terms of this License, and how they can obtain a copy\nof this License. You may not attempt to alter or restrict the recipients'\nrights in the Source Code Form.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Form\nIf You distribute Covered Software in Executable Form then:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsuch Covered Software must also be made available in Source Code Form, as described in\nSection 3.1, and You must inform recipients of the Executable Form how they can obtain\na copy of such Source Code Form by reasonable means in a timely manner, at a charge no\nmore than the cost of distribution to the recipient; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may distribute such Executable Form under the terms of this License, or sublicense it\nunder different terms, provided that the license for the Executable Form does not\nattempt to limit or alter the recipients' rights in the Source Code Form under\nthis License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of a Larger Work\nYou may create and distribute a Larger Work under terms of Your choice, provided that\nYou also comply with the requirements of this License for the Covered Software. If\nthe Larger Work is a combination of Covered Software with a work governed by one\nor more Secondary Licenses, and the Covered Software is not Incompatible With\nSecondary Licenses, this License permits You to additionally distribute such\nCovered Software under the terms of such Secondary License(s), so that the\nrecipient of the Larger Work may, at their option, further distribute the Covered\nSoftware under the terms of either this License or such Secondary License(s).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotices\nYou may not remove or alter the substance of any license notices (including copyright\nnotices, patent notices, disclaimers of warranty, or limitations of liability)\ncontained within the Source Code Form of the Covered Software, except that You may\nalter any license notices to the extent required to remedy known factual\ninaccuracies.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of Additional Terms\nYou may choose to offer, and to charge a fee for, warranty, support, indemnity or\nliability obligations to one or more recipients of Covered Software. However, You\nmay do so only on Your own behalf, and not on behalf of any Contributor. You must\nmake it absolutely clear that any such warranty, support, indemnity, or liability\nobligation is offered by You alone, and You hereby agree to indemnify every\nContributor for any liability incurred by such Contributor as a result of\nwarranty, support, indemnity or liability terms You offer. You may include\nadditional disclaimers of warranty and limitations of liability specific to any\njurisdiction.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation\nIf it is impossible for You to comply with any of the terms of this License with respect to\nsome or all of the Covered Software due to statute, judicial order, or regulation then\nYou must: (a) comply with the terms of this License to the maximum extent possible;\nand (b) describe the limitations and the code they affect. Such description must be\nplaced in a text file included with all distributions of the Covered Software under\nthis License. Except to the extent prohibited by statute or regulation, such\ndescription must be sufficiently detailed for a recipient of ordinary skill to be able\nto understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe rights granted under this License will terminate automatically if You fail to comply with\nany of its terms. However, if You become compliant, then the rights granted under this\nLicense from a particular Contributor are reinstated (a) provisionally, unless and until\nsuch Contributor explicitly and finally terminates Your grants, and (b) on an ongoing\nbasis, if such Contributor fails to notify You of the non-compliance by some reasonable\nmeans prior to 60 days after You have come back into compliance. Moreover, Your grants\nfrom a particular Contributor are reinstated on an ongoing basis if such Contributor\nnotifies You of the non-compliance by some reasonable means, this is the first time You\nhave received notice of non-compliance with this License from such Contributor, and You\nbecome compliant prior to 30 days after Your receipt of the notice.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You initiate litigation against any entity by asserting a patent infringement claim\n(excluding declaratory judgment actions, counter-claims, and cross-claims) alleging that a\nContributor Version directly or indirectly infringes any patent, then the rights granted\nto You by any and all Contributors for the Covered Software under Section 2.1 of this\nLicense shall terminate.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the event of termination under Sections 5.1 or 5.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or Your\ndistributors under this License prior to termination shall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty\nCovered Software is provided under this License on an \"as is\" basis, without\nwarranty of any kind, either expressed, implied, or statutory, including, without\nlimitation, warranties that the Covered Software is free of defects, merchantable, fit\nfor a particular purpose or non-infringing. The entire risk as to the quality and\nperformance of the Covered Software is with You. Should any Covered Software prove\ndefective in any respect, You (not any Contributor) assume the cost of any necessary\nservicing, repair, or correction. This disclaimer of warranty constitutes an essential\npart of this License. No use of any Covered Software is authorized under this License\nexcept under this disclaimer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability\nUnder no circumstances and under no legal theory, whether tort (including negligence),\ncontract, or otherwise, shall any Contributor, or anyone who distributes Covered\nSoftware as permitted above, be liable to You for any direct, indirect, special,\nincidental, or consequential damages of any character including, without limitation,\ndamages for lost profits, loss of goodwill, work stoppage, computer failure or\nmalfunction, or any and all other commercial damages or losses, even if such party\nshall have been informed of the possibility of such damages. This limitation of\nliability shall not apply to liability for death or personal injury resulting from\nsuch party's negligence to the extent applicable law prohibits such limitation.\nSome jurisdictions do not allow the exclusion or limitation of incidental or\nconsequential damages, so this exclusion and limitation may not apply to You.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLitigation\nAny litigation relating to this License may be brought only in the courts of a jurisdiction\nwhere the defendant maintains its principal place of business and such litigation\nshall be governed by laws of that jurisdiction, without reference to its\nconflict-of-law provisions. Nothing in this Section shall prevent a party's\nability to bring cross-claims or counter-claims.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous\nThis License represents the complete agreement concerning the subject matter hereof. If any\nprovision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. Any law or regulation\nwhich provides that the language of a contract shall be construed against the drafter\nshall not be used to construe this License against a Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions\nMozilla Foundation is the license steward. Except as provided in Section 10.3, no one\nother than the license steward has the right to modify or publish new versions of\nthis License. Each version will be given a distinguishing version number.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions\nYou may distribute the Covered Software under the terms of the version of the License\nunder which You originally received the Covered Software, or under the terms of\nany subsequent version published by the license steward.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nModified Versions\nIf you create software not governed by this License, and you want to create a new\nlicense for such software, you may create and use a modified version of this\nLicense if you rename the license and remove any references to the name of the\nlicense steward (except to note that such modified license differs from this\nLicense).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistributing Source Code Form that is Incompatible With Secondary Licenses\nIf You choose to distribute Source Code Form that is Incompatible With Secondary Licenses under the terms\nof this version of the License, the notice described in Exhibit B of this License must be\nattached.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nExhibit A - Source Code Form License Notice\nThis Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0. If a copy of the MPL\nwas not distributed with this file, You can obtain one at http://mozilla.org/MPL/2.0/.\nIf it is not possible or desirable to put the notice in a particular file, then You may include the\nnotice in a location (such as a LICENSE file in a relevant directory) where a recipient would be\nlikely to look for such a notice.\nYou may add additional accurate notices of copyright ownership.\nExhibit B - \"Incompatible With Secondary Licenses\" Notice\nThis Source Code Form is \"Incompatible With Secondary Licenses\", as defined by the Mozilla\nPublic License, v. 2.0.\n"}]}, {"tag": "text", "content": "\n"}]