[{"type": "optional", "content": {"type": "text", "content": "Microsoft Public License (Ms-PL)"}}, {"type": "text", "content": "\n\n      This license governs use of the accompanying software. If you use the software, you accept this license.\n         If you do not accept the license, do not use the software.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions\n            The terms \"reproduce,\" \"reproduction,\" \"derivative works,\"\n                 and \"distribution\" have the same meaning here as under U.S. copyright law. A\n                 \"contribution\" is the original software, or any additions or changes to the\n                 software. A \"contributor\" is any person that distributes its contribution\n                 under this license. \"Licensed patents\" are a contributor's patent\n                 claims that read directly on its contribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of Rights\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(A)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Copyright Grant- Subject to the terms of this license, including the license conditions and\n                 limitations in section 3, each contributor grants you a non-exclusive, worldwide,\n                 royalty-free copyright license to reproduce its contribution, prepare derivative works of\n                 its contribution, and distribute its contribution or any derivative works that you\n                 create.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(B)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Patent Grant- Subject to the terms of this license, including the license conditions and\n                 limitations in section 3, each contributor grants you a non-exclusive, worldwide,\n                 royalty-free license under its licensed patents to make, have made, use, sell, offer for\n                 sale, import, and/or otherwise dispose of its contribution in the software or derivative\n                 works of the contribution in the software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Conditions and Limitations\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(A)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              No Trademark License- This license does not grant you rights to use any contributors'\n                 name, logo, or trademarks.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(B)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If you bring a patent claim against any contributor over patents that you claim are infringed\n                 by the software, your patent license from such contributor to the software ends\n                 automatically.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(C)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If you distribute any portion of the software, you must retain all copyright, patent,\n                 trademark, and attribution notices that are present in the software.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(D)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If you distribute any portion of the software in source code form, you may do so only under\n                 this license by including a complete copy of this license with your distribution. If you\n                 distribute any portion of the software in compiled or object code form, you may only do so\n                 under a license that complies with this license.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(E)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              The software is licensed \"as-is.\" You bear the risk of using it. The contributors\n                 give no express warranties, guarantees, or conditions. You may have additional consumer\n                 rights under your local laws which this license cannot change. To the extent permitted\n                 under your local laws, the contributors exclude the implied warranties of merchantability,\n                 fitness for a particular purpose and non-infringement."}]