[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright 2000, 2001, 2002, 2003 Nara Institute of Science\n                and Technology.  All Rights Reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n            Use, reproduction, and distribution of this software is permitted.\n            Any copy of this software, whether in its original form or modified,\n            must include both the above copyright notice and the following\n            paragraphs.\n\n            Nara Institute of Science and Technology (NAIST),\n            the copyright holders, disclaims all warranties with regard to this\n            software, including all implied warranties of merchantability and\n            fitness, in no event shall NAIST be liable for\n            any special, indirect or consequential damages or any damages\n            whatsoever resulting from loss of use, data or profits, whether in an\n            action of contract, negligence or other tortuous action, arising out\n            of or in connection with the use or performance of this software.\n\n            A large portion of the dictionary entries\n            originate from ICOT Free Software.  The following conditions for ICOT\n            Free Software applies to the current dictionary as well.\n\n            Each User may also freely distribute the Program, whether in its\n            original form or modified, to any third party or parties, PROVIDED\n            that the provisions of Section 3 (\"NO WARRANTY\") will ALWAYS appear\n            on, or be attached to, the Program, which is distributed substantially\n            in the same form as set out herein and that such intended\n            distribution, if actually made, will neither violate or otherwise\n            contravene any of the laws and regulations of the countries having\n            jurisdiction over the User or the intended distribution itself.\n\n            NO WARRANTY\n\n            The program was produced on an experimental basis in the course of the\n            research and development conducted during the project and is provided\n            to users as so produced on an experimental basis.  Accordingly, the\n            program is provided without any warranty whatsoever, whether express,\n            implied, statutory or otherwise.  The term \"warranty\" used herein\n            includes, but is not limited to, any warranty of the quality,\n            performance, merchantability and fitness for a particular purpose of\n            the program and the nonexistence of any infringement or violation of\n            any right of any third party.\n\n            Each user of the program will agree and understand, and be deemed to\n            have agreed and understood, that there is no warranty whatsoever for\n            the program and, accordingly, the entire risk arising from or\n            otherwise connected with the program is assumed by the user.\n\n            Therefore, neither ICOT, the copyright holder, or any other\n            organization that participated in or was otherwise related to the\n            development of the program and their respective officials, directors,\n            officers and other employees shall be held liable for any and all\n            damages, including, without limitation, general, special, incidental\n            and consequential damages, arising out of or otherwise in connection\n            with the use or inability to use the program or any product, material\n            or result produced or otherwise obtained by using the program,\n            regardless of whether they have been advised of, or otherwise had\n            knowledge of, the possibility of such damages at any time during the\n            project or thereafter.  Each user will be deemed to have agreed to the\n            foregoing by his or her commencement of use of the program.  The term\n            \"use\" as used herein includes, but is not limited to, the use,\n            modification, copying and distribution of the program and the\n            production of secondary products from the program.\n\n            In the case where the program, whether in its original form or\n            modified, was distributed or delivered to or received by a user from\n            any person, organization or entity other than ICOT, unless it makes or\n            grants independently of ICOT any specific warranty to the user in\n            writing, such person, organization or entity, will also be exempted\n            from and not be held liable to the user for any such damages as noted\n            above as far as the program is concerned."}]