[{"type": "optional", "content": {"type": "text", "content": "Non-Commercial Government Licence\n                for public sector information"}}, {"type": "text", "content": "\n            You are encouraged to use and re-use the Information that is available under this licence freely and flexibly, with only a few conditions.\n            Using information under this licence\n            Use of copyright and database right material expressly made available under this licence (the ‘Information’) indicates your acceptance of the terms and conditions below.\n            The Licensor grants you a worldwide, royalty-free, perpetual, non-exclusive licence to use the Information for Non-Commercial purposes only subject to the conditions below.\n            This licence does not affect your freedom under fair dealing or fair use or any other copyright or database right exceptions and limitations.\n            You are free to:\n            copy, publish, distribute and transmit the Information;\n                adapt the Information;\n                exploit the Information for Non-Commercial purposes for example, by combining it with other information in your own product or application.\n            You are not permitted to:\n            exercise any of the rights granted to you by this licence in any manner that is primarily intended for or directed toward commercial advantage or private monetary compensation.\n            You must, where you do any of the above:\n            acknowledge the source of the Information by including any attribution statement specified by the Information Provider(s) and, where possible, provide a link to this licence;\n                    If the Information Provider does not provide a specific attribution statement, you must use the following:\n                    Contains information licensed under the Non-Commercial Government Licence v2.0.\n                    If you are using Information from several Information Providers and listing multiple attributions is not practical in your product or application, you may include a URI or hyperlink to a resource that contains the required attribution statements.\n                ensure that any onward licensing of the Information – for example when combined with other information – is for Non-Commercial purposes only.\n                    These are important conditions of this licence and if you fail to comply with them or use the Information other than for Non-Commercial purposes the rights granted to you under this licence, or any similar licence granted by the Licensor, will end automatically.\n            Exemptions\n            This licence does not cover the use of:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "personal data in the Information;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "Information that has not been accessed by way of publication or disclosure under information access legislation (including the Freedom of Information Acts for the UK and Scotland) by or with the consent of the Information Provider;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "departmental or public sector organisation logos, crests, military insignia and the Royal Arms except where they form an integral part of a document or dataset;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "military insignia\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "third party rights the Information Provider is not authorised to license;\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "other intellectual property rights, including patents, trade marks, and design rights; and\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "identity documents such as the British Passport.\n            Non-endorsement\n            This licence does not grant you any right to use the Information in a way that suggests any official status or that the Information Provider and/or Licensor endorse you or your use of the Information.\n            No warranty\n            The Information is licensed ‘as is’ and the Information Provider excludes all representations, warranties, obligations and liabilities in relation to the Information to the maximum extent permitted by law.\n            The Information Provider is not liable for any errors or omissions in the Information and shall not be liable for any loss, injury or damage of any kind caused by its use. The Information Provider does not guarantee the continued supply of the Information.\n            Governing Law\n            This licence is governed by the laws of the jurisdiction in which the Information Provider has its principal place of business, unless otherwise specified by the Information Provider.\n            Definitions\n            In this licence the terms below have the following meanings:\n            ‘Information’ means information protected by copyright or by database right (for example, literary and artistic works, content, data and source code) offered for use under the terms of this licence.\n            ‘Information Provider’\nmeans the person or organisation providing the Information under this licence.\n            ‘Licensor’\nmeans any Information Provider which has the authority to offer Information under the terms of this licence or the Keeper of the Public Records, who has the authority to offer Information subject to Crown copyright and Crown database rights and Information subject to copyright and database right that has been assigned to or acquired by the Crown, under the terms of this licence.\n            ‘Non-Commercial purposes’\nmeans not intended for or directed toward commercial advantage or private monetary compensation. For the purposes of this licence, ‘private monetary compensation’ does not include the exchange of the Information for other copyrighted works by means of digital file-sharing or otherwise provided there is no payment of any monetary compensation in connection with the exchange of the Information.\n            ‘Use’\nas a verb, means doing any act which is restricted by copyright or database right, whether in the original medium or in any other medium, and includes without limitation distributing, copying, adapting, modifying as may be technically necessary to use it in a different mode or format.\n            ‘You’\nmeans the natural or legal person, or body of persons corporate or incorporate, acquiring rights under this licence."}]