[{"type": "optional", "content": {"type": "var", "name": "title", "content": {"type": "text", "content": "Conditions of Use"}, "pattern": "(Conditions|Terms) [oO]f [uU]se"}}, {"type": "text", "content": "\n      This software was developed by employees of the National Institute of\n        Standards and Technology (NIST), an agency of the Federal Government and\n        is being made available as a public service. Pursuant to title 17 United\n        States Code Section 105, works of NIST employees are not subject to\n        copyright protection in the United States. This software may be subject\n        to foreign copyright. Permission in the United States and in foreign\n        countries, to the extent that NIST may hold copyright, to use, copy,\n        modify, create derivative works, and distribute this software and its\n        documentation without fee is hereby granted on a non-exclusive basis,\n        provided that this notice and disclaimer of warranty appears in all\n        copies.\n      THE SOFTWARE IS PROVIDED \"AS IS\" WITHOUT ANY WARRANTY OF ANY KIND,\n        EITHER EXPRESSED, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO,\n        ANY WARRANTY THAT THE SOFTWARE WILL CONFORM TO SPECIFICATIONS, ANY\n        IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE,\n        AND FREEDOM FROM INFRINGEMENT, AND ANY WARRANTY THAT THE DOCUMENTATION\n        WILL CONFORM TO THE SOFTWARE, OR ANY WARRANTY THAT THE SOFTWARE WILL BE\n        ERROR FREE. IN NO EVENT SHALL NIST BE LIABLE FOR ANY DAMAGES, INCLUDING,\n        BUT NOT LIMITED TO, DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES,\n        ARISING OUT OF, RESULTING FROM, OR IN ANY WAY CONNECTED WITH THIS\n        SOFTWARE, WHETHER OR NOT BASED UPON WARRANTY, CONTRACT, TORT, OR\n        OTHERWISE, WHETHER OR NOT INJURY WAS SUSTAINED BY PERSONS OR PROPERTY OR\n        OTHERWISE, AND WHETHER OR NOT LOSS WAS SUSTAINED FROM, OR AROSE OUT OF\n        THE RESULTS OF, OR USE OF, THE SOFTWARE OR SERVICES PROVIDED HEREUNDER."}]