[{"type": "optional", "content": {"type": "text", "content": "Nokia Open Source License (NOKOS License)\n         Version 1.0a"}}, {"type": "text", "content": "\n\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DEFINITIONS.\n          \"Affiliates\" of a party shall mean an entity\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              which is directly or indirectly controlling such party;\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              which is under the same direct or indirect ownership or control as such party; or\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              which is directly or indirectly owned or controlled by such party.\n        For these purposes, an entity shall be treated as being controlled by another if that other\n           entity has fifty percent (50%) or more of the votes in such entity, is able to direct its\n           affairs and/or to control the composition of its board of directors or equivalent\n           body.\n        \"Commercial Use\" shall mean distribution or otherwise making the Covered Software\n           available to a third party.\n        \"Contributor\" shall mean each entity that creates or contributes to the creation of\n           Modifications.\n        \"Contributor Version\" shall mean in case of any Contributor the combination of the\n           Original Software, prior Modifications used by a Contributor, and the Modifications made\n           by that particular Contributor and in case of Nokia in addition the Original Software in\n           any form, including the form as Exceutable.\n        \"Covered Software\" shall mean the Original Software or Modifications or the\n           combination of the Original Software and Modifications, in each case including portions\n           thereof.\n        \"Electronic Distribution Mechanism\" shall mean a mechanism generally accepted in\n           the software development community for the electronic transfer of data.\n        \"Executable\" shall mean Covered Software in any form other than Source Code.\n        \"Nokia\" shall mean Nokia Corporation and its Affiliates.\n        \"Larger Work\" shall mean a work, which combines Covered Software or portions\n           thereof with code not governed by the terms of this License.\n        \"License\" shall mean this document.\n        \"Licensable\" shall mean having the right to grant, to the maximum extent possible,\n           whether at the time of the initial grant or subsequently acquired, any and all of the\n           rights conveyed herein.\n        \"Modifications\" shall mean any addition to or deletion from the substance or\n           structure of either the Original Software or any previous Modifications. When Covered\n           Software is released as a series of files, a Modification is:\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Any addition to or deletion from the contents of a file containing Original Software or\n               previous Modifications.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n            Any new file that contains any part of the Original Software or previous Modifications.\n        \"Original Software\" shall mean the Source Code of computer software code which is\n           described in the Source Code notice required by Exhibit A as Original Software, and which,\n           at the time of its release under this License is not already Covered Software governed by\n           this License.\n        \"Patent Claims\" shall mean any patent claim(s), now owned or hereafter acquired,\n           including without limitation, method, process, and apparatus claims, in any patent\n           Licensable by grantor.\n        \"Source Code\" shall mean the preferred form of the Covered Software for making\n           modifications to it, including all modules it contains, plus any associated interface\n           definition files, scripts used to control compilation and installation of an Executable,\n           or source code differential comparisons against either the Original Software or another\n           well known, available Covered Software of the Contributor's choice. The Source Code\n           can be in a compressed or archival form, provided the appropriate decompression or\n           de-archiving software is widely available for no charge.\n        \"You\" (or \"Your\") shall mean an individual or a legal entity exercising\n           rights under, and complying with all of the terms of, this License or a future version of\n           this License issued under Section 6.1. For legal entities, \"You\" includes\n           Affiliates of such entity.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          SOURCE CODE LICENSE.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Nokia Grant.\n                Subject to the terms of this License, Nokia hereby grants You a world-wide,\n                     royalty-free, non-exclusive license, subject to third party intellectual property\n                     claims:\n\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  under copyrights Licensable by Nokia to use, reproduce, modify, display, perform, sublicense\n                     and distribute the Original Software (or portions thereof) with or without Modifications,\n                     and/or as part of a Larger Work;\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  and under Patents Claims necessarily infringed by the making, using or selling of Original\n                     Software, to make, have made, use, practice, sell, and offer for sale, and/or otherwise\n                     dispose of the Original Software (or portions thereof).\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  The licenses granted in this Section 2.1(a) and (b) are effective on the date Nokia first\n                     distributes Original Software under the terms of this License.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Notwithstanding Section 2.1(b) above, no patent license is granted: 1) for code that You\n                     delete from the Original Software; 2) separate from the Original Software; or 3) for\n                     infringements caused by: i) the modification of the Original Software or ii) the\n                     combination of the Original Software with other software or devices.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Contributor Grant.\n                Subject to the terms of this License and subject to third party intellectual property\n                     claims, each Contributor hereby grants You a world-wide, royalty-free,\n                     non-exclusive license\n\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  under copyrights Licensable by Contributor, to use, reproduce, modify, display, perform,\n                     sublicense and distribute the Modifications created by such Contributor (or portions\n                     thereof) either on an unmodified basis, with other Modifications, as Covered Software\n                     and/or as part of a Larger Work; and\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  under Patent Claims necessarily infringed by the making, using, or selling of Modifications\n                     made by that Contributor either alone and/or in combination with its Contributor Version\n                     (or portions of such combination), to make, use, sell, offer for sale, have made, and/or\n                     otherwise dispose of: 1) Modifications made by that Contributor (or portions thereof); and\n                     2) the combination of Modifications made by that Contributor with its Contributor Version\n                     (or portions of such combination).\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  The licenses granted in Sections 2.2(a) and 2.2(b) are effective on the date Contributor\n                     first makes Commercial Use of the Covered Software.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Notwithstanding Section 2.2(b) above, no patent license is granted: 1) for any code that\n                     Contributor has deleted from the Contributor Version; 2) separate from the Contributor\n                     Version; 3) for infringements caused by: i) third party modifications of Contributor\n                     Version or ii) the combination of Modifications made by that Contributor with other\n                     software (except as part of the Contributor Version) or other devices; or 4) under Patent\n                     Claims infringed by Covered Software in the absence of Modifications made by that\n                     Contributor.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DISTRIBUTION OBLIGATIONS.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Application of License.\n                The Modifications which You create or to which You contribute are governed by the terms\n                     of this License, including without limitation Section 2.2. The Source Code version\n                     of Covered Software may be distributed only under the terms of this License or a\n                     future version of this License released under Section 6.1, and You must include a\n                     copy of this License with every copy of the Source Code You distribute. You may\n                     not offer or impose any terms on any Source Code version that alters or restricts\n                     the applicable version of this License or the recipients' rights hereunder.\n                     However, You may include an additional document offering the additional rights\n                     described in Section 3.5.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Availability of Source Code.\n                Any Modification which You create or to which You contribute must be made available in\n                     Source Code form under the terms of this License either on the same media as an\n                     Executable version or via an accepted Electronic Distribution Mechanism to anyone\n                     to whom you made an Executable version available; and if made available via\n                     Electronic Distribution Mechanism, must remain available for at least twelve (12)\n                     months after the date it initially became available, or at least six (6) months\n                     after a subsequent version of that particular Modification has been made available\n                     to such recipients. You are responsible for ensuring that the Source Code version\n                     remains available even if the Electronic Distribution Mechanism is maintained by a\n                     third party.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Description of Modifications.\n                You must cause all Covered Software to which You contribute to contain a file\n                     documenting the changes You made to create that Covered Software and the date of\n                     any change. You must include a prominent statement that the Modification is\n                     derived, directly or indirectly, from Original Software provided by Nokia and\n                     including the name of Nokia in (a) the Source Code, and (b) in any notice in an\n                     Executable version or related documentation in which You describe the origin or\n                     ownership of the Covered Software.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Intellectual Property Matters\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Third Party Claims. If Contributor has knowledge that a license under a third\n                     party's intellectual property rights is required to exercise the rights granted\n                     by such Contributor under Sections 2.1 or 2.2, Contributor must include a text file\n                     with the Source Code distribution titled \"LEGAL\" which describes the claim\n                     and the party making the claim in sufficient detail that a recipient will know whom to\n                     contact. If Contributor obtains such knowledge after the Modification is made\n                     available as described in Section 3.2, Contributor shall promptly modify the LEGAL\n                     file in all copies Contributor makes available thereafter and shall take other steps\n                     (such as notifying appropriate mailing lists or newsgroups) reasonably calculated to\n                     inform those who received the Covered Software that new knowledge has been\n                     obtained.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Contributor APIs. If Contributor's Modifications include an application programming\n                     interface and Contributor has knowledge of patent licenses which are reasonably\n                     necessary to implement that API, Contributor must also include this information in the\n                     LEGAL file.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  Representations. Contributor represents that, except as disclosed pursuant to Section\n                     3.4(a) above, Contributor believes that Contributor's Modifications are\n                     Contributor's original creation(s) and/or Contributor has sufficient rights to\n                     grant the rights conveyed by this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Required Notices.\n                You must duplicate the notice in Exhibit A in each file of the Source Code. If it is\n                     not possible to put such notice in a particular Source Code file due to its\n                     structure, then You must include such notice in a location (such as a relevant\n                     directory) where a user would be likely to look for such a notice. If You created\n                     one or more Modification(s) You may add your name as a Contributor to the notice\n                     described in Exhibit A. You must also duplicate this License in any documentation\n                     for the Source Code where You describe recipients' rights or ownership rights\n                     relating to Covered Software. You may choose to offer, and to charge a fee for,\n                     warranty, support, indemnity or liability obligations to one or more recipients of\n                     Covered Software. However, You may do so only on Your own behalf, and not on\n                     behalf of Nokia or any Contributor. You must make it absolutely clear that any\n                     such warranty, support, indemnity or liability obligation is offered by You alone,\n                     and You hereby agree to indemnify Nokia and every Contributor for any liability\n                     incurred by Nokia or such Contributor as a result of warranty, support, indemnity\n                     or liability terms You offer.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Distribution of Executable Versions.\n                You may distribute Covered Software in Executable form only if the requirements of\n                     Section 3.1-3.5 have been met for that Covered Software, and if You include a\n                     notice stating that the Source Code version of the Covered Software is available\n                     under the terms of this License, including a description of how and where You have\n                     fulfilled the obligations of Section 3.2. The notice must be conspicuously\n                     included in any notice in an Executable version, related documentation or\n                     collateral in which You describe recipients' rights relating to the Covered\n                     Software. You may distribute the Executable version of Covered Software or\n                     ownership rights under a license of Your choice, which may contain terms different\n                     from this License, provided that You are in compliance with the terms of this\n                     License and that the license for the Executable version does not attempt to limit\n                     or alter the recipient's rights in the Source Code version from the rights\n                     set forth in this License. If You distribute the Executable version under a\n                     different license You must make it absolutely clear that any terms which differ\n                     from this License are offered by You alone, not by Nokia or any Contributor. You\n                     hereby agree to indemnify Nokia and every Contributor for any liability incurred\n                     by Nokia or such Contributor as a result of any such terms You offer.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.7"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Larger Works.\n                You may create a Larger Work by combining Covered Software with other software not\n                     governed by the terms of this License and distribute the Larger Work as a single\n                     product. In such a case, You must make sure the requirements of this License are\n                     fulfilled for the Covered Software.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          INABILITY TO COMPLY DUE TO STATUTE OR REGULATION.\n            If it is impossible for You to comply with any of the terms of this License with respect to\n                 some or all of the Covered Software due to statute, judicial order, or regulation then\n                 You must: (a) comply with the terms of this License to the maximum extent possible;\n                 and (b) describe the limitations and the code they affect. Such description must be\n                 included in the LEGAL file described in Section 3.4 and must be included with all\n                 distributions of the Source Code.\n\n          Except to the extent prohibited by statute or regulation, such description must be sufficiently\n             detailed for a recipient of ordinary skill to be able to understand it.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          APPLICATION OF THIS LICENSE.\n            This License applies to code to which Nokia has attached the notice in Exhibit A and to\n                 related Covered Software.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          VERSIONS OF THE LICENSE.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              New Versions.\n                Nokia may publish revised and/or new versions of the License from time to time. Each\n                     version will be given a distinguishing version number.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Effect of New Versions.\n                Once Covered Software has been published under a particular version of the License, You\n                     may always continue to use it under the terms of that version. You may also choose\n                     to use such Covered Software under the terms of any subsequent version of the\n                     License published by Nokia. No one other than Nokia has the right to modify the\n                     terms applicable to Covered Software created under this License.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          DISCLAIMER OF WARRANTY.\n            COVERED SOFTWARE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT\n                 WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\n                 WARRANTIES THAT THE COVERED SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A\n                 PARTICULAR PURPOSE OR NON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND\n                 PERFORMANCE OF THE COVERED SOFTWARE IS WITH YOU. SHOULD ANY COVERED SOFTWARE PROVE\n                 DEFECTIVE IN ANY RESPECT, YOU (NOT NOKIA, ITS LICENSORS OR AFFILIATES OR ANY OTHER\n                 CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS\n                 DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY\n                 COVERED SOFTWARE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          TERMINATION.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              This License and the rights granted hereunder will terminate automatically if You fail to\n                 comply with terms herein and fail to cure such breach within 30 days of becoming aware of\n                 the breach. All sublicenses to the Covered Software which are properly granted shall\n                 survive any termination of this License. Provisions which, by their nature, must remain in\n                 effect beyond the termination of this License shall survive.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If You initiate litigation by asserting a patent infringement claim (excluding declatory\n                 judgment actions) against Nokia or a Contributor (Nokia or Contributor against whom You\n                 file such action is referred to as \"Participant\") alleging that:\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  such Participant's Contributor Version directly or indirectly infringes any patent,\n                     then any and all rights granted by such Participant to You under Sections 2.1 and/or\n                     2.2 of this License shall, upon 60 days notice from Participant terminate\n                     prospectively, unless if within 60 days after receipt of notice You either: (i) agree\n                     in writing to pay Participant a mutually agreeable reasonable royalty for Your past\n                     and future use of Modifications made by such Participant, or (ii) withdraw Your\n                     litigation claim with respect to the Contributor Version against such Participant. If\n                     within 60 days of notice, a reasonable royalty and payment arrangement are not\n                     mutually agreed upon in writing by the parties or the litigation claim is not\n                     withdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2\n                     automatically terminate at the expiration of the 60 day notice period specified\n                     above.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                  any software, hardware, or device, other than such Participant's Contributor\n                     Version, directly or indirectly infringes any patent, then any rights granted to You\n                     by such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the\n                     date You first made, used, sold, distributed, or had made, Modifications made by that\n                     Participant.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              If You assert a patent infringement claim against Participant alleging that such\n                 Participant's Contributor Version directly or indirectly infringes any patent where\n                 such claim is resolved (such as by license or settlement) prior to the initiation of\n                 patent infringement litigation, then the reasonable value of the licenses granted by such\n                 Participant under Sections 2.1 or 2.2 shall be taken into account in determining the\n                 amount or value of any payment or license.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              In the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n                 (excluding distributors and resellers) which have been validly granted by You or any\n                 distributor hereunder prior to termination shall survive termination.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          LIMITATION OF LIABILITY.\n            UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE),\n                 CONTRACT, OR OTHERWISE, SHALL YOU, NOKIA, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\n                 COVERED SOFTWARE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY PERSON FOR\n                 ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER\n                 INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER\n                 FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF\n                 SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\n                 LIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\n                 RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS\n                 SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF\n                 INCIDENTAL OR CONSEQUENTIAL DAMAGES, BUT MAY ALLOW LIABILITY TO BE LIMITED; IN SUCH\n                 CASES, A PARTY's, ITS EMPLOYEES, LICENSORS OR AFFILIATES' LIABILITY SHALL BE\n                 LIMITED TO U.S. $50. Nothing contained in this License shall prejudice the statutory\n                 rights of any party dealing as a consumer.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          MISCELLANEOUS.\n            This License represents the complete agreement concerning subject matter hereof. All rights\n                 in the Covered Software not expressly granted under this License are reserved. Nothing\n                 in this License shall grant You any rights to use any of the trademarks of Nokia or\n                 any of its Affiliates, even if any of such trademarks are included in any part of\n                 Covered Software and/or documentation to it.\n\n          This License is governed by the laws of Finland excluding its conflict-of-law provisions. All\n             disputes arising from or relating to this Agreement shall be settled by a single arbitrator\n             appointed by the Central Chamber of Commerce of Finland. The arbitration procedure shall take\n             place in Helsinki, Finland in the English language. If any part of this Agreement is found\n             void and unenforceable, it will not affect the validity of the balance of the Agreement, which\n             shall remain valid and enforceable according to its terms.\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          RESPONSIBILITY FOR CLAIMS.\n             As between Nokia and the Contributors, each party is responsible for claims and damages arising, directly\n             or indirectly, out of its utilization of rights under this License and You agree to work with Nokia\n             and Contributors to distribute such responsibility on an equitable basis. Nothing herein is intended\n             or shall be deemed to constitute any admission of liability.\n      "}, {"type": "optional", "content": {"type": "text", "content": "EXHIBIT A\n         The contents of this file are subject to the NOKOS License Version 1.0 (the \"License\"); you may\n         not use this file except in compliance with the License.\n         Software distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF\n         ANY KIND, either express or implied. See the License for the specific language governing rights and\n         limitations under the License.\n         The Original Software is\n         ______________________________________.\n         Copyright © <year> Nokia and others. All Rights Reserved.\n         Contributor(s): ______________________________________."}}]