[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nNetscape Public LIcense version 1.1\n"}]}, {"tag": "text", "content": "\nAMENDMENTS\nThe Netscape Public License Version 1.1 (\"NPL\") consists of the Mozilla Public License Version 1.1 with\nthe following Amendments, including Exhibit A-Netscape Public License. Files identified with \"Exhibit\nA-Netscape Public License\" are governed by the Netscape Public License Version 1.1.\nAdditional Terms applicable to the Netscape Public License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "I."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect.\nThese additional terms described in this Netscape Public License -- Amendments shall\napply to the Mozilla Communicator client code and to all Covered Code under this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "II."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Netscape's Branded Code\" means Covered Code that Netscape distributes and/or permits others\nto distribute under one or more trademark(s) which are controlled by Netscape but which\nare not licensed for use under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "III."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNetscape and logo.\nThis License does not grant any rights to use the trademarks \"Netscape\", the \"Netscape\nN and horizon\" logo or the \"Netscape lighthouse\" logo, \"Netcenter\", \"Gecko\",\n\"Java\" or \"JavaScript\", \"Smart Browsing\" even if such marks are included in the\nOriginal Code or Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "IV."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Contractual Obligation.\nPrior to licensing the Original Code under this License, Netscape has licensed third\nparty code for use in Netscape's Branded Code. To the extent that Netscape is\nlimited contractually from making such third party code available under this\nLicense, Netscape may choose to reintegrate such code into Covered Code without\nbeing required to distribute such code in Source Code form, even if such code\nwould otherwise be considered \"Modifications\" under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "V."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nUse of Modifications and Covered Code by Initial Developer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "V.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn General.\nThe obligations of Section 3 apply to Netscape, except to the extent specified\nin this Amendment, Section V.2 and V.3.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "V.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOther Products.\nNetscape may include Covered Code in products other than the Netscape's Branded\nCode which are released by Netscape during the two (2) years following the\nrelease date of the Original Code, without such additional products\nbecoming subject to the terms of this License, and may license such\nadditional products on different terms from those contained in this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "V.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAlternative Licensing.\nNetscape may license the Source Code of Netscape's Branded Code, including\nModifications incorporated therein, without such Netscape Branded Code\nbecoming subject to the terms of this License, and may license such\nNetscape Branded Code on different terms from those contained in this\nLicense.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "VI."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLitigation.\nNotwithstanding the limitations of Section 11 above, the provisions regarding\nlitigation in Section 11(a), (b) and (c) of the License shall apply to all\ndisputes relating to this License.\nEXHIBIT A-Netscape Public License.\n\"The contents of this file are subject to the Netscape Public License Version 1.1 (the\n\"License\"); you may not use this file except in compliance with the License. You may\nobtain a copy of the License at http://www.mozilla.org/NPL/\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY\nOF ANY KIND, either express or implied. See the License for the specific language\ngoverning rights and limitations under the License.\nThe Original Code is Mozilla Communicator client code, released March 31, 1998.\nThe Initial Developer of the Original Code is Netscape Communications Corporation.\nPortions created by Netscape are Copyright (C) 1998-1999 Netscape Communications\nCorporation. All Rights Reserved.\nContributor(s): ______________________________________.\nAlternatively, the contents of this file may be used under the terms of the _____ license\n(the \"[___] License\"), in which case the provisions of [______] License are applicable\ninstead of those above. If you wish to allow use of your version of this file only under\nthe terms of the [____] License and not to allow others to use your version of this file\nunder the NPL, indicate your decision by deleting the provisions above and replace them\nwith the notice and other provisions required by the [___] License. If you do not delete\nthe provisions above, a recipient may use your version of this file under either the NPL\nor the [___] License.\"\nMozilla Public License Version 1.1\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\n1.0.1. \"Commercial Use\" means distribution or otherwise making the Covered Code available to a\nthird party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor Version\" means the combination of the Original Code, prior Modifications used by\na Contributor, and the Modifications made by that particular Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Covered Code\" means the Original Code or Modifications or the combination of the Original\nCode and Modifications, in each case including portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software\ndevelopment community for the electronic transfer of data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Executable\" means Covered Code in any form other than Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Initial Developer\" means the individual or entity identified as the Initial Developer in the\nSource Code notice required by Exhibit A.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work which combines Covered Code or portions thereof with code not\ngoverned by the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"License\" means this document.\n1.8.1. \"Licensable\" means having the right to grant, to the maximum extent possible, whether\nat the time of the initial grant or subsequently acquired, any and all of the rights\nconveyed herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" means any addition to or deletion from the substance or structure of either\nthe Original Code or any previous Modifications. When Covered Code is released as a series\nof files, a Modification is:\nAny addition to or deletion from the contents of a file containing Original Code or\nprevious Modifications.\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Code\" means Source Code of computer software code which is described in the Source\nCode notice required by Exhibit A as Original Code, and which, at the time of its release\nunder this License is not already Covered Code governed by this License.\n1.10.1. \"Patent Claims\" means any patent claim(s), now owned or hereafter acquired, including\nwithout limitation, method, process, and apparatus claims, in any patent Licensable by\ngrantor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" means the preferred form of the Covered Code for making modifications to it,\nincluding all modules it contains, plus any associated interface definition files, scripts\nused to control compilation and installation of an Executable, or source code differential\ncomparisons against either the Original Code or another well known, available Covered Code\nof the Contributor's choice. The Source Code can be in a compressed or archival form,\nprovided the appropriate decompression or de-archiving software is widely available for no\ncharge.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" (or \"Your\") means an individual or a legal entity exercising rights under, and\ncomplying with all of the terms of, this License or a future version of this License\nissued under Section 6.1. For legal entities, \"You\" includes any entity which controls, is\ncontrolled by, or is under common control with You. For purposes of this definition,\n\"control\" means (a) the power, direct or indirect, to cause the direction or management of\nsuch entity, whether by contract or otherwise, or (b) ownership of more than fifty percent\n(50%) of the outstanding shares or beneficial ownership of such entity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSource Code License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Initial Developer Grant. The Initial Developer hereby grants You a world-wide,\nroyalty-free, non-exclusive license, subject to third party intellectual property\nclaims:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by Initial\nDeveloper to use, reproduce, modify, display, perform, sublicense and distribute the\nOriginal Code (or portions thereof) with or without Modifications, and/or as part of a\nLarger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patents Claims infringed by the making, using or selling of Original Code, to make,\nhave made, use, practice, sell, and offer for sale, and/or otherwise dispose of the\nOriginal Code (or portions thereof).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in this Section 2.1 (a) and (b) are effective on the date Initial\nDeveloper first distributes Original Code under the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.1 (b) above, no patent license is granted: 1) for code that You\ndelete from the Original Code; 2) separate from the Original Code; or 3) for\ninfringements caused by: i) the modification of the Original Code or ii) the\ncombination of the Original Code with other software or devices.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor Grant. Subject to third party intellectual property claims, each Contributor\nhereby grants You a world-wide, royalty-free, non-exclusive license\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder intellectual property rights (other than patent or trademark) Licensable by\nContributor, to use, reproduce, modify, display, perform, sublicense and distribute\nthe Modifications created by such Contributor (or portions thereof) either on an\nunmodified basis, with other Modifications, as Covered Code and/or as part of a Larger\nWork; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by\nthat Contributor either alone and/or in combination with its Contributor Version (or\nportions of such combination), to make, use, sell, offer for sale, have made, and/or\notherwise dispose of: 1) Modifications made by that Contributor (or portions thereof);\nand 2) the combination of Modifications made by that Contributor with its Contributor\nVersion (or portions of such combination).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe licenses granted in Sections 2.2 (a) and 2.2 (b) are effective on the date\nContributor first makes Commercial Use of the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNotwithstanding Section 2.2 (b) above, no patent license is granted: 1) for any code that\nContributor has deleted from the Contributor Version; 2) separate from the Contributor\nVersion; 3) for infringements caused by: i) third party modifications of Contributor\nVersion or ii) the combination of Modifications made by that Contributor with other\nsoftware (except as part of the Contributor Version) or other devices; or 4) under\nPatent Claims infringed by Covered Code in the absence of Modifications made by that\nContributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution Obligations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of License. The Modifications which You create or to which You contribute are\ngoverned by the terms of this License, including without limitation Section 2.2. The\nSource Code version of Covered Code may be distributed only under the terms of this\nLicense or a future version of this License released under Section 6.1, and You must\ninclude a copy of this License with every copy of the Source Code You distribute. You may\nnot offer or impose any terms on any Source Code version that alters or restricts the\napplicable version of this License or the recipients' rights hereunder. However, You may\ninclude an additional document offering the additional rights described in Section\n3.5.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAvailability of Source Code. Any Modification which You create or to which You contribute\nmust be made available in Source Code form under the terms of this License either on the\nsame media as an Executable version or via an accepted Electronic Distribution Mechanism\nto anyone to whom you made an Executable version available; and if made available via\nElectronic Distribution Mechanism, must remain available for at least twelve (12) months\nafter the date it initially became available, or at least six (6) months after a\nsubsequent version of that particular Modification has been made available to such\nrecipients. You are responsible for ensuring that the Source Code version remains\navailable even if the Electronic Distribution Mechanism is maintained by a third\nparty.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDescription of Modifications. You must cause all Covered Code to which You contribute to\ncontain a file documenting the changes You made to create that Covered Code and the date\nof any change. You must include a prominent statement that the Modification is derived,\ndirectly or indirectly, from Original Code provided by the Initial Developer and including\nthe name of the Initial Developer in (a) the Source Code, and (b) in any notice in an\nExecutable version or related documentation in which You describe the origin or ownership\nof the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property Matters\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Claims\nIf Contributor has knowledge that a license under a third party's intellectual\nproperty rights is required to exercise the rights granted by such Contributor\nunder Sections 2.1 or 2.2, Contributor must include a text file with the\nSource Code distribution titled \"LEGAL\" which describes the claim and the\nparty making the claim in sufficient detail that a recipient will know whom to\ncontact. If Contributor obtains such knowledge after the Modification is made\navailable as described in Section 3.2, Contributor shall promptly modify the\nLEGAL file in all copies Contributor makes available thereafter and shall take\nother steps (such as notifying appropriate mailing lists or newsgroups)\nreasonably calculated to inform those who received the Covered Code that new\nknowledge has been obtained.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor APIs\nIf Contributor's Modifications include an application programming interface and\nContributor has knowledge of patent licenses which are reasonably necessary to\nimplement that API, Contributor must also include this information in the\nLEGAL file.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRepresentations.\nContributor represents that, except as disclosed pursuant to Section 3.4 (a) above,\nContributor believes that Contributor's Modifications are Contributor's\noriginal creation(s) and/or Contributor has sufficient rights to grant the\nrights conveyed by this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRequired Notices. You must duplicate the notice in Exhibit A in each file of the Source Code.\nIf it is not possible to put such notice in a particular Source Code file due to its\nstructure, then You must include such notice in a location (such as a relevant directory)\nwhere a user would be likely to look for such a notice. If You created one or more\nModification(s) You may add your name as a Contributor to the notice described in Exhibit\nA. You must also duplicate this License in any documentation for the Source Code where You\ndescribe recipients' rights or ownership rights relating to Covered Code. You may choose\nto offer, and to charge a fee for, warranty, support, indemnity or liability obligations\nto one or more recipients of Covered Code. However, You may do so only on Your own behalf,\nand not on behalf of the Initial Developer or any Contributor. You must make it absolutely\nclear than any such warranty, support, indemnity or liability obligation is offered by You\nalone, and You hereby agree to indemnify the Initial Developer and every Contributor for\nany liability incurred by the Initial Developer or such Contributor as a result of\nwarranty, support, indemnity or liability terms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Versions. You may distribute Covered Code in Executable form only\nif the requirements of Sections 3.1, 3.2, 3.3, 3.4 and 3.5 have been met for that Covered\nCode, and if You include a notice stating that the Source Code version of the Covered Code\nis available under the terms of this License, including a description of how and where You\nhave fulfilled the obligations of Section 3.2. The notice must be conspicuously included\nin any notice in an Executable version, related documentation or collateral in which You\ndescribe recipients' rights relating to the Covered Code. You may distribute the\nExecutable version of Covered Code or ownership rights under a license of Your choice,\nwhich may contain terms different from this License, provided that You are in compliance\nwith the terms of this License and that the license for the Executable version does not\nattempt to limit or alter the recipient's rights in the Source Code version from the\nrights set forth in this License. If You distribute the Executable version under a\ndifferent license You must make it absolutely clear that any terms which differ from this\nLicense are offered by You alone, not by the Initial Developer or any Contributor. You\nhereby agree to indemnify the Initial Developer and every Contributor for any liability\nincurred by the Initial Developer or such Contributor as a result of any such terms You\noffer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works. You may create a Larger Work by combining Covered Code with other code not\ngoverned by the terms of this License and distribute the Larger Work as a single product.\nIn such a case, You must make sure the requirements of this License are fulfilled for the\nCovered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect to some\nor all of the Covered Code due to statute, judicial order, or regulation then You must: (a)\ncomply with the terms of this License to the maximum extent possible; and (b) describe the\nlimitations and the code they affect. Such description must be included in the LEGAL file\ndescribed in Section 3.4 and must be included with all distributions of the Source Code.\nExcept to the extent prohibited by statute or regulation, such description must be\nsufficiently detailed for a recipient of ordinary skill to be able to understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of this License.\nThis License applies to code to which the Initial Developer has attached the notice in\nExhibit A and to related Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions\nNetscape Communications Corporation (\"Netscape\") may publish revised and/or new\nversions of the License from time to time. Each version will be given a\ndistinguishing version number.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions\nOnce Covered Code has been published under a particular version of the License, You may\nalways continue to use it under the terms of that version. You may also choose to\nuse such Covered Code under the terms of any subsequent version of the License\npublished by Netscape. No one other than Netscape has the right to modify the\nterms applicable to Covered Code created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDerivative Works\nIf You create or use a modified version of this License (which you may only do in order\nto apply it to code which is not already Covered Code governed by this License),\nYou must (a) rename Your license so that the phrases \"Mozilla\", \"MOZILLAPL\",\n\"MOZPL\", \"Netscape\", \"MPL\", \"NPL\" or any confusingly similar phrase do not appear\nin your license (except to note that your license differs from this License) and\n(b) otherwise make it clear that Your version of the license contains terms which\ndiffer from the Mozilla Public License and Netscape Public License. (Filling in\nthe name of the Initial Developer, Original Code or Contributor in the notice\ndescribed in Exhibit A shall not of themselves be deemed to be modifications of\nthis License.)\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDISCLAIMER OF WARRANTY\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\nCOVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR\nNON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE\nIS WITH YOU. SHOULD ANY COVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE\nINITIAL DEVELOPER OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY\nSERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL\nPART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER\nTHIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to\ncomply with terms herein and fail to cure such breach within 30 days of becoming aware of\nthe breach. All sublicenses to the Covered Code which are properly granted shall survive\nany termination of this License. Provisions which, by their nature, must remain in effect\nbeyond the termination of this License shall survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You initiate litigation by asserting a patent infringement claim (excluding declatory\njudgment actions) against Initial Developer or a Contributor (the Initial Developer or\nContributor against whom You file such action is referred to as \"Participant\") alleging\nthat:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsuch Participant's Contributor Version directly or indirectly infringes any patent, then\nany and all rights granted by such Participant to You under Sections 2.1 and/or 2.2 of\nthis License shall, upon 60 days notice from Participant terminate prospectively,\nunless if within 60 days after receipt of notice You either: (i) agree in writing to\npay Participant a mutually agreeable reasonable royalty for Your past and future use\nof Modifications made by such Participant, or (ii) withdraw Your litigation claim with\nrespect to the Contributor Version against such Participant. If within 60 days of\nnotice, a reasonable royalty and payment arrangement are not mutually agreed upon in\nwriting by the parties or the litigation claim is not withdrawn, the rights granted by\nParticipant to You under Sections 2.1 and/or 2.2 automatically terminate at the\nexpiration of the 60 day notice period specified above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany software, hardware, or device, other than such Participant's Contributor Version,\ndirectly or indirectly infringes any patent, then any rights granted to You by such\nParticipant under Sections 2.1(b) and 2.2(b) are revoked effective as of the date You\nfirst made, used, sold, distributed, or had made, Modifications made by that\nParticipant.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such\nParticipant's Contributor Version directly or indirectly infringes any patent where such\nclaim is resolved (such as by license or settlement) prior to the initiation of patent\ninfringement litigation, then the reasonable value of the licenses granted by such\nParticipant under Sections 2.1 or 2.2 shall be taken into account in determining the\namount or value of any payment or license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE),\nCONTRACT, OR OTHERWISE, SHALL YOU, THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR\nANY DISTRIBUTOR OF COVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO\nANY PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY\nCHARACTER INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE,\nCOMPUTER FAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES,\nEVEN IF SUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\nLIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\nRESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH\nLIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL\nOR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nU.S. government end users\nThe Covered Code is a \"commercial item,\" as that term is defined in 48 C.F.R. 2.101 (Oct.\n1995), consisting of \"commercial computer software\" and \"commercial computer software\ndocumentation,\" as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent\nwith 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all\nU.S. Government End Users acquire Covered Code with only those rights set forth\nherein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous\nThis License represents the complete agreement concerning subject matter hereof. If any\nprovision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. This License shall be\ngoverned by California law provisions (except to the extent applicable law, if any,\nprovides otherwise), excluding its conflict-of-law provisions. With respect to\ndisputes in which at least one party is a citizen of, or an entity chartered or\nregistered to do business in the United States of America, any litigation relating to\nthis License shall be subject to the jurisdiction of the Federal Courts of the\nNorthern District of California, with venue lying in Santa Clara County, California,\nwith the losing party responsible for costs, including without limitation, court costs\nand reasonable attorneys' fees and expenses. The application of the United Nations\nConvention on Contracts for the International Sale of Goods is expressly excluded. Any\nlaw or regulation which provides that the language of a contract shall be construed\nagainst the drafter shall not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nResponsibility for claims\nAs between Initial Developer and the Contributors, each party is responsible for claims and\ndamages arising, directly or indirectly, out of its utilization of rights under this\nLicense and You agree to work with Initial Developer and Contributors to distribute\nsuch responsibility on an equitable basis. Nothing herein is intended or shall be\ndeemed to constitute any admission of liability.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMultiple-licensed code\nInitial Developer may designate portions of the Covered Code as \"Multiple-Licensed\".\n\"Multiple-Licensed\" means that the Initial Developer permits you to utilize portions of the\nCovered Code under Your choice of the MPL or the alternative licenses, if any, specified by\nthe Initial Developer in the file described in Exhibit A.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nExhibit A - Mozilla Public License.\n\"The contents of this file are subject to the Mozilla Public License Version 1.1 (the \"License\"); you may\nnot use this file except in compliance with the License. You may obtain a copy of the License at\nhttp://www.mozilla.org/MPL/\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND,\neither express or implied. See the License for the specific language governing rights and limitations\nunder the License.\nThe Original Code is ______________________________________.\nThe Initial Developer of the Original Code is ________________________.\nPortions created by ______________________ are Copyright (C) ______\n_______________________. All Rights Reserved.\nContributor(s): ______________________________________.\nAlternatively, the contents of this file may be used under the terms of the _____ license (the \"[___]\nLicense\"), in which case the provisions of [______] License are applicable instead of those above. If\nyou wish to allow use of your version of this file only under the terms of the [____] License and not\nto allow others to use your version of this file under the MPL, indicate your decision by deleting the\nprovisions above and replace them with the notice and other provisions required by the [___] License.\nIf you do not delete the provisions above, a recipient may use your version of this file under either\nthe MPL or the [___] License.\"\nNOTE: The text of this Exhibit A may differ slightly from the text of the notices in the Source Code\nfiles of the Original Code. You should use the text of this Exhibit A rather than the text found in\nthe Original Code Source Code for Your Modifications.\n"}]}, {"tag": "text", "content": "\n"}]