[{"type": "optional", "content": {"type": "text", "content": "OCLC Research Public License 2.0\n      Terms & Conditions Of Use\n      May, 2002"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright © 2002. OCLC Online Computer Library Center, Inc. All Rights Reserved"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      PLEASE READ THIS DOCUMENT CAREFULLY. BY DOWNLOADING OR USING THE CODE BASE AND/OR DOCUMENTATION ACCOMPANYING\n       THIS LICENSE (THE \"License\"), YOU AGREE TO THE FOLLOWING TERMS AND CONDITIONS OF THIS LICENSE.\n\n      Section 1. Your Rights\n      Subject to these terms and conditions of this License, the OCLC Office of Research (the \"Original\n       Contributor\") and each subsequent contributor (collectively with the Original Contributor, the\n       \"Contributors\") hereby grant you a non-exclusive, worldwide, no-charge, transferable license to execute,\n       prepare derivative works of, and distribute (internally and externally), for commercial and noncommercial\n       purposes, the original code contributed by Original Contributor and all Modifications (collectively called\n       the \"Program\").\n      Section 2. Definitions\n      A \"Modification\" to the Program is any addition to or deletion from the contents of any file of the Program\n       and any new file that contains any part of the Program. If you make a Modification and distribute the\n       Program externally you are a \"Contributor.\" The distribution of the Program must be under the terms of\n       this license including those in Section 3 below.\n      A \"Combined Work\" results from combining and integrating all or parts of the Program with other code. A\n       Combined Work may be thought of as having multiple parents or being result of multiple lines of code\n       development.\n      Section 3. Distribution Licensing Terms\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "A."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        General Requirements\n          Except as necessary to recognize third-party rights or third-party restriction (see below), a\n               distribution of the Program in any of the forms listed below must not put any further\n               restrictions on the recipient’s exercise of the rights granted herein.\n\n        As a Contributor, you represent that your Modification(s) are your original creation(s) and, to the\n           best of your knowledge, no third party has any claim (including but not limited to intellectual\n           property claims) relating to your Modification(s). You represent that each of your Modifications\n           includes complete details of any third-party right or other third-party restriction associated\n           with any part of your Modification (including a copy of any applicable license agreement).\n            The Program must be distributed without charge beyond the costs of physically transferring the files\n           to the recipient.\n            This Warranty Disclaimer/Limitation of Liability must be prominently displayed with every\n           distribution of the Program in any form:\n            YOU AGREE THAT THE PROGRAM IS PROVIDED AS-IS, WITHOUT WARRANTY OF ANY KIND (EITHER EXPRESS OR\n           IMPLIED). ACCORDINGLY, OCLC MAKES NO WARRANTIES, REPRESENTATIONS OR GUARANTEES, EITHER EXPRESS OR\n           IMPLIED, AND DISCLAIMS ALL SUCH WARRANTIES, REPRESENTATIONS OR GUARANTEES, INCLUDING, WITHOUT\n           LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR ANY PARTICULAR PURPOSE, AS\n           TO: (A) THE FUNCTIONALITY OR NONINFRINGEMENT OF PROGRAM, ANY MODIFICATION, A COMBINED WORK OR AN\n           AGGREGATE WORK; OR (B) THE RESULTS OF ANY PROJECT UNDERTAKEN USING THE PROGRAM, ANY MODIFICATION,\n           A COMBINED WORK OR AN AGGREGATE WORK. IN NO EVENT SHALL THE CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\n           INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, CONSEQUENTIAL OR ANY OTHER DAMAGES (INCLUDING, BUT NOT\n           LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n           BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n           LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THE\n           PROGRAM, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. YOU HEREBY WAIVE ANY CLAIMS FOR\n           DAMAGES OF ANY KIND AGAINST CONTRIBUTORS WHICH MAY RESULT FROM YOUR USE OF THE PROGRAM.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "B."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Requirements for a Distribution of Modifiable Code\n          If you distribute the Program in a form to which the recipient can make Modifications (e.g.\n               source code), the terms of this license apply to use by recipient. In addition, each\n               source and data file of the Program and any Modification you distribute must contain the\n               following notice:\n        "}, {"type": "optional", "content": {"type": "text", "content": "\""}}, {"type": "text", "content": "Copyright (c) "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "2000- (insert then current year) OCLC Online Computer Library Center, Inc. and other\n           contributors"}, "pattern": ".+"}, {"type": "text", "content": ". All rights reserved. The contents of this file, as updated from time to time by the\n           OCLC Office of Research, are subject to OCLC Research Public License Version 2.0 (the \"License\");\n           you may not use this file except in compliance with the License. You may obtain a current copy of\n           the License at http://purl.oclc.org/oclc/research/ORPL/. Software distributed under the License is\n           distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND, either express or implied. See the\n           License for the specific language governing rights and limitations under the License. This\n           software consists of voluntary contributions made by many individuals on behalf of OCLC Research.\n           For more information on OCLC Research, please see http://www.oclc.org/research/. The Original Code\n           is "}, {"type": "var", "name": "code", "content": {"type": "text", "content": "______________________________"}, "pattern": ".+"}, {"type": "text", "content": ". The Initial Developer of the Original Code is\n           "}, {"type": "var", "name": "initialDeveloper", "content": {"type": "text", "content": "________________________"}, "pattern": ".+"}, {"type": "text", "content": ". Portions created by "}, {"type": "var", "name": "creator", "content": {"type": "text", "content": "______________________"}, "pattern": ".+"}, {"type": "text", "content": " are Copyright (C) "}, {"type": "var", "name": "copyright2", "content": {"type": "text", "content": "____________________________"}, "pattern": ".+"}, {"type": "text", "content": ". All Rights Reserved. Contributor(s):\n           "}, {"type": "var", "name": "contributor", "content": {"type": "text", "content": "______________________________________"}, "pattern": ".+"}, {"type": "text", "content": "."}, {"type": "optional", "content": {"type": "text", "content": "\""}}, {"type": "text", "content": "\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "C."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Requirements for a Distribution of Non-modifiable Code\n          If you distribute the Program in a form to which the recipient cannot make Modifications (e.g.\n               object code), the terms of this license apply to use by recipient and you must include the\n               following statement in appropriate and conspicuous locations:\n\n        \"Copyright (c) 2000- (insert then current year) OCLC Online Computer Library Center, Inc. and other\n           contributors. All rights reserved.\"\n            In addition, the source code must be included with the object code distribution or the distributor\n           must provide the source code to the recipient upon request.\n         "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "D."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n        Requirements for a Combined Work Distribution\n\n        Distributions of Combined Works are subject to the terms of this license and must be made at no charge to the\n           recipient beyond the costs of physically transferring the files to recipient.\n            A Combined Work may be distributed as either modifiable or non-modifiable code. The requirements of Section\n           3.B or 3.C above (as appropriate) apply to such distributions.\n            An \"Aggregate Work\" is when the Program exists, without integration, with other programs on a storage medium.\n           This License does not apply to portions of an Aggregate Work which are not covered by the definition of\n           \"Program\" provided in this License. You are not forbidden from selling an Aggregate Work. However, the\n           Program contained in an Aggregate Work is subject to this License. Also, should the Program be extracted\n           from an Aggregate Work, this License applies to any use of the Program apart from the Aggregate Work.\n            Section 4. License Grant\n            For purposes of permitting use of your Modifications by OCLC and other licensees hereunder, you hereby grant\n           to OCLC and such other licensees the non-exclusive, worldwide, royalty-free, transferable, sublicenseable\n           license to execute, copy, alter, delete, modify, adapt, change, revise, enhance, develop, publicly\n           display, distribute (internally and externally) and/or create derivative works based on your Modifications\n           (and derivative works thereof) in accordance with these Terms. This Section 4 shall survive termination of\n           this License for any reason.\n      Section 5. Termination of Rights\n      This non-exclusive license (with respect to the grant from a particular Contributor) automatically terminates\n       for any entity that initiates legal action for intellectual property infringement (with respect to the\n       Program) against such Contributor as of the initiation of such action.\n      If you fail to comply with this License, your rights (but not your obligations) under this License shall\n       terminate automatically unless you cure such breach within thirty (30) days of becoming aware of the\n       noncompliance. All sublicenses granted by you which preexist such termination and are properly granted\n       shall survive such termination.\n      Section 6. Other Terms\n      Except for the copyright notices required above, you may not use any trademark of any of the Contributors\n       without the prior written consent of the relevant Contributor. You agree not to remove, alter or obscure\n       any copyright or other proprietary rights notice contained in the Program.\n      All transfers of the Program or any part thereof shall be made in compliance with U.S. import/export\n       regulations or other restrictions of the U.S. Department of Commerce, as well as other similar trade or\n       commerce restrictions which might apply.\n      Any patent obtained by any party covering the Program or any part thereof must include a provision providing\n       for the free, perpetual and unrestricted commercial and noncommercial use by any third party.\n      If, as a consequence of a court judgment or settlement relating to intellectual property infringement or any\n       other cause of action, conditions are imposed on you that contradict the conditions of this License, such\n       conditions do not excuse you from compliance with this License. If you cannot distribute the Program so as\n       to simultaneously satisfy your obligations under this License and such other conditions, you may not\n       distribute the Program at all. For example, if a patent license would not permit royalty-free\n       redistribution of the Program by all those who receive copies directly or indirectly through you, you\n       could not satisfy both the patent license and this License, and you would be required to refrain entirely\n       from distribution of the Program.\n      If you learn of a third party claim or other restriction relating to a Program you have already distributed\n       you shall promptly redo your Program to address the issue and take all reasonable steps to inform those\n       who may have received the Program at issue. An example of an appropriate reasonable step to inform would\n       be posting an announcement on an appropriate web bulletin board.\n      The provisions of this License are deemed to be severable, and the invalidity or unenforceability of any\n       provision shall not affect or impair the remaining provisions which shall continue in full force and\n       effect. In substitution for any provision held unlawful, there shall be substituted a provision of similar\n       import reflecting the original intent of the parties hereto to the extent permissible under law.\n      The Original Contributor from time to time may change this License, and the amended license will apply to all\n       copies of the Program downloaded after the new license is posted. This License grants only the rights\n       expressly stated herein and provides you with no implied rights or licenses to the intellectual property\n       of any Contributor.\n      This License is the complete and exclusive statement of the agreement between the parties concerning the\n       subject matter hereof and may not be amended except by the written agreement of the parties. This License\n       shall be governed by and construed in accordance with the laws of the State of Ohio and the United States\n       of America, without regard to principles of conflicts of law."}]