[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\n"}, {"type": "var", "name": "header1", "content": [], "pattern": "#*"}, {"type": "text", "content": "\nOpen Data Commons Open Database License (ODbL)\n"}]}, {"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\n"}, {"type": "var", "name": "header2", "content": [], "pattern": "#*"}, {"type": "text", "content": "\nPreamble\nThe Open Database License (ODbL) is a license agreement intended to allow users to freely share, modify,\nand use this Database while maintaining this same freedom for others. Many databases are covered by\ncopyright, and therefore this document licenses these rights. Some jurisdictions, mainly in the\nEuropean Union, have specific rights that cover databases, and so the ODbL addresses these rights,\ntoo. Finally, the ODbL is also an agreement in contract for users of this Database to act in certain\nways in return for accessing this Database.\nDatabases can contain a wide variety of types of content (images, audiovisual material, and sounds all in\nthe same database, for example), and so the ODbL only governs the rights over the Database, and not\nthe contents of the Database individually. Licensors should use the ODbL together with another license\nfor the contents, if the contents have a single set of rights that uniformly covers all of the\ncontents. If the contents have multiple sets of different rights, Licensors should describe what\nrights govern what contents together in the individual record or in some other way that clarifies what\nrights apply.\nSometimes the contents of a database, or the database itself, can be covered by other rights not\naddressed here (such as private contracts, trade mark over the name, or privacy rights / data\nprotection rights over information in the contents), and so you are advised that you may have to\nconsult other documents or clear other rights before doing activities not covered by this License.\n------\n"}]}, {"type": "text", "content": "\nThe Licensor (as defined below)\nand\nYou (as defined below)\nagree as follows:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDefinitions of Capitalised Words\n\"Collective Database\" - Means this Database in unmodified form as part of a\ncollection of independent databases in themselves that together are assembled into a\ncollective whole. A work that constitutes a Collective Database will not be considered a\nDerivative Database.\n\"Convey\" - As a verb, means Using the Database, a Derivative Database, or the\nDatabase as part of a Collective Database in any way that enables a Person to make or receive\ncopies of the Database or a Derivative Database. Conveying does not include interaction with a\nuser through a computer network, or creating and Using a Produced Work, where no transfer of a\ncopy of the Database or a Derivative Database occurs.\n\"Contents\" - The\ncontents of this Database, which includes the information, independent works, or other\nmaterial collected into the Database. For example, the contents of the Database could be\nfactual data or works such as images, audiovisual material, text, or sounds.\n\"Database\" - A collection of material (the Contents) arranged in a systematic or\nmethodical way and individually accessible by electronic or other means offered under the\nterms of this License.\n\"Database Directive\" - Means Directive 96/9/EC of the European Parliament and of\nthe Council of 11 March 1996 on the legal protection of databases, as amended or\nsucceeded.\n\"Database Right\" - Means rights resulting from the Chapter III (\"sui\ngeneris\") rights in the Database Directive (as amended and as transposed by member\nstates), which includes the Extraction and Re-utilisation of the whole or a Substantial part\nof the Contents, as well as any similar rights available in the relevant jurisdiction under\nSection 10.4.\n\"Derivative Database\" - Means a database based upon the Database, and includes\nany translation, adaptation, arrangement, modification, or any other alteration of the\nDatabase or of a Substantial part of the Contents. This includes, but is not limited to,\nExtracting or Re-utilising the whole or a Substantial part of the Contents in a new\nDatabase.\n\"Extraction\" - Means the permanent or temporary transfer of all or a Substantial\npart of the Contents to another medium by any means or in any form.\n\"License\" - Means this license agreement and is both a license of rights such as\ncopyright and Database Rights and an agreement in contract.\n\"Licensor\" - Means the Person that offers the Database under the terms of this\nLicense.\n\"Person\" - Means a natural or legal person or a body of persons corporate or\nincorporate.\n\"Produced Work\" - a work (such as an image, audiovisual material, text, or\nsounds) resulting from using the whole or a Substantial part of the Contents (via a search or\nother query) from this Database, a Derivative Database, or this Database as part of a\nCollective Database.\n\"Publicly\" - means to Persons other than You or under Your control by either\nmore than 50% ownership or by the power to direct their activities (such as contracting with\nan independent consultant).\n\"Re-utilisation\" - means any form of making available to the public all or a\nSubstantial part of the Contents by the distribution of copies, by renting, by online or other\nforms of transmission.\n\"Substantial\" - Means substantial in terms of quantity or quality or a\ncombination of both. The repeated and systematic Extraction or Re-utilisation of insubstantial\nparts of the Contents may amount to the Extraction or Re-utilisation of a Substantial part of\nthe Contents.\n\"Use\" - As a verb, means doing any act that is restricted by copyright or\nDatabase Rights whether in the original medium or any other; and includes without limitation\ndistributing, copying, publicly performing, publicly displaying, and preparing derivative\nworks of the Database, as well as modifying the Database as may be technically necessary to\nuse it in a different mode or format.\n\"You\" - Means a Person exercising rights under this License who has not\npreviously violated the terms of this License with respect to the Database, or who has\nreceived express permission from the Licensor to exercise rights under this License despite a\nprevious violation.\nWords in the singular include the plural and vice versa.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nWhat this License covers\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLegal effect of this document. This License is:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA license of applicable copyright and neighbouring rights;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA license of the Database Right; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAn agreement in contract between You and the Licensor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLegal rights covered. This License covers the legal rights in the Database, including:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCopyright. Any copyright or neighbouring rights in the Database. The copyright licensed\nincludes any individual elements of the Database, but does not cover the copyright over\nthe Contents independent of this Database. See Section 2.4 for details. Copyright law\nvaries between jurisdictions, but is likely to cover: the Database model or schema, which\nis the structure, arrangement, and organisation of the Database, and can also include the\nDatabase tables and table indexes; the data entry and output sheets; and the Field names\nof Contents stored in the Database;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDatabase Rights. Database Rights only extend to the Extraction and Re-utilisation of the\nwhole or a Substantial part of the Contents. Database Rights can apply even when there is\nno copyright over the Database. Database Rights can also apply when the Contents are\nremoved from the Database and are selected and arranged in a way that would not infringe\nany applicable copyright; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nContract. This is an agreement between You and the Licensor for access to the Database. In\nreturn you agree to certain conditions of use on this access as outlined in this\nLicense.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRights not covered.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not apply to computer programs used in the making or operation of the Database;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not cover any patents over the Contents or the Database; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not cover any trademarks associated with the Database.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRelationship to Contents in the Database. The individual items of the Contents contained in this\nDatabase may be covered by other rights, including copyright, patent, data protection,\nprivacy, or personality rights, and this License does not cover any rights (other than\nDatabase Rights or in contract) in individual Contents contained in the Database. For example,\nif used on a Database of images (the Contents), this License would not apply to copyright over\nindividual images, which could have their own separate licenses, or one single license\ncovering all of the rights over the images.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRights granted\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSubject to the terms and conditions of this License, the Licensor grants to You a worldwide,\nroyalty-free, non-exclusive, terminable (but only under Section 9) license to Use the Database\nfor the duration of any applicable copyright and Database Rights. These rights explicitly\ninclude commercial use, and do not exclude any field of endeavour. To the extent possible in\nthe relevant jurisdiction, these rights may be exercised in all media and formats whether now\nknown or created in the future.\nThe rights granted cover, for example:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nExtraction and Re-utilisation of the whole or a Substantial part of the Contents;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCreation of Derivative Databases;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCreation of Collective Databases;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCreation of temporary or permanent reproductions by any means and in any form, in whole or in\npart, including of any Derivative Databases or as a part of Collective Databases; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution, communication, display, lending, making available, or performance to the public\nby any means and in any form, in whole or in part, including of any Derivative Database or\nas a part of Collective Databases.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCompulsory license schemes. For the avoidance of doubt:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNon-waivable compulsory license schemes. In those jurisdictions in which the right to collect\nroyalties through any statutory or compulsory licensing scheme cannot be waived, the\nLicensor reserves the exclusive right to collect such royalties for any exercise by You of\nthe rights granted under this License;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nWaivable compulsory license schemes. In those jurisdictions in which the right to collect\nroyalties through any statutory or compulsory licensing scheme can be waived, the Licensor\nwaives the exclusive right to collect such royalties for any exercise by You of the rights\ngranted under this License; and,\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVoluntary license schemes. The Licensor waives the right to collect royalties, whether\nindividually or, in the event that the Licensor is a member of a collecting society that\nadministers voluntary licensing schemes, via that society, from any exercise by You of the\nrights granted under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe right to release the Database under different terms, or to stop distributing or making\navailable the Database, is reserved. Note that this Database may be multiple-licensed, and so\nYou may have the choice of using alternative licenses for this Database. Subject to Section\n10.4, all other rights not expressly granted by Licensor are reserved.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nConditions of Use\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe rights granted in Section 3 above are expressly made subject to Your complying with the\nfollowing conditions of use. These are important conditions of this License, and if You fail\nto follow them, You will be in material breach of its terms.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotices. If You Publicly Convey this Database, any Derivative Database, or the Database as part\nof a Collective Database, then You must:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDo so only under the terms of this License or another license permitted under Section 4.4;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nInclude a copy of this License (or, as applicable, a license permitted under Section 4.4) or\nits Uniform Resource Identifier (URI) with the Database or Derivative Database, including\nboth in the Database or Derivative Database and in any relevant documentation; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nKeep intact any copyright or Database Right notices and notices that refer to this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf it is not possible to put the required notices in a particular file due to its structure,\nthen You must include the notices in a location (such as a relevant directory) where users\nwould be likely to look for it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotice for using output (Contents). Creating and Using a Produced Work does not require the\nnotice in Section 4.2. However, if you Publicly Use a Produced Work, You must include a notice\nassociated with the Produced Work reasonably calculated to make any Person that uses, views,\naccesses, interacts with, or is otherwise exposed to the Produced Work aware that Content was\nobtained from the Database, Derivative Database, or the Database as part of a Collective\nDatabase, and that it is available under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nExample notice. The following text will satisfy notice under Section 4.3:\nContains information from DATABASE NAME, which is made available here under the Open Database\nLicense (ODbL).\nDATABASE NAME should be replaced with the name of the Database and a hyperlink to the URI of\nthe Database. \"Open Database License\" should contain a hyperlink to the URI of\nthe text of this License. If hyperlinks are not possible, You should include the plain\ntext of the required URI's with the above notice.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nShare alike.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny Derivative Database that You Publicly Use must be only under the terms of:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "i."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "ii."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA later version of this License similar in spirit to this License; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "iii."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA compatible license.\nIf You license the Derivative Database under one of the licenses mentioned in (iii), You\nmust comply with the terms of that license.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFor the avoidance of doubt, Extraction or Re-utilisation of the whole or a Substantial part\nof the Contents into a new database is a Derivative Database and must comply with Section\n4.4.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDerivative Databases and Produced Works. A Derivative Database is Publicly Used and so must\ncomply with Section 4.4. if a Produced Work created from the Derivative Database is\nPublicly Used.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "d."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nShare Alike and additional Contents. For the avoidance of doubt, You must not add Contents to\nDerivative Databases under Section 4.4 a that are incompatible with the rights granted\nunder this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "e."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCompatible licenses. Licensors may authorise a proxy to determine compatible licenses under\nSection 4.4 a iii. If they do so, the authorised proxy's public statement of\nacceptance of a compatible license grants You permission to use the compatible\nlicense.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.5"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLimits of Share Alike. The requirements of Section 4.4 do not apply in the following:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFor the avoidance of doubt, You are not required to license Collective Databases under this\nLicense if You incorporate this Database or a Derivative Database in the collection, but\nthis License still applies to this Database or a Derivative Database as a part of the\nCollective Database;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUsing this Database, a Derivative Database, or this Database as part of a Collective Database\nto create a Produced Work does not create a Derivative Database for purposes of Section\n4.4; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUse of a Derivative Database internally within an organisation is not to the public and\ntherefore does not fall under the requirements of Section 4.4.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.6"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAccess to Derivative Databases. If You Publicly Use a Derivative Database or a Produced Work from\na Derivative Database, You must also offer to recipients of the Derivative Database or\nProduced Work a copy in a machine readable form of:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe entire Derivative Database; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA file containing all of the alterations made to the Database or the method of making the\nalterations to the Database (such as an algorithm), including any additional Contents,\nthat make up all the differences between the Database and the Derivative Database.\nThe Derivative Database (under a.) or alteration file (under b.) must be available at no more\nthan a reasonable production cost for physical distributions and free of charge if\ndistributed over the internet.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.7"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTechnological measures and additional terms\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not allow You to impose (except subject to Section 4.7 b.) any terms or any\ntechnological measures on the Database, a Derivative Database, or the whole or a\nSubstantial part of the Contents that alter or restrict the terms of this License, or any\nrights granted under it, or have the effect or intent of restricting the ability of any\nperson to exercise those rights.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nParallel distribution. You may impose terms or technological measures on the Database, a\nDerivative Database, or the whole or a Substantial part of the Contents (a\n\"Restricted Database\") in contravention of Section 4.74 a. only if You also make\na copy of the Database or a Derivative Database available to the recipient of the\nRestricted Database:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "i."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThat is available without additional fee;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "ii."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThat is available in a medium that does not alter or restrict the terms of this License,\nor any rights granted under it, or have the effect or intent of restricting the\nability of any person to exercise those rights (an \"Unrestricted Database\");\nand\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "iii."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Unrestricted Database is at least as accessible to the recipient as a practical\nmatter as the Restricted Database.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFor the avoidance of doubt, You may place this Database or a Derivative Database in an\nauthenticated environment, behind a password, or within a similar access control scheme\nprovided that You do not alter or restrict the terms of this License or any rights granted\nunder it or have the effect or intent of restricting the ability of any person to exercise\nthose rights.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4.8"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLicensing of others. You may not sublicense the Database. Each time You communicate the Database,\nthe whole or Substantial part of the Contents, or any Derivative Database to anyone else in\nany way, the Licensor offers to the recipient a license to the Database on the same terms and\nconditions as this License. You are not responsible for enforcing compliance by third parties\nwith this License, but You may enforce any rights that You have over a Derivative Database.\nYou are solely responsible for any modifications of a Derivative Database made by You or\nanother Person at Your direction. You may not impose any further restrictions on the exercise\nof the rights granted or affirmed under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMoral rights\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMoral rights. This section covers moral rights, including any rights to be identified as the\nauthor of the Database or to object to treatment that would otherwise prejudice the\nauthor's honour and reputation, or any other derogatory treatment:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFor jurisdictions allowing waiver of moral rights, Licensor waives all moral rights that\nLicensor may have in the Database to the fullest extent possible by the law of the\nrelevant jurisdiction under Section 10.4;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf waiver of moral rights under Section 5.1 a in the relevant jurisdiction is not possible,\nLicensor agrees not to assert any moral rights over the Database and waives all claims in\nmoral rights to the fullest extent possible by the law of the relevant jurisdiction under\nSection 10.4; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFor jurisdictions not allowing waiver or an agreement not to assert moral rights under\nSection 5.1 a and b, the author may retain their moral rights over certain aspects of the\nDatabase.\nPlease note that some jurisdictions do not allow for the waiver of moral rights, and so moral\nrights may still subsist over the Database in some jurisdictions.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFair dealing, Database exceptions, and other rights not affected\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not affect any rights that You or anyone else may independently have under any\napplicable law to make any use of this Database, including without limitation:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nExceptions to the Database Right including: Extraction of Contents from non-electronic\nDatabases for private purposes, Extraction for purposes of illustration for teaching or\nscientific research, and Extraction or Re-utilisation for public security or an\nadministrative or judicial procedure.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFair dealing, fair use, or any other legally recognised limitation or exception to\ninfringement of copyright or other applicable laws.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License does not affect any rights of lawful users to Extract and Re-utilise insubstantial\nparts of the Contents, evaluated quantitatively or qualitatively, for any purposes whatsoever,\nincluding creating a Derivative Database (subject to other rights over the Contents, see\nSection 2.4). The repeated and systematic Extraction or Re-utilisation of insubstantial parts\nof the Contents may however amount to the Extraction or Re-utilisation of a Substantial part\nof the Contents.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nWarranties and Disclaimer\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Database is licensed by the Licensor \"as is\" and without any warranty of any kind,\neither express, implied, or arising by statute, custom, course of dealing, or trade usage.\nLicensor specifically disclaims any and all implied warranties or conditions of title,\nnon-infringement, accuracy or completeness, the presence or absence of errors, fitness for a\nparticular purpose, merchantability, or otherwise. Some jurisdictions do not allow the\nexclusion of implied warranties, so this exclusion may not apply to You.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLimitation of liability\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSubject to any liability that may not be excluded or limited by law, the Licensor is not liable\nfor, and expressly excludes, all liability for loss or damage however and whenever caused to\nanyone by any use under this License, whether by You or by anyone else, and whether caused by\nany fault on the part of the Licensor or not. This exclusion of liability includes, but is not\nlimited to, any special, incidental, consequential, punitive, or exemplary damages such as\nloss of revenue, data, anticipated profits, and lost business. This exclusion applies even if\nthe Licensor has been advised of the possibility of such damages.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf liability may not be excluded by law, it is limited to actual and direct financial loss to the\nextent it is caused by proved negligence on the part of the Licensor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTermination of Your rights under this License\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny breach by You of the terms and conditions of this License automatically terminates this\nLicense with immediate effect and without notice to You. For the avoidance of doubt, Persons\nwho have received the Database, the whole or a Substantial part of the Contents, Derivative\nDatabases, or the Database as part of a Collective Database from You under this License will\nnot have their licenses terminated provided their use is in full compliance with this License\nor a license granted under Section 4.8 of this License. Sections 1, 2, 7, 8, 9 and 10 will\nsurvive any termination of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You are not in breach of the terms of this License, the Licensor will not terminate Your\nrights under it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUnless terminated under Section 9.1, this License is granted to You for the duration of\napplicable rights in the Database.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nReinstatement of rights. If you cease any breach of the terms and conditions of this License,\nthen your full rights under this License will be reinstated:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "a."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nProvisionally and subject to permanent termination until the 60th day after cessation of breach;\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "b."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nPermanently on the 60th day after cessation of breach unless otherwise reasonably notified by\nthe Licensor; or\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "c."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nPermanently if reasonably notified by the Licensor of the violation, this is the first time\nYou have received notice of violation of this License from the Licensor, and You cure the\nviolation prior to 30 days after your receipt of the notice.\nPersons subject to permanent termination of rights are not eligible to be a recipient and\nreceive a license under Section 4.8.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9.5"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNotwithstanding the above, Licensor reserves the right to release the Database under different\nlicense terms or to stop distributing or making available the Database. Releasing the Database\nunder different license terms or stopping the distribution of the Database will not withdraw\nthis License (or any other license that has been, or is required to be, granted under the\nterms of this License), and this License will continue in full force and effect unless\nterminated as stated above.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10.0"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nGeneral\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf any provision of this License is held to be invalid or unenforceable, that must not affect the\nvalidity or enforceability of the remainder of the terms and conditions of this License and\neach remaining provision of this License shall be valid and enforced to the fullest extent\npermitted by law.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10.2"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis License is the entire agreement between the parties with respect to the rights granted here\nover the Database. It replaces any earlier understandings, agreements or representations with\nrespect to the Database.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10.3"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You are in breach of the terms of this License, You will not be entitled to rely on the terms\nof this License or to complain of any breach by the Licensor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10.4"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nChoice of law. This License takes effect in and will be governed by the laws of the relevant\njurisdiction in which the License terms are sought to be enforced. If the standard suite of\nrights granted under applicable copyright law and Database Rights in the relevant jurisdiction\nincludes additional rights not granted under this License, these additional rights are granted\nin this License in order to meet the terms of this License.\n"}]