[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) <dates>, <Copyright Holder> (<URL|email>)."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "This Font Software is licensed under the SIL Open Font License, Version 1.1.\n         This license is copied below, and is also available with a FAQ at: http://scripts.sil.org/OFL"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "SIL OPEN FONT LICENSE\n         Version 1.1 - 26 February 2007"}}, {"type": "text", "content": "\n\n      PREAMBLE\n      The goals of the Open Font License (OFL) are to stimulate worldwide development of collaborative font\n         projects, to support the font creation efforts of academic and linguistic communities, and to provide\n         a free and open framework in which fonts may be shared and improved in partnership with others.\n      The OFL allows the licensed fonts to be used, studied, modified and redistributed freely as long as they\n         are not sold by themselves. The fonts, including any derivative works, can be bundled, embedded,\n         redistributed and/or sold with any software provided that any reserved names are not used by\n         derivative works. The fonts and derivatives, however, cannot be released under any other type of\n         license. The requirement for fonts to remain under this license does not apply to any document created\n         using the fonts or their derivatives.\n      DEFINITIONS\n      \"Font Software\" refers to the set of files released by the Copyright Holder(s) under this license and\n         clearly marked as such. This may include source files, build scripts and documentation.\n      \"Reserved Font Name\" refers to any names specified as such after the copyright statement(s).\n      \"Original Version\" refers to the collection of Font Software components as distributed by the Copyright\n         Holder(s).\n      \"Modified Version\" refers to any derivative made by adding to, deleting, or substituting — in part or in\n         whole — any of the components of the Original Version, by changing formats or by porting the Font\n         Software to a new environment.\n      \"Author\" refers to any designer, engineer, programmer, technical writer or other person who contributed\n         to the Font Software.\n      PERMISSION & CONDITIONS\n      Permission is hereby granted, free of charge, to any person obtaining a copy of the Font Software, to\n         use, study, copy, merge, embed, modify, redistribute, and sell modified and unmodified copies of the\n         Font Software, subject to the following conditions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Neither the Font Software nor any of its individual components, in Original or Modified Versions,\n             may be sold by itself.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Original or Modified Versions of the Font Software may be bundled, redistributed and/or sold with\n             any software, provided that each copy contains the above copyright notice and this license.\n             These can be included either as stand-alone text files, human-readable headers or in the\n             appropriate machine-readable metadata fields within text or binary files as long as those\n             fields can be easily viewed by the user.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Modified Version of the Font Software may use the Reserved Font Name(s) unless explicit\n             written permission is granted by the corresponding Copyright Holder. This restriction only\n             applies to the primary font name as presented to the users.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The name(s) of the Copyright Holder(s) or the Author(s) of the Font Software shall not be used to\n             promote, endorse or advertise any Modified Version, except to acknowledge the contribution(s)\n             of the Copyright Holder(s) and the Author(s) or with their explicit written permission.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The Font Software, modified or unmodified, in part or in whole, must be distributed entirely\n             under this license, and must not be distributed under any other license. The requirement for\n             fonts to remain under this license does not apply to any document created using the Font\n             Software.\n      TERMINATION\n      This license becomes null and void if any of the above conditions are not met.\n      DISCLAIMER\n      THE FONT SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT\n         NOT LIMITED TO ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\n         OF COPYRIGHT, PATENT, TRADEMARK, OR OTHER RIGHT. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR\n         ANY CLAIM, DAMAGES OR OTHER LIABILITY, INCLUDING ANY GENERAL, SPECIAL, INDIRECT, INCIDENTAL, OR\n         CONSEQUENTIAL DAMAGES, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF THE\n         USE OR INABILITY TO USE THE FONT SOFTWARE OR FROM OTHER DEALINGS IN THE FONT SOFTWARE."}]