[{"type": "optional", "content": {"type": "text", "content": "The Open Group Test Suite License"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "Preamble\n         The intent of this document is to state the conditions under which a Package may be copied, such that the\n         Copyright Holder maintains some semblance of artistic control over the development of the package,\n         while giving the users of the package the right to use and distribute the Package in a more-or-less\n         customary fashion, plus the right to make reasonable modifications.\n         Testing is essential for proper development and maintenance of standards-based products.\n         For buyers: adequate conformance testing leads to reduced integration costs and protection of investments\n         in applications, software and people.\n         For software developers: conformance testing of platforms and middleware greatly reduces the cost of\n         developing and maintaining multi-platform application software.\n         For suppliers: In-depth testing increases customer satisfaction and keeps development and support costs\n         in check. API conformance is highly measurable and suppliers who claim it must be able to substantiate\n         that claim.\n         As such, since these are benchmark measures of conformance, we feel the integrity of test tools is of\n         importance. In order to preserve the integrity of the existing conformance modes of this test package\n         and to permit recipients of modified versions of this package to run the original test modes, this\n         license requires that the original test modes be preserved.\n         If you find a bug in one of the standards mode test cases, please let us know so we can feed this back\n         into the original, and also raise any specification issues with the appropriate bodies (for example\n         the POSIX committees)."}}, {"type": "text", "content": "\n\n      Definitions:\n      \"Package\" refers to the collection of files distributed by the Copyright Holder, and derivatives of that\n         collection of files created through textual modification.\n      \"Standard Version\" refers to such a Package if it has not been modified, or has been modified in\n         accordance with the wishes of the Copyright Holder.\n      \"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n      \"You\" is you, if you're thinking about copying or distributing this Package.\n      \"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication charges,\n         time of people involved, and so on. (You will not be required to justify it to the Copyright Holder,\n         but only to the computing community at large as a market that must bear the fee.)\n      \"Freely Available\" means that no fee is charged for the item itself, though there may be fees involved in\n         handling the item. It also means that recipients of the item may redistribute it under the same\n         conditions they received it.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may make and give away verbatim copies of the source form of the Standard Version of this\n             Package without restriction, provided that you duplicate all of the original copyright notices\n             and associated disclaimers.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may apply bug fixes, portability fixes and other modifications derived from the Public Domain\n             or from the Copyright Holder. A Package modified in such a way shall still be considered the\n             Standard Version.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may otherwise modify your copy of this Package in any way, provided that you insert a\n             prominent notice in each changed file stating how and when you changed that file, and provided\n             that you do at least the following:\n          rename any non-standard executables and testcases so the names do not conflict with standard\n             executables and testcases, which must also be provided, and provide a separate manual page for\n             each non-standard executable and testcase that clearly documents how it differs from the\n             Standard Version.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may distribute the programs of this Package in object code or executable form, provided that\n             you do at least the following:\n          accompany any non-standard executables and testcases with their corresponding Standard Version\n             executables and testcases, giving the non-standard executables and testcases non-standard\n             names, and clearly documenting the differences in manual pages (or equivalent), together with\n             instructions on where to get the Standard Version.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may charge a reasonable copying fee for any distribution of this Package. You may charge any\n             fee you choose for support of this Package. You may not charge a fee for this Package itself.\n             However, you may distribute this Package in aggregate with other (possibly commercial)\n             programs as part of a larger (possibly commercial) software distribution provided that you do\n             not advertise this Package as a product of your own.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The scripts and library files supplied as input to or produced as output from the programs of\n             this Package do not automatically fall under the copyright of this Package, but belong to\n             whomever generated them, and may be sold commercially, and may be aggregated with this\n             Package.\n          7.Subroutines supplied by you and linked into this Package shall not be considered part of this\n             Package.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The name of the Copyright Holder may not be used to endorse or promote products derived from this\n             software without specific prior written permission.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          THIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\n             WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR\n             PURPOSE.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "The End"}}]