[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nThe OpenLDAP Public License\nVersion 2.5, 11 May 2001\n"}]}, {"type": "text", "content": "\nRedistribution and use of this software and associated documentation (\"Software\"), with or without\nmodification, are permitted provided that the following conditions are met:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRedistributions of source code must retain copyright statements and notices.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRedistributions in binary form must reproduce applicable copyright statements and notices, this\nlist of conditions, and the following disclaimer in the documentation and/or other materials\nprovided with the distribution.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRedistributions must contain a verbatim copy of this document.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe names and trademarks of the authors and copyright holders must not be used in advertising or\notherwise to promote the sale, use or other dealing in this Software without specific, written\nprior permission.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDue credit should be given to the authors of the Software.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe OpenLDAP Foundation may revise this license from time to time. Each revision is distinguished\nby a version number. You may use the Software under terms of this license revision or under\nthe terms of any subsequent revision of the license.\nTHIS SOFTWARE IS PROVIDED BY THE OPENLDAP FOUNDATION AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESSED OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OPENLDAP FOUNDATION, ITS\nCONTRIBUTORS, OR THE AUTHOR(S) OR OWNER(S) OF THE SOFTWARE BE LIABLE FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT\nOF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\nOpenLDAP is a trademark of the OpenLDAP Foundation.\n"}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "Copyright 1999-2001 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved."}], "pattern": ".{0,5000}"}, {"type": "text", "content": "\nPermission to copy and distributed verbatim copies of this document is granted.\n"}]