[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nThe OpenLDAP Public License\nVersion 1.2, 1 September 1998\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "copyright", "content": [{"tag": "text", "content": "\nCopyright 1998, The OpenLDAP Foundation. All Rights Reserved.\n"}], "pattern": ".{0,5000}"}, {"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nNote: This license is derived from the \"Artistic License\" as distributed with the Perl\nProgramming Language. As differences may exist, the complete license should be read.\nPREAMBLE\nThe intent of this document is to state the conditions under which a Package may be copied, such that the\nCopyright Holder maintains some semblance of artistic control over the development of the package,\nwhile giving the users of the package the right to use and distribute the Package in a more-or-less\ncustomary fashion, plus the right to make reasonable modifications.\n"}]}, {"tag": "text", "content": "\nDefinitions:\n\"Package\" refers to the collection of files distributed by the Copyright Holder, and\nderivatives of that collection of files created through textual modification.\n\"Standard Version\" refers to such a Package if it has not been modified, or has been modified\nin accordance with the wishes of the Copyright Holder.\n\"Copyright Holder\" is whoever is named in the copyright or copyrights for the package.\n\"You\" is you, if you're thinking about copying or distributing this Package.\n\"Reasonable copying fee\" is whatever you can justify on the basis of media cost, duplication\ncharges, time of people involved, and so on. (You will not be required to justify it to the Copyright\nHolder, but only to the computing community at large as a market that must bear the fee.)\n\"Freely Available\" means that no fee is charged for the item itself, though there may be fees\ninvolved in handling the item. It also means that recipients of the item may redistribute it under the\nsame conditions they received it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may make and give away verbatim copies of the source form of the Standard Version of this\nPackage without restriction, provided that you duplicate all of the original copyright notices\nand associated disclaimers.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may apply bug fixes, portability fixes and other modifications derived from the Public Domain\nor from the Copyright Holder. A Package modified in such a way shall still be considered the\nStandard Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may otherwise modify your copy of this Package in any way, provided that you insert a\nprominent notice in each changed file stating how and when you changed that file, and provided\nthat you do at least ONE of the following:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nplace your modifications in the Public Domain or otherwise make them Freely Available, such\nas by posting said modifications to Usenet or an equivalent medium, or placing the\nmodifications on a major archive site such as uunet.uu.net, or by allowing the Copyright\nHolder to include your modifications in the Standard Version of the Package.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nuse the modified Package only within your corporation or organization.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nrename any non-standard executables so the names do not conflict with standard executables,\nwhich must also be provided, and provide a separate manual page for each non-standard\nexecutable that clearly documents how it differs from the Standard Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nmake other distribution arrangements with the Copyright Holder.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may distribute the programs of this Package in object code or executable form, provided that\nyou do at least ONE of the following:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\ndistribute a Standard Version of the executables and library files, together with\ninstructions (in the manual page or equivalent) on where to get the Standard Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\naccompany the distribution with the machine-readable source of the Package with your modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\naccompany any non-standard executables with their corresponding Standard Version executables,\ngiving the non-standard executables non-standard names, and clearly documenting the\ndifferences in manual pages (or equivalent), together with instructions on where to get\nthe Standard Version.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nmake other distribution arrangements with the Copyright Holder.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may charge a reasonable copying fee for any distribution of this Package. You may charge any\nfee you choose for support of this Package. You may not charge a fee for this Package itself.\nHowever, you may distribute this Package in aggregate with other (possibly commercial)\nprograms as part of a larger (possibly commercial) software distribution provided that you do\nnot advertise this Package as a product of your own.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe scripts and library files supplied as input to or produced as output from the programs of\nthis Package do not automatically fall under the copyright of this Package, but belong to\nwhomever generated them, and may be sold commercially, and may be aggregated with this\nPackage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nC subroutines supplied by you and linked into this Package in order to emulate subroutines and\nvariables of the language defined by this Package shall not be considered part of this\nPackage, but are the equivalent of input as in Paragraph 6, provided these subroutines do not\nchange the language in any way that would cause it to fail the regression tests for the\nlanguage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe name of the Copyright Holder may not be used to endorse or promote products derived from this\nsoftware without specific prior written permission.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTHIS PACKAGE IS PROVIDED \"AS IS\" AND WITHOUT ANY EXPRESS OR IMPLIED WARRANTIES,\nINCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A\nPARTICULAR PURPOSE.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nThe End\n"}]}, {"tag": "text", "content": "\n"}]