[{"type": "optional", "content": {"type": "text", "content": "The OpenLDAP Public License\n        Version 2.3, 28 July 2000"}}, {"type": "text", "content": "\n\n      Redistribution and use of this software and associated documentation (\"Software\"), with or without\n         modification, are permitted provided that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain copyright statements and notices.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce applicable copyright statements and notices, this\n             list of conditions, and the following disclaimer in the documentation and/or other materials\n             provided with the distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions must contain a verbatim copy of this document.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The name \"OpenLDAP\" must not be used to endorse or promote products derived from this Software\n             without prior written permission of the OpenLDAP Foundation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Products derived from this Software may not be called \"OpenLDAP\" nor may \"OpenLDAP\" appear in\n             their names without prior written permission of the OpenLDAP Foundation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Due credit should be given to the OpenLDAP Project (http://www.openldap.org/).\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The OpenLDAP Foundation may revise this license from time to time. Each revision is distinguished\n             by a version number. You may use the Software under terms of this license revision or under\n             the terms of any subsequent revision of the license.\n      THIS SOFTWARE IS PROVIDED BY THE OPENLDAP FOUNDATION AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESSED OR\n         IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND\n         FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OPENLDAP FOUNDATION OR ITS\n         CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n         DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n         DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n         CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE\n         USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n      OpenLDAP is a trademark of the OpenLDAP Foundation.\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright 1999-2000 The OpenLDAP Foundation, Redwood City, California, USA. All Rights Reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n        Permission to copy and distributed verbatim copies of this document is granted."}]