[{"type": "optional", "content": {"type": "text", "content": "OpenSSL License"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 1998-2008 The OpenSSL Project. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the above copyright notice, this list of conditions\n             and the following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n             and the following disclaimer in the documentation and/or other materials provided with the\n             distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All advertising materials mentioning features or use of this software must display the following\n             acknowledgment: \"This product includes software developed by the OpenSSL Project for use in\n             the OpenSSL Toolkit. (http://www.openssl.org/)\"\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to endorse or promote products\n             derived from this software without prior written permission. For written permission, please\n             contact openssl-core@openssl.org.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Products derived from this software may not be called \"OpenSSL\" nor may \"OpenSSL\" appear in their\n             names without prior written permission of the OpenSSL Project.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of any form whatsoever must retain the following acknowledgment: \"This product\n             includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit\n             (http://www.openssl.org/)\"\n      THIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES,\n         INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n         PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE OpenSSL PROJECT OR ITS CONTRIBUTORS BE LIABLE FOR ANY\n         DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n         TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n         INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n         TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\n         ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n      This product includes cryptographic software written by Eric Young (eay@cryptsoft.com). This product\n         includes software written by Tim Hudson (tjh@cryptsoft.com).\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "Original SSLeay License"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)\n           All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      This package is an SSL implementation written by Eric Young (eay@cryptsoft.com). The implementation was\n         written so as to conform with Netscapes SSL.\n      This library is free for commercial and non-commercial use as long as the following conditions are\n         aheared to. The following conditions apply to all code found in this distribution, be it the RC4, RSA,\n         lhash, DES, etc., code; not just the SSL code. The SSL documentation included with this distribution\n         is covered by the same copyright terms except that the holder is Tim Hudson (tjh@cryptsoft.com).\n      Copyright remains Eric Young's, and as such any Copyright notices in the code are not to be removed. If\n         this package is used in a product, Eric Young should be given attribution as the author of the parts\n         of the library used. This can be in the form of a textual message at program startup or in\n         documentation (online or textual) provided with the package.\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the copyright notice, this list of conditions and the\n             following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n             and the following disclaimer in the documentation and/or other materials provided with the\n             distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All advertising materials mentioning features or use of this software must display the following\n             acknowledgement:\n            \"This product includes cryptographic software written by Eric Young (eay@cryptsoft.com)\"\n            The word 'cryptographic' can be left out if the rouines from the library being used are not\n                 cryptographic related :-).\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If you include any Windows specific code (or a derivative thereof) from the apps directory\n             (application code) you must include an acknowledgement: \"This product includes software\n             written by Tim Hudson (tjh@cryptsoft.com)\"\n      THIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT\n         NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n         DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n         INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT\n         OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\n         CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n         NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n         POSSIBILITY OF SUCH DAMAGE.\n      The licence and distribution terms for any publically available version or derivative of this code cannot\n         be changed. i.e. this code cannot simply be copied and put under another distribution licence\n         [including the GNU Public Licence.]"}]