[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nOPEN PUBLIC LICENSE\nVersion 1.0\n"}]}, {"type": "text", "content": "\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDefinitions.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Contributor\" means each entity that creates or contributes to the creation of\nModifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Contributor Version\" means the combination of the Original Code, prior\nModifications used by a Contributor, and the Modifications made by that particular\nContributor.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Covered Code\" means the Original Code or Modifications or the combination of the\nOriginal Code and Modifications, in each case including portions thereof.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Electronic Distribution Mechanism\" means a mechanism generally accepted in the\nsoftware development community for the electronic transfer of data.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Executable\" means Covered Code in any form other than Source Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Initial Developer\" means the individual or entity identified as the Initial\nDeveloper in the Source Code notice required by Exhibit A.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Larger Work\" means a work, which combines Covered Code or portions thereof with\ncode not governed by the terms of this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"License\" means this document and the corresponding addendum described in section\n6.4 below.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Modifications\" means any addition to or deletion from the substance or structure\nof either the Original Code or any previous Modifications. When Covered Code is released\nas a series of files, a Modification is:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "A."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny addition to or deletion from the contents of a file containing Original Code or\nprevious Modifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "B."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Original Code\" means Source Code of computer software code which is described in\nthe Source Code notice required by Exhibit A as Original Code, and which, at the time of\nits release under this License is not already Covered Code governed by this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"Source Code\" means the preferred form of the Covered Code for making modifications\nto it, including all modules it contains, plus any associated interface definition files,\nscripts used to control compilation and installation of an Executable, or a list of source\ncode differential comparisons against either the Original Code or another well known,\navailable Covered Code of the Contributor's choice. The Source Code can be in a\ncompressed or archival form, provided the appropriate decompression or de-archiving\nsoftware is widely available for no charge.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"You\" means an individual or a legal entity exercising rights under, and complying\nwith all of the terms of, this License or a future version of this License issued under\nSection 6.1. For legal entities, \"You'' includes any entity which controls,\nis controlled by, or is under common control with You. For purposes of this definition,\n\"control'' means (a) the power, direct or indirect, to cause the direction\nor management of such entity, whether by contract or otherwise, or (b) ownership of fifty\npercent (50%) or more of the outstanding shares or beneficial ownership of such\nentity.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1.13"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\n\"License Author\" means Lutris Technologies, Inc.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSource Code License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Initial Developer Grant. The Initial Developer hereby grants You a worldwide,\nroyalty-free, non-exclusive license, subject to third party intellectual property\nclaims:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) to use, reproduce,\nmodify, display, perform, sublicense and distribute the Original Code (or portions\nthereof) with or without Modifications, or as part of a Larger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder patents now or hereafter owned or controlled by Initial Developer, to make, have\nmade, use and sell (``offer to sell and import'') the Original Code (or\nportions thereof), but solely to the extent that any such patent is reasonably\nnecessary to enable You to Utilize the Original Code (or portions thereof) and not to\nany greater extent that may be necessary to Utilize further Modifications or\ncombinations.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nContributor Grant. Each Contributor hereby grants You a worldwide, royalty-free,\nnon-exclusive license, subject to third party intellectual property claims:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder intellectual property rights (other than patent or trademark) to use, reproduce,\nmodify, display, perform, sublicense and distribute the Modifications created by such\nContributor (or portions thereof) either on an unmodified basis, with other\nModifications, as Covered Code or as part of a Larger Work; and\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nunder patents now or hereafter owned or controlled by Contributor, to to make, have made,\nuse and sell (``offer to sell and import'') the Contributor Version (or\nportions thereof), but solely to the extent that any such patent is reasonably\nnecessary to enable You to Utilize the Contributor Version (or portions thereof), and\nnot to any greater extent that may be necessary to Utilize further Modifications or\ncombinations\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution Obligations.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nApplication of License. The Modifications which You create or to which You contribute are\ngoverned by the terms of this License, including without limitation Section 2.2. The\nSource Code version of Covered Code may be distributed only under the terms of this\nLicense or a future version of this License released under Section 6.1, and You must\ninclude a copy of this License with every copy of the Source Code You distribute. You may\nnot offer or impose any terms on any Source Code version that alters or restricts the\napplicable version of this License or the recipients' rights hereunder. However, You\nmay include an additional document offering the additional rights described in Section\n3.5.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAvailability of Source Code. Any Modification which You create or to which You contribute\nmust be made available, prior to any use, except for internal development and practice, in\nSource Code form under the terms of this License either on the same media as an Executable\nversion or via an accepted Electronic Distribution Mechanism to anyone to whom you made an\nExecutable version available; and if made available via Electronic Distribution Mechanism,\nmust remain available for at least twelve (12) months after the date it initially became\navailable, or at least six (6) months after a subsequent version of that particular\nModification has been made available to such recipients. You shall notify the Initial\nDeveloper of the Modification and the location of the Source Code via the contact means\nprovided for in the Developer Specific license. Initial Developer will be acting as\nmaintainer of the Source Code and may provide an Electronic Distribution mechanism for the\nModification to be made available.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDescription of Modifications. You must cause all Covered Code to which you contribute to\ncontain a file documenting the changes You made to create that Covered Code and the date\nof any change. You must include a prominent statement that the Modification is derived,\ndirectly or indirectly, from Original Code provided by the Initial Developer and including\nthe name of the Initial Developer in (a) the Source Code, and (b) in any notice in an\nExecutable version or related documentation in which You describe the origin or ownership\nof the Covered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIntellectual Property Matters\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThird Party Claims. If You have knowledge that a party claims an intellectual property\nright in particular functionality or code (or its utilization under this License), you\nmust include a text file with the source code distribution titled \"LEGAL\"\nwhich describes the claim and the party making the claim in sufficient detail that a\nrecipient will know whom to contact. If you obtain such knowledge after You make Your\nModification available as described in Section 3.2, You shall promptly modify the\nLEGAL file in all copies You make available thereafter and shall take other steps\n(such as notifying appropriate mailing lists or newsgroups) reasonably calculated to\ninform those who received the Covered Code that new knowledge has been obtained.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRepresentations. Contributor represents that, except as disclosed pursuant to Section\n3.4(a) above, Contributor believes that Contributor's Modifications are\nContributor's original creation(s) and/or Contributor has sufficient rights to\ngrant the rights conveyed by this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequired Notices. You must duplicate the notice in Exhibit A in each file of the Source Code,\nand this License in any documentation for the Source Code, where You describe\nrecipients' rights relating to Covered Code. If You created one or more\nModification(s), You may add your name as a Contributor to the notice described in Exhibit\nA. If it is not possible to put such notice in a particular Source Code file due to its\nstructure, then you must include such notice in a location (such as a relevant directory\nfile) where a user would be likely to look for such a notice. You may choose to offer, and\nto charge a fee for, warranty, support, indemnity or liability obligations to one or more\nrecipients of Covered Code. However, You may do so only on Your own behalf, and not on\nbehalf of the Initial Developer or any Contributor. You must make it absolutely clear that\nany such warranty, support, indemnity or liability obligation is offered by You alone, and\nYou hereby agree to indemnify the Initial Developer and every Contributor for any\nliability incurred by the Initial Developer or such Contributor as a result of warranty,\nsupport, indemnity or liability terms You offer.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDistribution of Executable Versions. You may distribute Covered Code in Executable form only\nif the requirements of Section 3.1-3.5 have been met for that Covered Code, and if You\ninclude a notice stating that the Source Code version of the Covered Code is available\nunder the terms of this License, including a description of how and where You have\nfulfilled the obligations of Section 3.2. The notice must be conspicuously included in any\nnotice in an Executable version, related documentation or collateral in which You describe\nrecipients' rights relating to the Covered Code. You may distribute the Executable\nversion of Covered Code under a license of Your choice, which may contain terms different\nfrom this License, provided that You are in compliance with the terms of this License and\nthat the license for the Executable version does not attempt to limit or alter the\nrecipient's rights in the Source Code version from the rights set forth in this\nLicense. If You distribute the Executable version under a different license You must make\nit absolutely clear that any terms which differ from this License are offered by You\nalone, not by the Initial Developer or any Contributor. You hereby agree to indemnify the\nInitial Developer and every Contributor for any liability incurred by the Initial\nDeveloper or such Contributor as a result of any such terms You offer. If you distribute\nexecutable versions containing Covered Code, you must reproduce the notice in Exhibit B in\nthe documentation and/or other materials provided with the product.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLarger Works. You may create a Larger Work by combining Covered Code with other code not\ngoverned by the terms of this License and distribute the Larger Work as a single product.\nIn such a case, You must make sure the requirements of this License are fulfilled for the\nCovered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of the terms of this License with respect to some\nor all of the Covered Code due to statute or regulation then You must: (a) comply with the\nterms of this License to the maximum extent possible; and (b) Cite all of the statutes or\nregulations that prohibit you from complying fully with this license. (c) describe the\nlimitations and the code they affect. Such description must be included in the LEGAL file\ndescribed in Section 3.4 and must be included with all distributions of the Source Code.\nExcept to the extent prohibited by statute or regulation, such description must be\nsufficiently detailed for a recipient of ordinary skill to be able to understand it.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nApplication of this License.\nThis License applies to code to which the Initial Developer has attached the notice in Exhibit A,\nand to related Covered Code.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nVersions of the License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNew Versions. License Author may publish revised and/or new versions of the License from time\nto time. Each version will be given a distinguishing version number and shall be submitted\nto opensource.org for certification.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEffect of New Versions. Once Covered Code has been published under a particular version of\nthe License, You may always continue to use it under the terms of that version. You may\nalso choose to use such Covered Code under the terms of any subsequent version of the\nLicense published by Initial Developer. No one other than Initial Developer has the right\nto modify the terms applicable to Covered Code created under this License.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDerivative Works. If you create or use a modified version of this License, except in\nassociation with the required Developer Specific License described in section 6.4, (which\nyou may only do in order to apply it to code which is not already Covered Code governed by\nthis License), you must (a) rename Your license so that the phrases ``Open'',\n``OpenPL'', ``OPL'' or any confusingly similar phrase do not appear\nanywhere in your license and (b) otherwise make it clear that your version of the license\ncontains terms which differ from the Open Public License. (Filling in the name of the\nInitial Developer, Original Code or Contributor in the notice described in Exhibit A shall\nnot of themselves be deemed to be modifications of this License.)\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRequired Additional Developer Specific License\nThis license is a union of the following two parts that should be found as text files\nin the same place (directory), in the order of preeminence:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "[1]"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nA Developer specific license.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "[2]"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe contents of this file OPL_1_0.TXT, stating the general licensing policy of the software.\nIn case of conflicting dispositions in the parts of this license, the terms of the\nlower-numbered part will always be superseded by the terms of the higher numbered\npart.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDISCLAIMER OF WARRANTY.\nCOVERED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF\nANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\nCOVERED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR NON-INFRINGING.\nTHE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE COVERED CODE IS WITH YOU. SHOULD ANY\nCOVERED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT THE INITIAL DEVELOPER OR ANY OTHER\nCONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR CORRECTION. THIS DISCLAIMER\nOF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE. NO USE OF ANY COVERED CODE IS\nAUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTERMINATION.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.1"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTermination upon Breach\nThis License and the rights granted hereunder will terminate automatically if You fail\nto comply with terms herein and fail to cure such breach within 30 days of\nbecoming aware of the breach. All sublicenses to the Covered Code, which are\nproperly granted, shall survive any termination of this License. Provisions that,\nby their nature, must remain in effect beyond the termination of this License\nshall survive.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTermination Upon Litigation. If You initiate litigation by asserting a patent infringement\nclaim (excluding declatory judgment actions) against Initial Developer or a Contributor\n(the Initial Developer or Contributor against whom You file such action is referred to as\n\"Participant\") alleging that:\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nsuch Participant's Contributor Version directly or indirectly infringes any patent,\nthen any and all rights granted by such Participant to You under Sections 2.1 and/or\n2.2 of this License shall, upon 60 days notice from Participant terminate\nprospectively, unless if within 60 days after receipt of notice You either: (i) agree\nin writing to pay Participant a mutually agreeable reasonable royalty for Your past\nand future use of Modifications made by such Participant, or (ii) withdraw Your\nlitigation claim with respect to the Contributor Version against such Participant. If\nwithin 60 days of notice, a reasonable royalty and payment arrangement are not\nmutually agreed upon in writing by the parties or the litigation claim is not\nwithdrawn, the rights granted by Participant to You under Sections 2.1 and/or 2.2\nautomatically terminate at the expiration of the 60 day notice period specified\nabove.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nany software, hardware, or device, other than such Participant's Contributor\nVersion, directly or indirectly infringes any patent, then any rights granted to You\nby such Participant under Sections 2.1(b) and 2.2(b) are revoked effective as of the\ndate You first made, used, sold, distributed, or had made, Modifications made by that\nParticipant.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such\nParticipant's Contributor Version directly or indirectly infringes any patent where\nsuch claim is resolved (such as by license or settlement) prior to the initiation of\npatent infringement litigation, then the reasonable value of the licenses granted by such\nParticipant under Sections 2.1 or 2.2 shall be taken into account in determining the\namount or value of any payment or license.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "8.4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "9."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nLIMITATION OF LIABILITY.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE), CONTRACT,\nOR OTHERWISE, SHALL THE INITIAL DEVELOPER, ANY OTHER CONTRIBUTOR, OR ANY DISTRIBUTOR OF\nCOVERED CODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR\nANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER INCLUDING,\nWITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE OR\nMALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL HAVE\nBEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT APPLY\nTO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE\nEXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\nOR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT\nAPPLY TO YOU.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "10."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nU.S. GOVERNMENT END USERS.\nThe Covered Code is a ``commercial item,'' as that term is defined in 48 C.F.R. 2.101\n(Oct. 1995), consisting of ``commercial computer software'' and ``commercial\ncomputer software documentation,'' as such terms are used in 48 C.F.R. 12.212 (Sept.\n1995). Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June\n1995), all U.S. Government End Users acquire Covered Code with only those rights set forth\nherein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "11."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMISCELLANEOUS.\nhis section was intentionally left blank. The contents of this section are found in the\ncorresponding addendum described above.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "12."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRESPONSIBILITY FOR CLAIMS.\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for\ndamages arising, directly or indirectly, out of Your utilization of rights under this License, based\non the number of copies of Covered Code you made available, the revenues you received from utilizing\nsuch rights, and other relevant factors. You agree to work with affected parties to distribute with\nInitial Developer responsibility on an equitable basis.\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nEXHIBIT A.\nText for this Exhibit A is found in the corresponding addendum, described in section 6.4 above, text file\nprovided by the Initial Developer. This license is not valid or complete with out that file.\nEXHIBIT B.\nText for this Exhibit B is found in the corresponding addendum, described in section 6.4 above, text file\nprovided by the Initial Developer. This license is not valid or complete with out that file.\n"}]}, {"type": "text", "content": "\n"}]