[{"type": "optional", "content": {"type": "text", "content": "The Parity Public License 6.0.0"}}, {"type": "text", "content": "\n      Contributor: "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "contributor name"}, "pattern": ".+"}, {"type": "text", "content": "\n      Source Code: "}, {"type": "var", "name": "source", "content": {"type": "text", "content": "source"}, "pattern": ".+"}, {"type": "text", "content": "\n      This license lets you use and share this software for free, as long as you contribute software you make with it. Specifically:\n      If you follow the rules below, you may do everything with this software that would otherwise infringe either the contributor's copyright in it, any patent claim the contributor can license, or both.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Contribute changes and additions you make to this software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": " If you combine this software with other software, contribute that other software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Contribute software you develop, deploy, monitor, or run with this software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Ensure everyone who gets a copy of this software from you, in source code or any other form, gets the text of this license and the contributor and source code lines above.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": " Do not make any legal claim against anyone accusing this software, with or without changes, alone or with other software, of infringing any patent claim.\n      To contribute software, publish all its source code, in the preferred form for making changes, through a freely accessible distribution system widely used for similar source code, and license contributions not already licensed to the public on terms as permissive as this license accordingly.\n      You are excused for unknowingly breaking 1, 2, or 3 if you contribute as required, or stop doing anything requiring this license, within 30 days of learning you broke the rule.\n      **As far as the law allows, this software comes as is, without any warranty, and the contributor will not be liable to anyone for any damages related to this software or this license, for any kind of legal claim.**"}]