[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nOpen Data Commons Public Domain Dedication & License (PDDL)\n"}]}, {"tag": "text", "content": "\nPreamble\nThe Open Data Commons - Public Domain Dedication & Licence is a document intended to allow you\nto freely share, modify, and use this work for any purpose and without any restrictions. This\nlicence is intended for use on databases or their contents (\"data\"), either together\nor individually.\nMany databases are covered by copyright. Some jurisdictions, mainly in Europe, have specific special\nrights that cover databases called the \"sui generis\" database right. Both of these sets of\nrights, as well as other legal rights used to protect databases and data, can create uncertainty or\npractical difficulty for those wishing to share databases and their underlying data but retain a\nlimited amount of rights under a \"some rights reserved\" approach to licensing as outlined in\nthe Science Commons Protocol for Implementing Open Access Data. As a result, this waiver and licence\ntries to the fullest extent possible to eliminate or fully license any rights that cover this database\nand data. Any Community Norms or similar statements of use of the database or data do not form a part\nof this document, and do not act as a contract for access or other terms of use for the database or\ndata.\nThe position of the recipient of the work\nBecause this document places the database and its contents in or as close as possible within the public\ndomain, there are no restrictions or requirements placed on the recipient by this document. Recipients\nmay use this work commercially, use technical protection measures, combine this data or database with\nother databases or data, and share their changes and additions or keep them secret. It is not a\nrequirement that recipients provide further users with a copy of this licence or attribute the\noriginal creator of the data or database as a source. The goal is to eliminate restrictions held by\nthe original creator of the data and database on the use of it by others.\nThe position of the dedicator of the work\nCopyright law, as with most other law under the banner of \"intellectual property\", is\ninherently national law. This means that there exists several differences in how copyright and other\nIP rights can be relinquished, waived or licensed in the many legal jurisdictions of the world. This\nis despite much harmonisation of minimum levels of protection. The internet and other communication\ntechnologies span these many disparate legal jurisdictions and thus pose special difficulties for a\ndocument relinquishing and waiving intellectual property rights, including copyright and database\nrights, for use by the global community. Because of this feature of intellectual property law, this\ndocument first relinquishes the rights and waives the relevant rights and claims. It then goes on to\nlicense these same rights for jurisdictions or areas of law that may make it difficult to relinquish\nor waive rights or claims.\nThe purpose of this document is to enable rightsholders to place their work into the public domain.\nUnlike licences for free and open source software, free cultural works, or open content licences,\nrightsholders will not be able to \"dual license\" their work by releasing the same work under\ndifferent licences. This is because they have allowed anyone to use the work in whatever way they\nchoose. Rightsholders therefore can’t re-license it under copyright or database rights on\ndifferent terms because they have nothing left to license. Doing so creates truly accessible data to\nbuild rich applications and advance the progress of science and the arts.\nThis document can cover either or both of the database and its contents (the data). Because databases can\nhave a wide variety of content - not just factual data - rightsholders should use the Open Data\nCommons - Public Domain Dedication & Licence for an entire database and its contents only if\neverything can be placed under the terms of this document. Because even factual data can sometimes\nhave intellectual property rights, rightsholders should use this licence to cover both the database\nand its factual data when making material available under this document; even if it is likely that the\ndata would not be covered by copyright or database rights.\nRightsholders can also use this document to cover any copyright or database rights claims over only a\ndatabase, and leave the contents to be covered by other licences or documents. They can do this\nbecause this document refers to the \"Work\", which can be either - or both - the database and\nits contents. As a result, rightsholders need to clearly state what they are dedicating under this\ndocument when they dedicate it.\nJust like any licence or other document dealing with intellectual property, rightsholders should be aware\nthat one can only license what one owns. Please ensure that the rights have been cleared to make this\nmaterial available under this document.\nThis document permanently and irrevocably makes the Work available to the public for any use of any kind,\nand it should not be used unless the rightsholder is prepared for this to happen.\nPart I: Introduction\nThe Rightsholder (the Person holding rights or claims over the Work) agrees as follows:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions of Capitalised Words\n\"Copyright\" - Includes rights under copyright and under neighbouring rights and\nsimilarly related sets of rights under the law of the relevant jurisdiction under Section\n6.4.\n\"Data\" - The contents of the Database, which includes the information, independent\nworks, or other material collected into the Database offered under the terms of this\nDocument.\n\"Database\" - A collection of Data arranged in a systematic or methodical way and\nindividually accessible by electronic or other means offered under the terms of this\nDocument.\n\"Database Right\" - Means rights over Data resulting from the Chapter III (\"sui\ngeneris\") rights in the Database Directive (Directive 96/9/EC of the European Parliament\nand of the Council of 11 March 1996 on the legal protection of databases) and any future\nupdates as well as any similar rights available in the relevant jurisdiction under Section\n6.4.\n\"Document\" - means this relinquishment and waiver of rights and claims and back up\nlicence agreement.\n\"Person\" - Means a natural or legal person or a body of persons corporate or incorporate.\n\"Use\" - As a verb, means doing any act that is restricted by Copyright or Database\nRights whether in the original medium or any other; and includes modifying the Work as may be\ntechnically necessary to use it in a different mode or format. This includes the right to\nsublicense the Work.\n\"Work\" - Means either or both of the Database and Data offered under the terms of this\nDocument.\n\"You\" - the Person acquiring rights under the licence elements of this Document.\nWords in the singular include the plural and vice versa.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWhat this document covers\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLegal effect of this Document. This Document is:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nA dedication to the public domain and waiver of Copyright and Database Rights over the Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nA licence of Copyright and Database Rights over the Work in jurisdictions that do not allow\nfor relinquishment or waiver.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLegal rights covered.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopyright. Any copyright or neighbouring rights in the Work. Copyright law varies between\njurisdictions, but is likely to cover: the Database model or schema, which is the\nstructure, arrangement, and organisation of the Database, and can also include the\nDatabase tables and table indexes; the data entry and output sheets; and the Field names\nof Data stored in the Database. Copyright may also cover the Data depending on the\njurisdiction and type of Data; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDatabase Rights. Database Rights only extend to the extraction and re-utilisation of the\nwhole or a substantial part of the Data. Database Rights can apply even when there is no\ncopyright over the Database. Database Rights can also apply when the Data is removed from\nthe Database and is selected and arranged in a way that would not infringe any applicable\ncopyright.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRights not covered.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document does not apply to computer programs used in the making or operation of the Database;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document does not cover any patents over the Data or the Database. Please see Section\n4.2 later in this Document for further details; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document does not cover any trade marks associated with the Database. Please see Section\n4.3 later in this Document for further details.\nUsers of this Database are cautioned that they may have to clear other rights or consult\nother licences.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFacts are free. The Rightsholder takes the position that factual information is not covered by\nCopyright. This Document however covers the Work in jurisdictions that may protect the factual\ninformation in the Work by Copyright, and to cover any information protected by Copyright that\nis contained in the Work.\nPart II: Dedication to the public domain\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDedication, waiver, and licence of Copyright and Database Rights\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDedication of Copyright and Database Rights to the public domain. The Rightsholder by using this\nDocument, dedicates the Work to the public domain for the benefit of the public and\nrelinquishes all rights in Copyright and Database Rights over the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Rightsholder realises that once these rights are relinquished, that the Rightsholder has\nno further rights in Copyright and Database Rights over the Work, and that the Work is\nfree and open for others to Use.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Rightsholder intends for their relinquishment to cover all present and future rights in\nthe Work under Copyright and Database Rights, whether they are vested or contingent\nrights, and that this relinquishment of rights covers all their heirs and successors.\nThe above relinquishment of rights applies worldwide and includes media and formats now known\nor created in the future.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWaiver of rights and claims in Copyright and Database Rights when Section 3.1 dedication\ninapplicable. If the dedication in Section 3.1 does not apply in the relevant jurisdiction\nunder Section 6.4, the Rightsholder waives any rights and claims that the Rightsholder may\nhave or acquire in the future over the Work in:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nCopyright; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDatabase Rights.\nTo the extent possible in the relevant jurisdiction, the above waiver of rights and claims\napplies worldwide and includes media and formats now known or created in the future. The\nRightsholder agrees not to assert the above rights and waives the right to enforce them\nover the Work.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLicence of Copyright and Database Rights when Sections 3.1 and 3.2 inapplicable. If the\ndedication and waiver in Sections 3.1 and 3.2 does not apply in the relevant jurisdiction\nunder Section 6.4, the Rightsholder and You agree as follows:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Licensor grants to You a worldwide, royalty-free, non-exclusive, licence to Use the Work\nfor the duration of any applicable Copyright and Database Rights. These rights explicitly\ninclude commercial use, and do not exclude any field of endeavour. To the extent possible\nin the relevant jurisdiction, these rights may be exercised in all media and formats\nwhether now known or created in the future.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMoral rights. This section covers moral rights, including the right to be identified as the\nauthor of the Work or to object to treatment that would otherwise prejudice the\nauthor’s honour and reputation, or any other derogatory treatment:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "a."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor jurisdictions allowing waiver of moral rights, Licensor waives all moral rights that\nLicensor may have in the Work to the fullest extent possible by the law of the relevant\njurisdiction under Section 6.4;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "b."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf waiver of moral rights under Section 3.4 a in the relevant jurisdiction is not possible,\nLicensor agrees not to assert any moral rights over the Work and waives all claims in\nmoral rights to the fullest extent possible by the law of the relevant jurisdiction under\nSection 6.4; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "c."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nFor jurisdictions not allowing waiver or an agreement not to assert moral rights under\nSection 3.4 a and b, the author may retain their moral rights over the copyrighted aspects\nof the Work.\nPlease note that some jurisdictions do not allow for the waiver of moral rights, and so moral\nrights may still subsist over the work in some jurisdictions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRelationship to other rights\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNo other contractual conditions. The Rightsholder makes this Work available to You without any\nother contractual obligations, either express or implied. Any Community Norms statement\nassociated with the Work is not a contract and does not form part of this Document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRelationship to patents. This Document does not grant You a licence for any patents that the\nRightsholder may own. Users of this Database are cautioned that they may have to clear other\nrights or consult other licences.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRelationship to trade marks. This Document does not grant You a licence for any trade marks that\nthe Rightsholder may own or that the Rightsholder may use to cover the Work. Users of this\nDatabase are cautioned that they may have to clear other rights or consult other licences.\nPart III: General provisions\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWarranties, disclaimer, and limitation of liability\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThe Work is provided by the Rightsholder \"as is\" and without any warranty of any kind,\neither express or implied, whether of title, of accuracy or completeness, of the presence of\nabsence of errors, of fitness for purpose, or otherwise. Some jurisdictions do not allow the\nexclusion of implied warranties, so this exclusion may not apply to You.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSubject to any liability that may not be excluded or limited by law, the Rightsholder is not\nliable for, and expressly excludes, all liability for loss or damage however and whenever\ncaused to anyone by any use under this Document, whether by You or by anyone else, and whether\ncaused by any fault on the part of the Rightsholder or not. This exclusion of liability\nincludes, but is not limited to, any special, incidental, consequential, punitive, or\nexemplary damages. This exclusion applies even if the Rightsholder has been advised of the\npossibility of such damages.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf liability may not be excluded by law, it is limited to actual and direct financial loss to the\nextent it is caused by proved negligence on the part of the Rightsholder.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.0"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf any provision of this Document is held to be invalid or unenforceable, that must not affect\nthe cvalidity or enforceability of the remainder of the terms of this Document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document is the entire agreement between the parties with respect to the Work covered here.\nIt replaces any earlier understandings, agreements or representations with respect to the Work\nnot specified here.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document does not affect any rights that You or anyone else may independently have under any\napplicable law to make any use of this Work, including (for jurisdictions where this Document\nis a licence) fair dealing, fair use, database exceptions, or any other legally recognised\nlimitation or exception to infringement of copyright or other applicable laws.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis Document takes effect in the relevant jurisdiction in which the Document terms are sought to\nbe enforced. If the rights waived or granted under applicable law in the relevant jurisdiction\nincludes additional rights not waived or granted under this Document, these additional rights\nare included in this Document in order to meet the intent of this Document.\n"}]