[{"type": "optional", "content": {"type": "text", "content": "PYTHON SOFTWARE FOUNDATION LICENSE VERSION 2"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This LICENSE AGREEMENT is between the Python Software Foundation (\"PSF\"), and the\n          Individual or Organization (\"Licensee\") accessing and otherwise using this software\n          (\"Python\") in source or binary form and its associated documentation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Subject to the terms and conditions of this License Agreement, PSF hereby grants Licensee\n          a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform\n          and/or display publicly, prepare derivative works, distribute, and otherwise use Python\n          alone or in any derivative version, provided, however, that PSF's License Agreement and\n          PSF's notice of copyright, i.e., \"Copyright (c)\n          "}, {"type": "var", "name": "exampleCopyrightYears", "content": {"type": "text", "content": "2001, 2002, 2003, 2004, 2005, 2006"}, "pattern": "([0-9]{4},\\s)*[0-9]{4}"}, {"type": "text", "content": "\n          Python Software Foundation; All Rights Reserved\" are retained in Python alone or in any\n          derivative version prepared by Licensee.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          In the event Licensee prepares a derivative work that is based on or incorporates Python\n          or any part thereof, and wants to make the derivative work available to others as provided\n          herein, then Licensee hereby agrees to include in any such work a brief summary of the\n          changes made to Python.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          PSF is making Python available to Licensee on an \"AS IS\" basis. PSF MAKES NO\n          REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION,\n          PSF MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\n          FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT INFRINGE ANY THIRD PARTY\n          RIGHTS.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON FOR ANY INCIDENTAL,\n          SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR\n          OTHERWISE USING PYTHON, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY\n          THEREOF.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          This License Agreement will automatically terminate upon a material breach of its terms\n          and conditions.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Nothing in this License Agreement shall be deemed to create any relationship of agency,\n          partnership, or joint venture between PSF and Licensee. This License Agreement does not\n          grant permission to use PSF trademarks or trade name in a trademark sense to endorse or\n          promote products or services of Licensee, or any third party.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          By copying, installing or otherwise using Python, Licensee agrees to be bound by the terms\n          and conditions of this License Agreement."}]