[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Qhull, Copyright (c) 1993-2003\n         The National Science and Technology Research Center for Computation and Visualization of Geometric\n         Structures (The Geometry Center) University of Minnesota"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n      email: qhull@qhull.org\n      This software includes Qhull from The Geometry Center. Qhull is copyrighted as noted above. Qhull is free\n         software and may be obtained via http from www.qhull.org. It may be freely copied, modified, and\n         redistributed under the following conditions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All copyright notices must remain intact in all files.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          A copy of this text file must be distributed along with any copies of Qhull that you\n             redistribute; this includes copies that you have modified, or copies of programs or other\n             software products that include Qhull.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If you modify Qhull, you must include a notice giving the name of the person performing the\n             modification, the date of modification, and the reason for such modification.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          When distributing modified versions of Qhull, or other software products that include Qhull, you\n             must provide notice that the original source code may be obtained as noted above.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          There is no warranty or other guarantee of fitness for Qhull, it is provided solely \"as is\". Bug\n             reports or fixes may be sent to qhull_bug@qhull.org; the authors may or may not act on them as\n             they desire."}]