[{"type": "optional", "content": {"type": "text", "content": "THE Q PUBLIC LICENSE version 1.0"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (C) 1999-2005 Trolltech AS, Norway."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Everyone is permitted to copy and distribute this license document.\n      The intent of this license is to establish freedom to share and change the software regulated by this\n         license under the open source model.\n      This license applies to any software containing a notice placed by the copyright holder saying that it\n         may be distributed under the terms of the Q Public License version 1.0. Such software is herein\n         referred to as the Software. This license covers modification and distribution of the Software, use of\n         third-party application programs based on the Software, and development of free software which uses\n         the Software.\n      Granted Rights\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You are granted the non-exclusive rights set forth in this license provided you agree to and\n             comply with any and all conditions in this license. Whole or partial distribution of the\n             Software, or software items that link with the Software, in any form signifies acceptance of\n             this license.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may copy and distribute the Software in unmodified form provided that the entire package,\n             including - but not restricted to - copyright, trademark notices and disclaimers, as released\n             by the initial developer of the Software, is distributed.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may make modifications to the Software and distribute your modifications, in a form that is\n             separate from the Software, such as patches. The following restrictions apply to\n             modifications:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                Modifications must not alter or remove any copyright notices in the Software.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                When modifications to the Software are released under this license, a non-exclusive royalty-free\n                  right is granted to the initial developer of the Software to distribute your modification in\n                  future versions of the Software provided such versions remain available under these terms in\n                  addition to any other license(s) of the initial developer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may distribute machine-executable forms of the Software or machine-executable forms of\n             modified versions of the Software, provided that you meet these restrictions:\n           "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                You must include this license document in the distribution.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                You must ensure that all recipients of the machine-executable forms are also able to receive the\n                 complete machine-readable source code to the distributed Software, including all\n                 modifications, without any charge beyond the costs of data transfer, and place prominent\n                 notices in the distribution explaining this.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                You must ensure that all modifications included in the machine-executable forms are available\n                   under the terms of this license.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may use the original or modified versions of the Software to compile, link and run\n             application programs legally developed by you or by others.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You may develop application programs, reusable components and other software items that link with\n             the original or modified versions of the Software. These items, when distributed, are subject\n             to the following requirements:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                You must ensure that all recipients of machine-executable forms of these items are also able to\n                   receive and use the complete machine-readable source code to the items without any charge\n                   beyond the costs of data transfer.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                You must explicitly license all recipients of your items to use and re-distribute original and\n                   modified versions of the items in both machine-executable and source code forms. The\n                   recipients must be able to do so without any charges whatsoever, and they must be able to\n                   re-distribute to anyone they choose.\n              "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n                If the items are not available to the general public, and the initial developer of the Software\n                   requests a copy of the items, then you must supply one.\n      Limitations of Liability\n      In no event shall the initial developers or copyright holders be liable for any damages whatsoever,\n         including - but not restricted to - lost revenue or profits or other direct, indirect, special,\n         incidental or consequential damages, even if they have been advised of the possibility of such\n         damages, except to the extent invariable law, if any, provides otherwise.\n      No Warranty\n      The Software and this license document are provided AS IS with NO WARRANTY OF ANY KIND, INCLUDING THE\n         WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.\n      Choice of Law\n      This license is governed by the Laws of Norway. Disputes shall be settled by Oslo City Court."}]