[{"type": "optional", "content": {"type": "text", "content": "Reciprocal Public License 1.5 (RPL1.5)\n         Version 1.5, July 15, 2007"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (C) 2001-2007 Technical Pursuit Inc., All Rights Reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      PREAMBLE\n      The Reciprocal Public License (RPL) is based on the concept of reciprocity or, if you prefer, fairness.\n      In short, this license grew out of a desire to close loopholes in previous open source licenses,\n         loopholes that allowed parties to acquire open source software and derive financial benefit from it\n         without having to release their improvements or derivatives to the community which enabled them. This\n         occurred any time an entity did not release their application to a \"third party\".\n      While there is a certain freedom in this model of licensing, it struck the authors of the RPL as being\n         unfair to the open source community at large and to the original authors of the works in particular.\n         After all, bug fixes, extensions, and meaningful and valuable derivatives were not consistently\n         finding their way back into the community where they could fuel further, and faster, growth and\n         expansion of the overall open source software base.\n      While you should clearly read and understand the entire license, the essence of the RPL is found in two\n         definitions: \"Deploy\" and \"Required Components\".\n      Regarding deployment, under the RPL your changes, bug fixes, extensions, etc. must be made available to\n         the open source community at large when you Deploy in any form -- either internally or to an outside\n         party. Once you start running the software you have to start sharing the software.\n      Further, under the RPL all components you author including schemas, scripts, source code, etc. --\n         regardless of whether they're compiled into a single binary or used as two halves of client/server\n         application -- must be shared. You have to share the whole pie, not an isolated slice of it.\n      In addition to these goals, the RPL was authored to meet the requirements of the Open Source Definition\n         as maintained by the Open Source Initiative (OSI).\n      The specific terms and conditions of the license are defined in the remainder of this document.\n      LICENSE TERMS\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          General; Applicability & Definitions. This Reciprocal Public License Version 1.5 (\"License\")\n             applies to any programs or other works as well as any and all updates or maintenance releases\n             of said programs or works (\"Software\") not already covered by this License which the Software\n             copyright holder (\"Licensor\") makes available containing a License Notice (hereinafter\n             defined) from the Licensor specifying or allowing use or distribution under the terms of this\n             License. As used in this License:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Contributor\" means any person or entity who created or contributed to the creation of an Extension.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Deploy\" means to use, Serve, sublicense or distribute Licensed Software other than for Your\n             internal Research and/or Personal Use, and includes without limitation, any and all internal\n             use or distribution of Licensed Software within Your business or organization other than for\n             Research and/or Personal Use, as well as direct or indirect sublicensing or distribution of\n             Licensed Software by You to any third party in any form or manner.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Derivative Works\" as used in this License is defined under U.S. copyright law.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Electronic Distribution Mechanism\" means a mechanism generally accepted in the software\n             development community for the electronic transfer of data such as download from an FTP server\n             or web site, where such mechanism is publicly accessible.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Extensions\" means any Modifications, Derivative Works, or Required Components as those terms are\n             defined in this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"License\" means this Reciprocal Public License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.7"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"License Notice\" means any notice contained in EXHIBIT A.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.8"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Licensed Software\" means any Software licensed pursuant to this License. Licensed Software also\n             includes all previous Extensions from any Contributor that You receive.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.9"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Licensor\" means the copyright holder of any Software previously not covered by this License who\n             releases the Software under the terms of this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.10"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Modifications\" means any additions to or deletions from the substance or structure of (i) a file\n             or other storage containing Licensed Software, or (ii) any new file or storage that contains\n             any part of Licensed Software, or (iii) any file or storage which replaces or otherwise alters\n             the original functionality of Licensed Software at runtime.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.11"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Personal Use\" means use of Licensed Software by an individual solely for his or her personal,\n             private and non-commercial purposes. An individual's use of Licensed Software in his or her\n             capacity as an officer, employee, member, independent contractor or agent of a corporation,\n             business or organization (commercial or non-commercial) does not qualify as Personal Use.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.12"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Required Components\" means any text, programs, scripts, schema, interface definitions, control\n             files, or other works created by You which are required by a third party of average skill to\n             successfully install and run Licensed Software containing Your Modifications, or to install\n             and run Your Derivative Works.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.13"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Research\" means investigation or experimentation for the purpose of understanding the nature and\n             limits of the Licensed Software and its potential uses.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.14"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Serve\" means to deliver Licensed Software and/or Your Extensions by means of a computer network\n             to one or more computers for purposes of execution of Licensed Software and/or Your\n             Extensions.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.15"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Software\" means any computer programs or other works as well as any updates or maintenance\n             releases of those programs or works which are distributed publicly by Licensor.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.16"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"Source Code\" means the preferred form for making modifications to the Licensed Software and/or\n             Your Extensions, including all modules contained therein, plus any associated text, interface\n             definition files, scripts used to control compilation and installation of an executable\n             program or other components required by a third party of average skill to build a running\n             version of the Licensed Software or Your Extensions.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.17"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"User-Visible Attribution Notice\" means any notice contained in EXHIBIT B.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.18"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          \"You\" or \"Your\" means an individual or a legal entity exercising rights under this License. For\n             legal entities, \"You\" or \"Your\" includes any entity which controls, is controlled by, or is\n             under common control with, You, where \"control\" means (a) the power, direct or indirect, to\n             cause the direction or management of such entity, whether by contract or otherwise, or (b)\n             ownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of\n             such entity.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Acceptance Of License. You are not required to accept this License since you have not signed it,\n             however nothing else grants you permission to use, copy, distribute, modify, or create\n             derivatives of either the Software or any Extensions created by a Contributor. These actions\n             are prohibited by law if you do not accept this License. Therefore, by performing any of these\n             actions You indicate Your acceptance of this License and Your agreement to be bound by all its\n             terms and conditions. IF YOU DO NOT AGREE WITH ALL THE TERMS AND CONDITIONS OF THIS LICENSE DO\n             NOT USE, MODIFY, CREATE DERIVATIVES, OR DISTRIBUTE THE SOFTWARE. IF IT IS IMPOSSIBLE FOR YOU\n             TO COMPLY WITH ALL THE TERMS AND CONDITIONS OF THIS LICENSE THEN YOU CAN NOT USE, MODIFY,\n             CREATE DERIVATIVES, OR DISTRIBUTE THE SOFTWARE.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of License From Licensor. Subject to the terms and conditions of this License, Licensor\n             hereby grants You a world-wide, royalty-free, "}, {"type": "var", "name": "anotherExtraSpace", "content": {"type": "text", "content": "non-exclusive"}, "pattern": "non- ?exclusive"}, {"type": "text", "content": " license, subject to Licensor's\n             intellectual property rights, and any third party intellectual property claims derived from\n             the Licensed Software under this License, to do the following:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Use, reproduce, modify, display, perform, sublicense and distribute Licensed Software and Your\n             Extensions in both Source Code form or as an executable program.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Create Derivative Works (as that term is defined under U.S. copyright law) of Licensed Software\n             by adding to or deleting from the substance or structure of said Licensed Software.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Under claims of patents now or hereafter owned or controlled by Licensor, to make, use, have\n             made, and/or otherwise dispose of Licensed Software or portions thereof, but solely to the\n             extent that any such claim is necessary to enable You to make, use, have made, and/or\n             otherwise dispose of Licensed Software or portions thereof.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Licensor reserves the right to release new versions of the Software with different features,\n             specifications, capabilities, functions, licensing terms, general availability or other\n             characteristics. Title, ownership rights, and intellectual property rights in and to the\n             Licensed Software shall remain in Licensor and/or its Contributors.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Grant of License From Contributor. By application of the provisions in Section 6 below, each\n             Contributor hereby grants You a world-wide, "}, {"type": "var", "name": "extraSpace", "content": {"type": "text", "content": "royalty-free"}, "pattern": "royalty- ?free"}, {"type": "text", "content": ", non-exclusive license, subject to\n             said Contributor's intellectual property rights, and any third party intellectual property\n             claims derived from the Licensed Software under this License, to do the following:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Use, reproduce, modify, display, perform, sublicense and distribute any Extensions Deployed by\n             such Contributor or portions thereof, in both Source Code form or as an executable program,\n             either on an unmodified basis or as part of Derivative Works.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Under claims of patents now or hereafter owned or controlled by Contributor, to make, use, have\n             made, and/or otherwise dispose of Extensions or portions thereof, but solely to the extent\n             that any such claim is necessary to enable You to make, use, have made, and/or otherwise\n             dispose of Licensed Software or portions thereof.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Exclusions From License Grant. Nothing in this License shall be deemed to grant any rights to\n             trademarks, copyrights, patents, trade secrets or any other intellectual property of Licensor\n             or any Contributor except as expressly stated herein. Except as expressly stated in Sections 3\n             and 4, no other patent rights, express or implied, are granted herein. Your Extensions may\n             require additional patent licenses from Licensor or Contributors which each may grant in its\n             sole discretion. No right is granted to the trademarks of Licensor or any Contributor even if\n             such marks are included in the Licensed Software. Nothing in this License shall be interpreted\n             to prohibit Licensor from licensing under different terms from this License any code that\n             Licensor otherwise would have a right to license.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          You expressly acknowledge and agree that although Licensor and each Contributor grants the\n             licenses to their respective portions of the Licensed Software set forth herein, no assurances\n             are provided by Licensor or any Contributor that the Licensed Software does not infringe the\n             patent or other intellectual property rights of any other entity. Licensor and each\n             Contributor disclaim any liability to You for claims brought by any other entity based on\n             infringement of intellectual property rights or otherwise. As a condition to exercising the\n             rights and licenses granted hereunder, You hereby assume sole responsibility to secure any\n             other intellectual property rights needed, if any. For example, if a third party patent\n             license is required to allow You to distribute the Licensed Software, it is Your\n             responsibility to acquire that license before distributing the Licensed Software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Your Obligations And Grants. In consideration of, and as an express condition to, the licenses\n             granted to You under this License You hereby agree that any Modifications, Derivative Works,\n             or Required Components (collectively Extensions) that You create or to which You contribute\n             are governed by the terms of this License including, without limitation, Section 4. Any\n             Extensions that You create or to which You contribute must be Deployed under the terms of this\n             License or a future version of this License released under Section 7. You hereby grant to\n             Licensor and all third parties a world-wide, non-exclusive, royalty-free license under those\n             intellectual property rights You own or control to use, reproduce, display, perform, modify,\n             create derivatives, sublicense, and distribute Licensed Software, in any form. Any Extensions\n             You make and Deploy must have a distinct title so as to readily tell any subsequent user or\n             Contributor that the Extensions are by You. You must include a copy of this License or\n             directions on how to obtain a copy with every copy of the Extensions You distribute. You agree\n             not to offer or impose any terms on any Source Code or executable version of the Licensed\n             Software, or its Extensions that alter or restrict the applicable version of this License or\n             the recipients' rights hereunder.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Availability of Source Code. You must make available, under the terms of this License, the Source\n             Code of any Extensions that You Deploy, via an Electronic Distribution Mechanism. The Source\n             Code for any version that You Deploy must be made available within one (1) month of when you\n             Deploy and must remain available for no less than twelve (12) months after the date You cease\n             to Deploy. You are responsible for ensuring that the Source Code to each version You Deploy\n             remains available even if the Electronic Distribution Mechanism is maintained by a third\n             party. You may not charge a fee for any copy of the Source Code distributed under this Section\n             in excess of Your actual cost of duplication and distribution of said copy.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Description of Modifications. You must cause any Modifications that You create or to which You\n             contribute to be documented in the Source Code, clearly describing the additions, changes or\n             deletions You made. You must include a prominent statement that the Modifications are derived,\n             directly or indirectly, from the Licensed Software and include the names of the Licensor and\n             any Contributor to the Licensed Software in (i) the Source Code and (ii) in any notice\n             displayed by the Licensed Software You distribute or in related documentation in which You\n             describe the origin or ownership of the Licensed Software. You may not modify or delete any\n             pre-existing copyright notices, change notices or License text in the Licensed Software\n             without written permission of the respective Licensor or Contributor.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Intellectual Property Matters.\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Third Party Claims. If You have knowledge that a license to a third party's intellectual property\n                 right is required to exercise the rights granted by this License, You must include a\n                 human-readable file with Your distribution that describes the claim and the party making the\n                 claim in sufficient detail that a recipient will know whom to contact.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Contributor APIs. If Your Extensions include an application programming interface (\"API\") and You\n                 have knowledge of patent licenses that are reasonably necessary to implement that API, You\n                 must also include this information in a human-readable file supplied with Your\n                 distribution.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Representations. You represent that, except as disclosed pursuant to 6.3(a) above, You believe\n                 that any Extensions You distribute are Your original creations and that You have sufficient\n                 rights to grant the rights conveyed by this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Required Notices.\n\n          "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              License Text. You must duplicate this License or instructions on how to acquire a copy in any\n                 documentation You provide along with the Source Code of any Extensions You create or to which\n                 You contribute, wherever You describe recipients' rights relating to Licensed Software.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              License Notice. You must duplicate any notice contained in EXHIBIT A (the \"License Notice\") in\n                 each file of the Source Code of any copy You distribute of the Licensed Software and Your\n                 Extensions. If You create an Extension, You may add Your name as a Contributor to the Source\n                 Code and accompanying documentation along with a description of the contribution. If it is not\n                 possible to put the License Notice in a particular Source Code file due to its structure, then\n                 You must include such License Notice in a location where a user would be likely to look for\n                 such a notice.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Source Code Availability. You must notify the software community of the availability of Source\n                 Code to Your Extensions within one (1) month of the date You initially Deploy and include in\n                 such notification a description of the Extensions, and instructions on how to acquire the\n                 Source Code. Should such instructions change you must notify the software community of revised\n                 instructions within one (1) month of the date of change. You must provide notification by\n                 posting to appropriate news groups, mailing lists, weblogs, or other sites where a publicly\n                 accessible search engine would reasonably be expected to index your post in relationship to\n                 queries regarding the Licensed Software and/or Your Extensions.\n                     "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "d."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              User-Visible Attribution. You must duplicate any notice contained in EXHIBIT B (the \"User-Visible\n                 Attribution Notice\") in each user-visible display of the Licensed Software and Your Extensions\n                 which delineates copyright, ownership, or similar attribution information. If You create an\n                 Extension, You may add Your name as a Contributor, and add Your attribution notice, as an\n                 equally visible and functional element of any User-Visible Attribution Notice content. To\n                 ensure proper attribution, You must also include such User-Visible Attribution Notice in at\n                 least one location in the Software documentation where a user would be likely to look for such\n                 notice.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Additional Terms. You may choose to offer, and charge a fee for, warranty, support, indemnity or\n             liability obligations to one or more recipients of Licensed Software. However, You may do so\n             only on Your own behalf, and not on behalf of the Licensor or any Contributor except as\n             permitted under other agreements between you and Licensor or Contributor. You must make it\n             clear that any such warranty, support, indemnity or liability obligation is offered by You\n             alone, and You hereby agree to indemnify the Licensor and every Contributor for any liability\n             plus attorney fees, costs, and related expenses due to any such action or claim incurred by\n             the Licensor or such Contributor as a result of warranty, support, indemnity or liability\n             terms You offer.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Conflicts With Other Licenses. Where any portion of Your Extensions, by virtue of being\n             Derivative Works of another product or similar circumstance, fall under the terms of another\n             license, the terms of that license should be honored however You must also make Your\n             Extensions available under this License. If the terms of this License continue to conflict\n             with the terms of the other license you may write the Licensor for permission to resolve the\n             conflict in a fashion that remains consistent with the intent of this License. Such permission\n             will be granted at the sole discretion of the Licensor.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Versions of This License. Licensor may publish from time to time revised versions of the License.\n             Once Licensed Software has been published under a particular version of the License, You may\n             always continue to use it under the terms of that version. You may also choose to use such\n             Licensed Software under the terms of any subsequent version of the License published by\n             Licensor. No one other than Licensor has the right to modify the terms applicable to Licensed\n             Software created under this License.\n\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If You create or use a modified version of this License, which You may do only in order to apply\n             it to software that is not already Licensed Software under this License, You must rename Your\n             license so that it is not confusingly similar to this License, and must make it clear that\n             Your license contains terms that differ from this License. In so naming Your license, You may\n             not use any trademark of Licensor or of any Contributor. Should Your modifications to this\n             License be limited to alteration of a) Section 13.8 solely to modify the legal Jurisdiction or\n             Venue for disputes, b) EXHIBIT A solely to define License Notice text, or c) to EXHIBIT B\n             solely to define a User-Visible Attribution Notice, You may continue to refer to Your License\n             as the Reciprocal Public License or simply the RPL.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Disclaimer of Warranty. LICENSED SOFTWARE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS,\n             WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION,\n             WARRANTIES THAT THE LICENSED SOFTWARE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR\n             PURPOSE OR NON-INFRINGING. FURTHER THERE IS NO WARRANTY MADE AND ALL IMPLIED WARRANTIES ARE\n             DISCLAIMED THAT THE LICENSED SOFTWARE MEETS OR COMPLIES WITH ANY DESCRIPTION OF PERFORMANCE OR\n             OPERATION, SAID COMPATIBILITY AND SUITABILITY BEING YOUR RESPONSIBILITY. LICENSOR DISCLAIMS\n             ANY WARRANTY, IMPLIED OR EXPRESSED, THAT ANY CONTRIBUTOR'S EXTENSIONS MEET ANY STANDARD OF\n             COMPATIBILITY OR DESCRIPTION OF PERFORMANCE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE\n             OF THE LICENSED SOFTWARE IS WITH YOU. SHOULD LICENSED SOFTWARE PROVE DEFECTIVE IN ANY RESPECT,\n             YOU (AND NOT THE LICENSOR OR ANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY\n             SERVICING, REPAIR OR CORRECTION. UNDER THE TERMS OF THIS LICENSOR WILL NOT SUPPORT THIS\n             SOFTWARE AND IS UNDER NO OBLIGATION TO ISSUE UPDATES TO THIS SOFTWARE. LICENSOR HAS NO\n             KNOWLEDGE OF ERRANT CODE OR VIRUS IN THIS SOFTWARE, BUT DOES NOT WARRANT THAT THE SOFTWARE IS\n             FREE FROM SUCH ERRORS OR VIRUSES. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF\n             THIS LICENSE. NO USE OF LICENSED SOFTWARE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS\n             DISCLAIMER.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Limitation of Liability. UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT\n             (INCLUDING NEGLIGENCE), CONTRACT, OR OTHERWISE, SHALL THE LICENSOR, ANY CONTRIBUTOR, OR ANY\n             DISTRIBUTOR OF LICENSED SOFTWARE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO ANY\n             PERSON FOR ANY INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER\n             INCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER FAILURE\n             OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF SUCH PARTY SHALL\n             HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS LIMITATION OF LIABILITY SHALL NOT\n             APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY RESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE\n             EXTENT APPLICABLE LAW PROHIBITS SUCH LIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION\n             OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES, SO THIS EXCLUSION AND LIMITATION MAY NOT\n             APPLY TO YOU.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          High Risk Activities. THE LICENSED SOFTWARE IS NOT FAULT-TOLERANT AND IS NOT DESIGNED,\n             MANUFACTURED, OR INTENDED FOR USE OR DISTRIBUTION AS ON-LINE CONTROL EQUIPMENT IN HAZARDOUS\n             ENVIRONMENTS REQUIRING FAIL-SAFE PERFORMANCE, SUCH AS IN THE OPERATION OF NUCLEAR FACILITIES,\n             AIRCRAFT NAVIGATION OR COMMUNICATIONS SYSTEMS, AIR TRAFFIC CONTROL, DIRECT LIFE SUPPORT\n             MACHINES, OR WEAPONS SYSTEMS, IN WHICH THE FAILURE OF THE LICENSED SOFTWARE COULD LEAD\n             DIRECTLY TO DEATH, PERSONAL INJURY, OR SEVERE PHYSICAL OR ENVIRONMENTAL DAMAGE (\"HIGH RISK\n             ACTIVITIES\"). LICENSOR AND CONTRIBUTORS SPECIFICALLY DISCLAIM ANY EXPRESS OR IMPLIED WARRANTY\n             OF FITNESS FOR HIGH RISK ACTIVITIES.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "11.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Responsibility for Claims. As between Licensor and Contributors, each party is responsible for\n             claims and damages arising, directly or indirectly, out of its utilization of rights under\n             this License which specifically disclaims warranties and limits any liability of the Licensor.\n             This paragraph is to be used in conjunction with and controlled by the Disclaimer Of\n             Warranties of Section 8, the Limitation Of Damages in Section 9, and the disclaimer against\n             use for High Risk Activities in Section 10. The Licensor has thereby disclaimed all warranties\n             and limited any damages that it is or may be liable for. You agree to work with Licensor and\n             Contributors to distribute such responsibility on an equitable basis consistent with the terms\n             of this License including Sections 8, 9, and 10. Nothing herein is intended or shall be deemed\n             to constitute any admission of liability.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Termination. This License and all rights granted hereunder will terminate immediately in the\n             event of the circumstances described in Section 13.6 or if applicable law prohibits or\n             restricts You from fully and or specifically complying with Sections 3, 4 and/or 6, or\n             prevents the enforceability of any of those Sections, and You must immediately discontinue any\n             use of Licensed Software.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Automatic Termination Upon Breach. This License and the rights granted hereunder will terminate\n             automatically if You fail to comply with the terms herein and fail to cure such breach within\n             thirty (30) days of becoming aware of the breach. All sublicenses to the Licensed Software\n             that are properly granted shall survive any termination of this License. Provisions that, by\n             their nature, must remain in effect beyond the termination of this License, shall survive.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Termination Upon Assertion of Patent Infringement. If You initiate litigation by asserting a\n             patent infringement claim (excluding declaratory judgment actions) against Licensor or a\n             Contributor (Licensor or Contributor against whom You file such an action is referred to\n             herein as \"Respondent\") alleging that Licensed Software directly or indirectly infringes any\n             patent, then any and all rights granted by such Respondent to You under Sections 3 or 4 of\n             this License shall terminate prospectively upon sixty (60) days notice from Respondent (the\n             \"Notice Period\") unless within that Notice Period You either agree in writing (i) to pay\n             Respondent a mutually agreeable reasonably royalty for Your past or future use of Licensed\n             Software made by such Respondent, or (ii) withdraw Your litigation claim with respect to\n             Licensed Software against such Respondent. If within said Notice Period a reasonable royalty\n             and payment arrangement are not mutually agreed upon in writing by the parties or the\n             litigation claim is not withdrawn, the rights granted by Licensor to You under Sections 3 and\n             4 automatically terminate at the expiration of said Notice Period.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Reasonable Value of This License. If You assert a patent infringement claim against Respondent\n             alleging that Licensed Software directly or indirectly infringes any patent where such claim\n             is resolved (such as by license or settlement) prior to the initiation of patent infringement\n             litigation, then the reasonable value of the licenses granted by said Respondent under\n             Sections 3 and 4 shall be taken into account in determining the amount or value of any payment\n             or license.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "12.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Retroactive Effect of Termination. In the event of termination under this Section all end user\n             license agreements (excluding licenses to distributors and resellers) that have been validly\n             granted by You or any distributor hereunder prior to termination shall survive\n             termination.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.0"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Miscellaneous.\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          U.S. Government End Users. The Licensed Software is a \"commercial item,\" as that term is defined\n             in 48 C.F.R. 2.101 (Oct. 1995), consisting of \"commercial computer software\" and \"commercial\n             computer software documentation,\" as such terms are used in 48 C.F.R. 12.212 (Sept. 1995).\n             Consistent with 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all\n             U.S. Government End Users acquire Licensed Software with only those rights set forth\n             herein.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Relationship of Parties. This License will not be construed as creating an agency, partnership,\n             joint venture, or any other form of legal association between or among You, Licensor, or any\n             Contributor, and You will not represent to the contrary, whether expressly, by implication,\n             appearance, or otherwise.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Independent Development. Nothing in this License will impair Licensor's right to acquire,\n             license, develop, subcontract, market, or distribute technology or products that perform the\n             same or similar functions as, or otherwise compete with, Extensions that You may develop,\n             produce, market, or distribute.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Consent To Breach Not Waiver. Failure by Licensor or Contributor to enforce any provision of this\n             License will not be deemed a waiver of future enforcement of that or any other provision.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Severability. This License represents the complete agreement concerning the subject matter\n             hereof. If any provision of this License is held to be unenforceable, such provision shall be\n             reformed only to the extent necessary to make it enforceable.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Inability to Comply Due to Statute or Regulation. If it is impossible for You to comply with any\n             of the terms of this License with respect to some or all of the Licensed Software due to\n             statute, judicial order, or regulation, then You cannot use, modify, or distribute the\n             software.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.7"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Export Restrictions. You may be restricted with respect to downloading or otherwise acquiring,\n             exporting, or reexporting the Licensed Software or any underlying information or technology by\n             United States and other applicable laws and regulations. By downloading or by otherwise\n             obtaining the Licensed Software, You are agreeing to be responsible for compliance with all\n             applicable laws and regulations.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.8"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Arbitration, Jurisdiction & Venue. This License shall be governed by Colorado law provisions\n             (except to the extent applicable law, if any, provides otherwise), excluding its\n             conflict-of-law provisions. You expressly agree that any dispute relating to this License\n             shall be submitted to binding arbitration under the rules then prevailing of the American\n             Arbitration Association. You further agree that Adams County, Colorado USA is proper venue and\n             grant such arbitration proceeding jurisdiction as may be appropriate for purposes of resolving\n             any dispute under this License. Judgement upon any award made in arbitration may be entered\n             and enforced in any court of competent jurisdiction. The arbitrator shall award attorney's\n             fees and costs of arbitration to the prevailing party. Should either party find it necessary\n             to enforce its arbitration award or seek specific performance of such award in a civil court\n             of competent jurisdiction, the prevailing party shall be entitled to reasonable attorney's\n             fees and costs. The application of the United Nations Convention on Contracts for the\n             International Sale of Goods is expressly excluded. You and Licensor expressly waive any rights\n             to a jury trial in any litigation concerning Licensed Software or this License. Any law or\n             regulation that provides that the language of a contract shall be construed against the\n             drafter shall not apply to this License.\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "13.9"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Entire Agreement. This License constitutes the entire agreement between the parties with respect\n             to the subject matter hereof.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "EXHIBIT A\n         The License Notice below must appear in each file of the Source Code of any copy You distribute of the\n         Licensed Software or any Extensions thereto:\n         Unless explicitly acquired and licensed from Licensor under another license, the contents of this file\n         are subject to the Reciprocal Public License (\"RPL\") Version 1.5, or subsequent versions as allowed by\n         the RPL, and You may not copy or use this file in either source code or executable form, except in\n         compliance with the terms and conditions of the RPL.\n         All software distributed under the RPL is provided strictly on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY\n         KIND, EITHER EXPRESS OR IMPLIED, AND LICENSOR HEREBY DISCLAIMS ALL SUCH WARRANTIES, INCLUDING WITHOUT\n         LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, QUIET ENJOYMENT, OR\n         NON-INFRINGEMENT. See the RPL for specific language governing rights and limitations under the\n         RPL.\n         EXHIBIT B\n         The User-Visible Attribution Notice below, when provided, must appear in each user-visible display as\n         defined in Section 6.4 (d):"}}]