[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nRicoh Source Code Public License\nVersion 1.0\n"}]}, {"tag": "text", "content": "\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDefinitions.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means each entity that creates or contributes to the creation of Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor Version\" means the combination of the Original Code, prior Modifications used by a\nContributor, and the Modifications made by that particular Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Electronic Distribution Mechanism\" means a website or any other mechanism generally accepted in\nthe software development community for the electronic transfer of data.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Executable Code\" means Governed Code in any form other than Source Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Governed Code\" means the Original Code or Modifications or the combination of the Original Code\nand Modifications, in each case including portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work which combines Governed Code or portions thereof with code not\ngoverned by the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Licensable\" means the right to grant, to the maximum extent possible, whether at the time of the\ninitial grant or subsequently acquired, any and all of the rights conveyed herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"License\" means this document.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" means any addition to or deletion from the substance or structure of either the\nOriginal Code or any previous Modifications. When Governed Code is released as a series of\nfiles, a Modification is:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny addition to or deletion from the contents of a file containing Original Code or previous\nModifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAny new file that contains any part of the Original Code or previous Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Code\" means the \"Platform for Information Applications\" Source Code as released under\nthis License by RSV.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.11"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Patent Claims\" means any patent claim(s), now owned or hereafter acquired, including without\nlimitation, method, process, and apparatus claims, in any patent Licensable by the grantor of\na license thereto.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"RSV\" means Ricoh Silicon Valley, Inc., a California corporation with offices at 2882 Sand Hill\nRoad, Suite 115, Menlo Park, CA 94025-7022.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" means the preferred form of the Governed Code for making modifications to it,\nincluding all modules it contains, plus any associated interface definition files, scripts\nused to control compilation and installation of Executable Code, or a list of source code\ndifferential comparisons against either the Original Code or another well known, available\nGoverned Code of the Contributor's choice. The Source Code can be in a compressed or archival\nform, provided the appropriate decompression or de-archiving software is widely available for\nno charge.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.14."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" means an individual or a legal entity exercising rights under, and complying with all of\nthe terms of, this License or a future version of this License issued under Section 6.1. For\nlegal entities, \"You\" includes any entity which controls, is controlled by, or is under common\ncontrol with You. For purposes of this definition, \"control\" means (a) the power, direct or\nindirect, to cause the direction or management of such entity, whether by contract or\notherwise, or (b) ownership of fifty percent (50%) or more of the outstanding shares or\nbeneficial ownership of such entity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSource Code License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGrant from RSV. RSV hereby grants You a worldwide, royalty-free, non-exclusive license, subject\nto third party intellectual property claims:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto use, reproduce, modify, create derivative works of, display, perform, sublicense and\ndistribute the Original Code (or portions thereof) with or without Modifications, or as part\nof a Larger Work; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by the making, using or selling of Original Code, to make, have\nmade, use, practice, sell, and offer for sale, and/or otherwise dispose of the Original Code\n(or portions thereof).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor Grant. Each Contributor hereby grants You a worldwide, royalty-free, non-exclusive\nlicense, subject to third party intellectual property claims:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nto use, reproduce, modify, create derivative works of, display, perform, sublicense and\ndistribute the Modifications created by such Contributor (or portions thereof) either on an\nunmodified basis, with other Modifications, as Governed Code or as part of a Larger Work;\nand\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nunder Patent Claims infringed by the making, using, or selling of Modifications made by that\nContributor either alone and/or in combination with its Contributor Version (or portions of\nsuch combination), to make, use, sell, offer for sale, have made, and/or otherwise dispose of:\n(i) Modifications made by that Contributor (or portions thereof); and (ii) the combination of\nModifications made by that Contributor with its Contributor Version (or portions of such\ncombination).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution Obligations.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nApplication of License. The Modifications which You create or to which You contribute are\ngoverned by the terms of this License, including without limitation Section 2.2. The Source\nCode version of Governed Code may be distributed only under the terms of this License or a\nfuture version of this License released under Section 6.1, and You must include a copy of this\nLicense with every copy of the Source Code You distribute. You may not offer or impose any\nterms on any Source Code version that alters or restricts the applicable version of this\nLicense or the recipients' rights hereunder. However, You may include an additional document\noffering the additional rights described in Section 3.5.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAvailability of Source Code. Any Modification which You create or to which You contribute must be\nmade available in Source Code form under the terms of this License either on the same media as\nan Executable Code version or via an Electronic Distribution Mechanism to anyone to whom you\nmade an Executable Code version available; and if made available via an Electronic\nDistribution Mechanism, must remain available for at least twelve (12) months after the date\nit initially became available, or at least six (6) months after a subsequent version of that\nparticular Modification has been made available to such recipients. You are responsible for\nensuring that the Source Code version remains available even if the Electronic Distribution\nMechanism is maintained by a third party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDescription of Modifications. You must cause all Governed Code to which you contribute to contain\na file documenting the changes You made to create that Governed Code and the date of any\nchange. You must include a prominent statement that the Modification is derived, directly or\nindirectly, from Original Code provided by RSV and including the name of RSV in (a) the Source\nCode, and (b) in any notice in an Executable Code version or related documentation in which\nYou describe the origin or ownership of the Governed Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIntellectual Property Matters.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThird Party Claims. If You have knowledge that a party claims an intellectual property\nright in particular functionality or code (or its utilization under this License), you must\ninclude a text file with the source code distribution titled \"LEGAL\" which describes the claim\nand the party making the claim in sufficient detail that a recipient will know whom to\ncontact. If you obtain such knowledge after You make Your Modification available as described\nin Section 3.2, You shall promptly modify the LEGAL file in all copies You make available\nthereafter and shall take other steps (such as notifying RSV and appropriate mailing lists or\nnewsgroups) reasonably calculated to inform those who received the Governed Code that new\nknowledge has been obtained. In the event that You are a Contributor, You represent that,\nexcept as disclosed in the LEGAL file, your Modifications are your original creations and, to\nthe best of your knowledge, no third party has any claim (including but not limited to\nintellectual property claims) relating to your Modifications. You represent that the LEGAL\nfile includes complete details of any license or other restriction associated with any part of\nyour Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.4.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nContributor APIs. If Your Modification is an application programming interface and You own\nor control patents which are reasonably necessary to implement that API, you must also include\nthis information in the LEGAL file.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRequired Notices. You must duplicate the notice in Exhibit A in each file of the Source Code, and\nthis License in any documentation for the Source Code, where You describe recipients' rights\nrelating to Governed Code. If You created one or more Modification(s), You may add your name\nas a Contributor to the notice described in Exhibit A. If it is not possible to put such\nnotice in a particular Source Code file due to its structure, then you must include such\nnotice in a location (such as a relevant directory file) where a user would be likely to look\nfor such a notice. You may choose to offer, and to charge a fee for, warranty, support,\nindemnity or liability obligations to one or more recipients of Governed Code. However, You\nmay do so only on Your own behalf, and not on behalf of RSV or any Contributor. You must make\nit absolutely clear than any such warranty, support, indemnity or liability obligation is\noffered by You alone, and You hereby agree to indemnify RSV and every Contributor for any\nliability incurred by RSV or such Contributor as a result of warranty, support, indemnity or\nliability terms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDistribution of Executable Code Versions. You may distribute Governed Code in Executable Code\nform only if the requirements of Section 3.1-3.5 have been met for that Governed Code, and if\nYou include a prominent notice stating that the Source Code version of the Governed Code is\navailable under the terms of this License, including a description of how and where You have\nfulfilled the obligations of Section 3.2. The notice must be conspicuously included in any\nnotice in an Executable Code version, related documentation or collateral in which You\ndescribe recipients' rights relating to the Governed Code. You may distribute the Executable\nCode version of Governed Code under a license of Your choice, which may contain terms\ndifferent from this License, provided that You are in compliance with the terms of this\nLicense and that the license for the Executable Code version does not attempt to limit or\nalter the recipient's rights in the Source Code version from the rights set forth in this\nLicense. If You distribute the Executable Code version under a different license You must make\nit absolutely clear that any terms which differ from this License are offered by You alone,\nnot by RSV or any Contributor. You hereby agree to indemnify RSV and every Contributor for any\nliability incurred by RSV or such Contributor as a result of any such terms You offer.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3.7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works. You may create a Larger Work by combining Governed Code with other code not\ngoverned by the terms of this License and distribute the Larger Work as a single product. In\nsuch a case, You must make sure the requirements of this License are fulfilled for the\nGoverned Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nInability to Comply Due to Statute or Regulation.\nIf it is impossible for You to comply with any of theterms of this License with respect to\nsome or all of the Governed Code due to statute or regulation then You must: (a)\ncomply with the terms of this License to the maximum extent possible; and (b) describe\nthe limitations and the code they affect. Such description must be included in the\nLEGAL file described in Section 3.4 and must be included with all distributions of the\nSource Code. Except to the extent prohibited by statute or regulation, such\ndescription must be sufficiently detailed for a recipient of ordinary skill to be able\nto understand it.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademark Usage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdvertising Materials. All advertising materials mentioning features or use of the Governed Code\nmust display the following acknowledgement: \"This product includes software developed by Ricoh\nSilicon Valley, Inc.\"\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEndorsements. The names \"Ricoh,\" \"Ricoh Silicon Valley,\" and \"RSV\" must not be used to endorse or\npromote Contributor Versions or Larger Works without the prior written permission of RSV.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nProduct Names. Contributor Versions and Larger Works may not be called \"Ricoh\" nor may the word\n\"Ricoh\" appear in their names without the prior written permission of RSV.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNew Versions. RSV may publish revised and/or new versions of the License from time to time. Each\nversion will be given a distinguishing version number.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of New Versions. Once Governed Code has been published under a particular version of the\nLicense, You may always continue to use it under the terms of that version. You may also\nchoose to use such Governed Code under the terms of any subsequent version of the License\npublished by RSV. No one other than RSV has the right to modify the terms applicable to\nGoverned Code created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDisclaimer of Warranty.\nGOVERNED CODE IS PROVIDED UNDER THIS LICENSE ON AN \"AS IS\" BASIS, WITHOUT WARRANTY OF ANY\nKIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, WITHOUT LIMITATION, WARRANTIES THAT THE\nGOVERNED CODE IS FREE OF DEFECTS, MERCHANTABLE, FIT FOR A PARTICULAR PURPOSE OR\nNON-INFRINGING. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE GOVERNED CODE\nIS WITH YOU. SHOULD ANY GOVERNED CODE PROVE DEFECTIVE IN ANY RESPECT, YOU (NOT RSV OR\nANY OTHER CONTRIBUTOR) ASSUME THE COST OF ANY NECESSARY SERVICING, REPAIR OR\nCORRECTION. THIS DISCLAIMER OF WARRANTY CONSTITUTES AN ESSENTIAL PART OF THIS LICENSE.\nNO USE OF ANY GOVERNED CODE IS AUTHORIZED HEREUNDER EXCEPT UNDER THIS DISCLAIMER.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nThis License and the rights granted hereunder will terminate automatically if You fail to comply\nwith terms herein and fail to cure such breach within 30 days of becoming aware of the breach.\nAll sublicenses to the Governed Code which are properly granted shall survive any termination\nof this License. Provisions which, by their nature, must remain in effect beyond the\ntermination of this License shall survive.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You initiate patent infringement litigation against RSV or a Contributor (RSV or the\nContributor against whom You file such action is referred to as \"Participant\") alleging\nthat:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nsuch Participant's Original Code or Contributor Version directly or indirectly infringes any\npatent, then any and all rights granted by such Participant to You under Sections 2.1 and/or\n2.2 of this License shall, upon 60 days notice from Participant terminate prospectively,\nunless if within 60 days after receipt of notice You either: (i) agree in writing to pay\nParticipant a mutually agreeable reasonable royalty for Your past and future use of the\nOriginal Code or the Modifications made by such Participant, or (ii) withdraw Your litigation\nclaim with respect to the Original Code or the Contributor Version against such Participant.\nIf within 60 days of notice, a reasonable royalty and payment arrangement are not mutually\nagreed upon in writing by the parties or the litigation claim is not withdrawn, the rights\ngranted by Participant to You under Sections 2.1 and/or 2.2 automatically terminate at the\nexpiration of the 60 day notice period specified above.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nany software, hardware, or device provided to You by the Participant, other than such\nParticipant's Original Code or Contributor Version, directly or indirectly infringes any\npatent, then any rights granted to You by such Participant under Sections 2.1(b) and 2.2(b)\nare revoked effective as of the date You first made, used, sold, distributed, or had made,\nOriginal Code or the Modifications made by that Participant.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIf You assert a patent infringement claim against Participant alleging that such Participant's\nOriginal Code or Contributor Version directly or indirectly infringes any patent where such\nclaim is resolved (such as by license or settlement) prior to the initiation of patent\ninfringement litigation, then the reasonable value of the licenses granted by such Participant\nunder Sections 2.1 or 2.2 shall be taken into account in determining the amount or value of\nany payment or license.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8.4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIn the event of termination under Sections 8.1 or 8.2 above, all end user license agreements\n(excluding distributors and resellers) which have been validly granted by You or any\ndistributor hereunder prior to termination shall survive termination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitation of Liability.\nUNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY, WHETHER TORT (INCLUDING NEGLIGENCE),\nCONTRACT, OR OTHERWISE, SHALL RSV, ANY CONTRIBUTOR, OR ANY DISTRIBUTOR OF GOVERNED\nCODE, OR ANY SUPPLIER OF ANY OF SUCH PARTIES, BE LIABLE TO YOU OR ANY OTHER PERSON FOR\nANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES OF ANY CHARACTER\nINCLUDING, WITHOUT LIMITATION, DAMAGES FOR LOSS OF GOODWILL, WORK STOPPAGE, COMPUTER\nFAILURE OR MALFUNCTION, OR ANY AND ALL OTHER COMMERCIAL DAMAGES OR LOSSES, EVEN IF\nSUCH PARTY SHALL HAVE BEEN INFORMED OF THE POSSIBILITY OF SUCH DAMAGES. THIS\nLIMITATION OF LIABILITY SHALL NOT APPLY TO LIABILITY FOR DEATH OR PERSONAL INJURY\nRESULTING FROM SUCH PARTY'S NEGLIGENCE TO THE EXTENT APPLICABLE LAW PROHIBITS SUCH\nLIMITATION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL\nOR CONSEQUENTIAL DAMAGES, SO THAT EXCLUSION AND LIMITATION MAY NOT APPLY TO YOU. TO\nTHE EXTENT THAT ANY EXCLUSION OF DAMAGES ABOVE IS NOT VALID, YOU AGREE THAT IN NO\nEVENT WILL RSV"}, {"tag": "optional", "content": [{"tag": "text", "content": "'"}]}, {"tag": "text", "content": "S LIABILITY UNDER OR RELATED TO THIS AGREEMENT EXCEED FIVE THOUSAND\nDOLLARS ($5,000). THE GOVERNED CODE IS NOT INTENDED FOR USE IN CONNECTION WITH ANY\nNUCLER, AVIATION, MASS TRANSIT OR MEDICAL APPLICATION OR ANY OTHER INHERENTLY\nDANGEROUS APPLICATION THAT COULD RESULT IN DEATH, PERSONAL INJURY, CATASTROPHIC DAMAGE\nOR MASS DESTRUCTION, AND YOU AGREE THAT NEITHER RSV NOR ANY CONTRIBUTOR SHALL HAVE ANY\nLIABILITY OF ANY NATURE AS A RESULT OF ANY SUCH USE OF THE GOVERNED CODE.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nU.S. Government End Users.\nThe Governed Code is a \"commercial item,\" as that term is defined in 48 C.F.R. 2.101 (Oct.\n1995), consisting of \"commercial computer software\" and \"commercial computer software\ndocumentation,\" as such terms are used in 48 C.F.R. 12.212 (Sept. 1995). Consistent\nwith 48 C.F.R. 12.212 and 48 C.F.R. 227.7202-1 through 227.7202-4 (June 1995), all\nU.S. Government End Users acquire Governed Code with only those rights set forth\nherein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous.\nThis License represents the complete agreement concerning subject matter hereof. If any\nprovision of this License is held to be unenforceable, such provision shall be\nreformed only to the extent necessary to make it enforceable. This License shall be\ngoverned by California law provisions (except to the extent applicable law, if any,\nprovides otherwise), excluding its conflict-of-law provisions. The parties submit to\npersonal jurisdiction in California and further agree that any cause of action arising\nunder or related to this Agreement shall be brought in the Federal Courts of the\nNorthern District of California, with venue lying in Santa Clara County, California.\nThe losing party shall be responsible for costs, including without limitation, court\ncosts and reasonable attorney"}, {"tag": "optional", "content": [{"tag": "text", "content": "'"}]}, {"tag": "text", "content": "s fees and expenses. Notwithstanding anything to the\ncontrary herein, RSV may seek injunctive relief related to a breach of this Agreement\nin any court of competent jurisdiction. The application of the United Nations\nConvention on Contracts for the International Sale of Goods is expressly excluded. Any\nlaw or regulation which provides that the language of a contract shall be construed\nagainst the drafter shall not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nResponsibility for Claims.\nExcept in cases where another Contributor has failed to comply with Section 3.4, You are responsible for\ndamages arising, directly or indirectly, out of Your utilization of rights under this License, based\non the number of copies of Governed Code you made available, the revenues you received from utilizing\nsuch rights, and other relevant factors. You agree to work with affected parties to distribute\nresponsibility on an equitable basis.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEXHIBIT A\n\"The contents of this file are subject to the Ricoh Source Code Public License Version 1.0 (the\n\"License\"); you may not use this file except in compliance with the License. You may obtain a copy of\nthe License at http://www.risource.org/RPL\nSoftware distributed under the License is distributed on an \"AS IS\" basis, WITHOUT WARRANTY OF ANY KIND,\neither express or implied. See the License for the specific language governing rights and limitations\nunder the License.\nThis code was initially developed by Ricoh Silicon Valley, Inc. Portions created by Ricoh Silicon Valley,\nInc. are Copyright (C) 1995-1999. All Rights Reserved.\nContributor(s): ______________________________________.\"\n"}]}, {"tag": "text", "content": "\n"}]