{"type": "text", "content": "Copyright Status\n      SAX is free!\n      In fact, it's not possible to own a license to SAX, since it's been placed in the public domain.\n      No Warranty\n      Because SAX is released to the public domain, there is no warranty for the design or for the software\n         implementation, to the extent permitted by applicable law. Except when otherwise stated in writing the\n         copyright holders and/or other parties provide SAX \"as is\" without warranty of any kind, either\n         expressed or implied, including, but not limited to, the implied warranties of merchantability and\n         fitness for a particular purpose. The entire risk as to the quality and performance of SAX is with\n         you. Should SAX prove defective, you assume the cost of all necessary servicing, repair or\n         correction.\n      In no event unless required by applicable law or agreed to in writing will any copyright holder, or any\n         other party who may modify and/or redistribute SAX, be liable to you for damages, including any\n         general, special, incidental or consequential damages arising out of the use or inability to use SAX\n         (including but not limited to loss of data or data being rendered inaccurate or losses sustained by\n         you or third parties or a failure of the SAX to operate with any other programs), even if such holder\n         or other party has been advised of the possibility of such damages.\n      Copyright Disclaimers\n      This page includes statements to that effect by David Megginson, who would have been able to claim\n         copyright for the original work.\n      SAX 1.0\n      Version 1.0 of the Simple API for XML (SAX), created collectively by the membership of the XML-DEV\n         mailing list, is hereby released into the public domain.\n      No one owns SAX: you may use it freely in both commercial and non-commercial applications, bundle it with\n         your software distribution, include it on a CD-ROM, list the source code in a book, mirror the\n         documentation at your own web site, or use it in any other way you see fit.\n      David Megginson, Megginson Technologies Ltd.\n        1998-05-11\n      SAX 2.0\n      I hereby abandon any property rights to SAX 2.0 (the Simple API for XML), and release all of the SAX 2.0\n         source code, compiled code, and documentation contained in this distribution into the Public Domain.\n         SAX comes with NO WARRANTY or guarantee of fitness for any purpose.\n      David Megginson, Megginson Technologies Ltd.\n        2000-05-05"}