[{"type": "optional", "content": {"type": "text", "content": "SCEA Shared Source License 1.0"}}, {"type": "text", "content": "\n      Terms and Conditions:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Definitions:\n          \"Software\" shall mean the software and related documentation, whether in Source or Object Form,\n             made available under this SCEA Shared Source license (\"License\"), that is indicated by a\n             copyright notice file included in the source files or attached or accompanying the source\n             files.\n            \"Licensor\" shall mean Sony Computer Entertainment America, Inc. (herein \"SCEA\")\n            \"Object Code\" or \"Object Form\" shall mean any form that results from translation or\n             transformation of Source Code, including but not limited to compiled object code or\n             conversions to other forms intended for machine execution.\n            \"Source Code\" or \"Source Form\" shall have the plain meaning generally accepted in the\n                 software industry, including but not limited to software source code, documentation\n                 source, header and configuration files.\n            \"You\" or \"Your\" shall mean you as an individual or as a company, or whichever form under which\n             you are exercising rights under this License.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          License Grant.\n          Licensor hereby grants to You, free of charge subject to the terms and conditions of this\n             License, an irrevocable, non-exclusive, worldwide, perpetual, and royalty-free license to use,\n             modify, reproduce, distribute, publicly perform or display the Software in Object or Source\n             Form .\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Right to File for Patent.\n            In exchange for the rights that are granted to You free of charge under this License, You\n                 agree that You will not file for any patent application, seek copyright protection or\n                 take any other action that might otherwise impair the ownership rights in and to the\n                 Software that may belong to SCEA or any of the other contributors/authors of the\n                 Software.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Contributions.\n          SCEA welcomes contributions in form of modifications, optimizations, tools or documentation\n             designed to improve or expand the performance and scope of the Software (collectively\n             \"Contributions\"). Per the terms of this License You are free to modify the Software and those\n             modifications would belong to You. You may however wish to donate Your Contributions to SCEA\n             for consideration for inclusion into the Software. For the avoidance of doubt, if You elect to\n             send Your Contributions to SCEA, You are doing so voluntarily and are giving the Contributions\n             to SCEA and its parent company Sony Computer Entertainment, Inc., free of charge, to use,\n             modify or distribute in any form or in any manner. SCEA acknowledges that if You make a\n             donation of Your Contributions to SCEA, such Contributions shall not exclusively belong to\n             SCEA or its parent company and such donation shall not be to Your exclusion. SCEA, in its sole\n             discretion, shall determine whether or not to include Your donated Contributions into the\n             Software, in whole, in part, or as modified by SCEA. Should SCEA elect to include any such\n             Contributions into the Software, it shall do so at its own risk and may elect to give credit\n             or special thanks to any such contributors in the attached copyright notice. However, if any\n             of Your contributions are included into the Software, they will become part of the Software\n             and will be distributed under the terms and conditions of this License. Further, if Your\n             donated Contributions are integrated into the Software then Sony Computer Entertainment, Inc.\n             shall become the copyright owner of the Software now containing Your contributions and SCEA\n             would be the Licensor.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution in Source Form\n          You may redistribute copies of the Software, modifications or derivatives thereof in Source Code\n             Form, provided that You:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "a."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Include a copy of this License and any copyright notices with source\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "b."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Identify modifications if any were made to the Software\n               "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "c."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n              Include a copy of all documentation accompanying the Software and modifications made by You\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution in Object Form\n          If You redistribute copies of the Software, modifications or derivatives thereof in Object Form\n             only (as incorporated into finished goods, i.e. end user applications) then You will not have\n             a duty to include any copies of the code, this License, copyright notices, other attributions\n             or documentation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          No Warranty\n          THE SOFTWARE IS PROVIDED ON AN \"AS IS\" BASIS, WITHOUT ANY REPRESENTATIONS OR WARRANTIES OF ANY\n             KIND, EITHER EXPRESS OR IMPLIED, INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OF TITLE,\n             NON-INFRINGEMENT, MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. YOU ARE SOLELY\n             RESPONSIBLE FOR DETERMINING THE APPROPRIATENESS OF USING, MODIFYING OR REDISTRIBUTING THE\n             SOFTWARE AND ASSUME ANY RISKS ASSOCIATED WITH YOUR EXERCISE OF PERMISSIONS UNDER THIS\n             LICENSE.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Limitation of Liability\n          UNDER NO CIRCUMSTANCES AND UNDER NO LEGAL THEORY WILL EITHER PARTY BE LIABLE TO THE OTHER PARTY\n             OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, SPECIAL, INCIDENTAL, OR EXEMPLARY\n             DAMAGES WITH RESPECT TO ANY INJURY, LOSS, OR DAMAGE, ARISING UNDER OR IN CONNECTION WITH THIS\n             LETTER AGREEMENT, WHETHER FORESEEABLE OR UNFORESEEABLE, EVEN IF SUCH PARTY HAS BEEN ADVISED OF\n             THE POSSIBILITY OF SUCH INJURY, LOSS, OR DAMAGE. THE LIMITATIONS OF LIABILITY SET FORTH IN\n             THIS SECTION SHALL APPLY TO THE FULLEST EXTENT PERMISSIBLE AT LAW OR ANY GOVERMENTAL\n             REGULATIONS.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "9."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Governing Law and Consent to Jurisdiction\n          This Agreement shall be governed by and interpreted in accordance with the laws of the State of\n             California, excluding that body of law related to choice of laws, and of the United States of\n             America. Any action or proceeding brought to enforce the terms of this Agreement or to\n             adjudicate any dispute arising hereunder shall be brought in the Superior Court of the County\n             of San Mateo, State of California or the United States District Court for the Northern\n             District of California. Each of the parties hereby submits itself to the exclusive\n             jurisdiction and venue of such courts for purposes of any such action. In addition, each party\n             hereby waives the right to a jury trial in any action or proceeding related to this\n             Agreement.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "10."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Copyright Notice for Redistribution of Source Code\n      Copyright "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "2005 Sony Computer Entertainment Inc."}, "pattern": ".+"}, {"type": "text", "content": "\n      Licensed under the SCEA Shared Source License, Version 1.0 (the \"License\"); you may not use this file\n         except in compliance with the License. You may obtain a copy of the License at:\n        http://research.scea.com/scea_shared_source_license.html\n      Unless required by applicable law or agreed to in writing, software distributed under the License is\n         distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n         implied. See the License for the specific language governing permissions and limitations under the\n         License."}]