[{"type": "optional", "content": {"type": "text", "content": "SENDMAIL LICENSE"}}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "The following license terms and conditions apply, unless a redistribution agreement or other license is\n         obtained from Proofpoint, Inc., 892 Ross Street, Sunnyvale, CA, 94089, USA, or by\n         electronic mail at sendmail-license@proofpoint.com.\n         License Terms:"}}, {"type": "text", "content": "\n\n      Use, Modification and Redistribution (including distribution of any modified or derived work) in source\n         and binary forms is permitted only if each of the following conditions is met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions qualify as \"freeware\" or \"Open Source Software\" under one of the following terms:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions are made at no charge beyond the reasonable cost of materials and delivery.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions are accompanied by a copy of the Source Code or by an irrevocable offer to\n             provide a copy of the Source Code for up to three years at the cost of materials and delivery.\n             Such redistributions must allow further use, modification, and redistribution of the Source\n             Code under substantially the same terms as this license. For the purposes of redistribution\n             \"Source Code\" means the complete compilable and linkable source code of sendmail and associated\n             libraries and utilities in the sendmail distribution including all modifications.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of Source Code must retain the copyright notices as they appear in each Source\n             Code file, these license terms, and the disclaimer/limitation of liability set forth as\n             paragraph 6 below.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the Copyright Notice, these license terms, and the\n             disclaimer/limitation of liability set forth as paragraph 6 below, in the documentation and/or\n             other materials provided with the distribution. For the purposes of binary distribution the\n             \"Copyright Notice\" refers to the following language:\n            \"Copyright (c) 1998-2014 Proofpoint, Inc. All rights reserved.\"\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Neither the name of Proofpoint, Inc. nor the University of California nor names of their\n             contributors may be used to endorse or promote products derived from this software without\n             specific prior written permission. The name \"sendmail\" is a trademark of Proofpoint, Inc.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All redistributions must comply with the conditions imposed by the University of California on\n             certain embedded code, which copyright Notice and conditions for redistribution are as\n             follows:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Copyright (c) 1988, 1993 The Regents of the University of California. All rights reserved.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution and use in source and binary forms, with or without modification, are permitted\n             provided that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(i)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the above copyright notice, this list of conditions\n             and the following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(ii)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n             and the following disclaimer in the documentation and/or other materials provided with the\n             distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(iii)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Neither the name of the University nor the names of its contributors may be used to endorse or\n             promote products derived from this software without specific prior written permission.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Disclaimer/Limitation of Liability: THIS SOFTWARE IS PROVIDED BY SENDMAIL, INC. AND CONTRIBUTORS\n             \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n             WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT\n             SHALL SENDMAIL, INC., THE REGENTS OF THE UNIVERSITY OF CALIFORNIA OR CONTRIBUTORS BE LIABLE\n             FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,\n             BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n             PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n             CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT\n             OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "$Revision: 8.23 $, Last updated $Date: 2014-01-26 20:10:01 $, Document 139848.1"}}]