[{"type": "optional", "content": {"type": "text", "content": "Secure Messaging Protocol (SMP) Libraries [ACL, CML, SFL]"}}, {"type": "text", "content": "\n         Distribution Rights\n      All source code for the SMP is being provided at no cost and with\n         no financial limitations regarding its use and distribution.\n         Organizations can use the SMP without paying any royalties or\n         licensing fees. The SMP was originally developed by the U.S.\n         Government. BAE Systems is enhancing and supporting the SMP\n         under contract to the U.S. Government. The U.S. Government is\n         furnishing the SMP software at no cost to the vendor subject\n         to the conditions of the SMP Public License provided with the\n         SMP software.\n      29 May 2002\n      Secure Messaging Protocol (SMP) Public License\n      The United States Government/Department of Defense/National\n         Security Agency/Office of Network Security (collectively \"the\n         U.S. Government\") hereby grants permission to any person\n         obtaining a copy of the SMP source and object files (the \"SMP\n         Software\") and associated documentation files (the \"SMP\n         Documentation\"), or any portions thereof, to do the following,\n         subject to the following license conditions:\n      You may, free of charge and without additional permission from\n         the U.S. Government, use, copy, modify, sublicense and\n         otherwise distribute the SMP Software or components of the SMP\n         Software, with or without modifications developed by you\n         and/or by others.\n      You may, free of charge and without additional permission from\n         the U.S. Government, distribute copies of the SMP\n         Documentation, with or without modifications developed by you\n         and/or by others, at no charge or at a charge that covers the\n         cost of reproducing such copies, provided that this SMP Public\n         License is retained.\n      Furthermore, if you distribute the SMP Software or parts of the\n         SMP Software, with or without modifications developed by you\n         and/or others, then you must either make available the source\n         code to all portions of the SMP Software (exclusive of any\n         modifications made by you and/or by others) upon request, or\n         instead you may notify anyone requesting the SMP Software\n         source code that it is freely available from the U.S.\n         Government.\n      Transmission of this SMP Public License must accompany whatever\n         portions of the SMP Software you redistribute.\n      The SMP Software is provided without warranty or guarantee of any\n         nature, express or implied, including without limitation the\n         warranties of merchantability and fitness for a particular\n         purpose.\n      The U.S. Government cannot be held liable for any damages either\n         directly or indirectly caused by the use of the SMP\n         Software.\n      It is not permitted to copy, sublicense, distribute or transfer\n         any of the SMP Software except as expressly indicated herein.\n         Any attempts to do otherwise will be considered a violation of\n         this License and your rights to the SMP Software will be\n         voided.\n      The SMP uses the Enhanced SNACC (eSNACC) Abstract Syntax Notation\n         One (ASN.1) C++ Library to ASN.1 encode and decode\n         security-related data objects.  The eSNACC ASN.1 C++ Library\n         is covered by the ENHANCED SNACC SOFTWARE PUBLIC LICENSE.\n         None of the GNU public licenses apply to the eSNACC ASN.1 C++\n         Library.  The eSNACC Compiler is not distributed as part of\n         the SMP.\n       "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright © 1997-2002 National Security Agency"}, "pattern": ".{0,5000}"}]