[{"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 1995 Tatu Ylonen <ylo@cs.hut.fi>, Espoo, Finland\n                               All rights reserved"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n        As far as I am concerned, the code I have written for this software\n        can be used freely for any purpose.  Any derived versions of this\n        software must be clearly marked as such, and if the derived work is\n        incompatible with the protocol description in the RFC file, it must be\n        called by a name other than \"ssh\" or \"Secure Shell\".\n\n        [Tatu continues]\n\n        However, I am not implying to give any licenses to any patents or\n        copyrights held by third parties, and the software includes parts that\n        are not under my direct control.  As far as I know, all included\n        source code is used in accordance with the relevant license agreements\n        and can be used freely for any purpose (the GNU license being the most\n        restrictive); see below for details.\n\n        [However, none of that term is relevant at this point in time.  All of\n        these restrictively licenced software components which he talks about\n        have been removed from OpenSSH, i.e.,\n\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " RSA is no longer included, found in the OpenSSL library\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " IDEA is no longer included, its use is deprecated\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " DES is now external, in the OpenSSL library\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " GMP is no longer used, and instead we call BN code from OpenSSL\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " Zlib is now external, in a library\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " The make-ssh-known-hosts script is no longer included\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " TSS has been removed\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " MD5 is now external, in the OpenSSL library\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " RC4 support has been replaced with ARC4 support from OpenSSL\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "-"}, "pattern": ".{0,20}"}, {"type": "text", "content": " Blowfish is now external, in the OpenSSL library\n\n    [The licence continues]\n\n    Note that any information and cryptographic algorithms used in this\n    software are publicly available on the Internet and at any major\n    bookstore, scientific library, and patent office worldwide.  More\n    information can be found e.g. at \"http://www.cs.hut.fi/crypto\".\n\n    The legal status of this program is some combination of all these\n    permissions and restrictions.  Use only at your own responsibility.\n    You will be responsible for any legal consequences yourself; I am not\n    making any claims whether possessing or using this is legal or not in\n    your country, and I am not taking any responsibility on your behalf.\n\n\n\tNO WARRANTY\n\n    BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\n    FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\n    OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\n    PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\n    OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\n    TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\n    PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\n    REPAIR OR CORRECTION.\n\n    IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n    WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n    REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\n    INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\n    OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\n    TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\n    YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\n    PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES."}]