[{"type": "optional", "content": {"type": "text", "content": "The TAPR Open Hardware License\n                Version 1.0 (May 25, 2007)"}}, {"type": "text", "content": "\n            "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright 2007 TAPR - http://www.tapr.org/OHL"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n            PREAMBLE\n            Open Hardware is a thing - a physical artifact, either electrical or\nmechanical - whose design information is available to, and usable by,\nthe public in a way that allows anyone to make, modify, distribute, and\nuse that thing.  In this preface, design information is called\n\"documentation\" and things created from it are called \"products.\"\n            The TAPR Open Hardware License (\"OHL\") agreement provides a legal\nframework for Open Hardware projects.  It may be used for any kind of\nproduct, be it a hammer or a computer motherboard, and is TAPR's\ncontribution to the community; anyone may use the OHL for their Open\nHardware project.\n            Like the GNU General Public License, the OHL is designed to guarantee\nyour freedom to share and to create.  It forbids anyone who receives\nrights under the OHL to deny any other licensee those same rights to\ncopy, modify, and distribute documentation, and to make, use and\ndistribute products based on that documentation.\n            Unlike the GPL, the OHL is not primarily a copyright license.  While\ncopyright protects documentation from unauthorized copying, modification,\nand distribution, it has little to do with your right to make, distribute,\nor use a product based on that documentation.  For better or worse, patents\nplay a significant role in those activities.  Although it does not prohibit\nanyone from patenting inventions embodied in an Open Hardware design, and\nof course cannot prevent a third party from enforcing their patent rights,\nthose who benefit from an OHL design may not bring lawsuits claiming that\ndesign infringes their patents or other intellectual property.\n            The OHL addresses unique issues involved in the creation of tangible,\nphysical things, but does not cover software, firmware, or code loaded\ninto programmable devices.  A copyright-oriented license such as the GPL\nbetter suits these creations.\n            How can you use the OHL, or a design based upon it?  While the terms and\nconditions below take precedence over this preamble, here is a summary:\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may modify the documentation and make products based upon it.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may use products for any legal purpose without limitation.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute unmodified documentation, but you must include the\ncomplete package as you received it.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute products you make to third parties, if you either\ninclude the documentation on which the product is based, or make it\navailable without charge for at least three years to anyone who requests it.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute modified documentation or products based on it, if\nyou:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  License your modifications under the OHL.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Include those modifications, following the requirements stated\n       below.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Attempt to send the modified documentation by email to any of the\ndevelopers who have provided their email address.  This is a good\n       faith obligation - if the email fails, you need do nothing more\n       and may go on with your distribution.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  If you create a design that you want to license under the OHL, you\nshould:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Include this document in a file named LICENSE (with the appropriate\n       extension) that is included in the documentation package.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  If the file format allows, include a notice like \"Licensed under\n       the TAPR Open Hardware License (www.tapr.org/OHL)\" in each\n       documentation file.  While not required, you should also include\n       this notice on printed circuit board artwork and the product\n       itself; if space is limited the notice can be shortened or\n       abbreviated.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Include a copyright notice in each file and on printed circuit\n       board artwork.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  If you wish to be notified of modifications that others may make,\n       include your email address in a file named \"CONTRIB.TXT\" or\n       something similar.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Any time the OHL requires you to make documentation available to\nothers, you must include all the materials you received from the\nupstream licensors.  In addition, if you have modified the\ndocumentation:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You must identify the modifications in a text file (preferably\n       named \"CHANGES.TXT\") that you include with the documentation.\n       That file must also include a statement like \"These modifications\n       are licensed under the TAPR Open Hardware License.\"\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": " You must include any new files you created, including any\n       manufacturing files (such as Gerber files) you create in the\n       course of making products.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": " You must include both \"before\" and \"after\" versions of all files\n       you modified.\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": " You may include files in proprietary formats, but you must also\n       include open format versions (such as Gerber, ASCII, Postscript,\n       or PDF) if your tools can create them.\n            TERMS AND CONDITIONS\n            1.   Introduction\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  This Agreement governs how you may use, copy, modify, and\ndistribute Documentation, and how you may make, have made, and\ndistribute Products based on that Documentation.  As used in this\nAgreement, to \"distribute\" Documentation means to directly or indirectly\nmake copies available to a third party, and to \"distribute\" Products\nmeans to directly or indirectly give, loan, sell or otherwise transfer\n                            them to a third party.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  \"Documentation\" includes:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " schematic diagrams;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " circuit or circuit board layouts, including Gerber and other\n                data files used for manufacture;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " mechanical drawings, including CAD, CAM, and other data files\n         used for manufacture;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " flow charts and descriptive text; and\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(e)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " other explanatory material.\n                    Documentation may be in any tangible or intangible form of expression,\nincluding but not limited to computer files in open or proprietary\n    formats and representations on paper, film, or other media.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  \"Products\" include:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " circuit boards, mechanical assemblies, and other physical parts\n    and components;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " assembled or partially assembled units (including components\n        and subassemblies); and\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " parts and components combined into kits intended for assembly\n        by others;\n    which are based in whole or in part on the Documentation.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  This Agreement applies to any Documentation which contains a\nnotice stating it is subject to the TAPR Open Hardware License, and to\nall Products based in whole or in part on that Documentation.  If\nDocumentation is distributed in an archive (such as a \"zip\" file) which\nincludes this document, all files in that archive are subject to this\nAgreement unless they are specifically excluded.  Each person who\ncontributes content to the Documentation is referred to in this\n    Agreement as a \"Licensor.\"\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.5"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  By (a) using, copying, modifying, or distributing the\nDocumentation, or (b) making or having Products made or distributing\nthem, you accept this Agreement, agree to comply with its terms, and\nbecome a \"Licensee.\"  Any activity inconsistent with this Agreement will\nautomatically terminate your rights under it (including the immunities\nfrom suit granted in Section 2), but the rights of others who have\nreceived Documentation, or have obtained Products, directly or\nindirectly from you will not be affected so long as they fully comply\nwith it themselves.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1.6"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  This Agreement does not apply to software, firmware, or code\nloaded into programmable devices which may be used in conjunction with\nDocumentation or Products.  Such software is subject to the license\nterms established by its copyright holder(s).\n            2.   Patents\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  Each Licensor grants you, every other Licensee, and every\npossessor or user of Products a perpetual, worldwide, and royalty-free\nimmunity from suit under any patent, patent application, or other\nintellectual property right which he or she controls, to the extent\nnecessary to make, have made, possess, use, and distribute Products.\nThis immunity does not extend to infringement arising from modifications\nsubsequently made by others.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  If you make or have Products made, or distribute Documentation\nthat you have modified, you grant every Licensor, every other Licensee,\nand every possessor or user of Products a perpetual, worldwide, and\nroyalty-free immunity from suit under any patent, patent application, or\nother intellectual property right which you control, to the extent\nnecessary to make, have made, possess, use, and distribute Products.\nThis immunity does not extend to infringement arising from modifications\nsubsequently made by others.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  To avoid doubt, providing Documentation to a third party for the\nsole purpose of having that party make Products on your behalf is not\nconsidered \"distribution,\"\\\" and a third party's act of making Products\nsolely on your behalf does not cause that party to grant the immunity\ndescribed in the preceding paragraph.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  These grants of immunity are a material part of this Agreement,\nand form a portion of the consideration given by each party to the\nother.  If any court judgment or legal agreement prevents you from\ngranting the immunity required by this Section, your rights under this\nAgreement will terminate and you may no longer use, copy, modify or\ndistribute the Documentation, or make, have made, or distribute\nProducts.\n            3.   Modifications\n            You may modify the Documentation, and those modifications will become\npart of the Documentation.  They are subject to this Agreement, as are\nProducts based in whole or in part on them.  If you distribute the\nmodified Documentation, or Products based in whole or in part upon it,\nyou must email the modified Documentation in a form compliant with\nSection 4 to each Licensor who has provided an email address with the\nDocumentation.  Attempting to send the email completes your obligations\nunder this Section and you need take no further action if any address\nfails.\n            4.   Distributing Documentation\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute unmodified copies of the Documentation in its\nentirety in any medium, provided that you retain all copyright and other\nnotices (including references to this Agreement) included by each\nLicensor, and include an unaltered copy of this Agreement.\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute modified copies of the Documentation if you\ncomply with all the requirements of the preceding paragraph and:\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " include a prominent notice in an ASCII or other open format\n         file identifying those elements of the Documentation that you\n         changed, and stating that the modifications are licensed under\n        the terms of this Agreement;\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " include all new documentation files that you create, as well as\n         both the original and modified versions of each file you change\n         (files may be in your development tool's native file format,\n         but if reasonably possible, you must also include open format,\n         such as Gerber, ASCII, Postscript, or PDF, versions);\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(c)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " do not change the terms of this Agreement with respect to\n         subsequent licensees; and\n                        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(d)"}, "pattern": ".{0,20}"}, {"type": "text", "content": " if you make or have Products made, include in the Documentation\n         all elements reasonably required to permit others to make\n         Products, including Gerber, CAD/CAM and other files used for\n        manufacture.\n            5.   Making Products\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may use the Documentation to make or have Products made,\nprovided that each Product retains any notices included by the Licensor\n(including, but not limited to, copyright notices on circuit boards).\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You may distribute Products you make or have made, provided that\nyou include with each unit a copy of the Documentation in a form\nconsistent with Section 4.  Alternatively, you may include either (i) an\noffer valid for at least three years to provide that Documentation, at\nno charge other than the reasonable cost of media and postage, to any\nperson who requests it; or (ii) a URL where that Documentation may be\ndownloaded, available for at least three years after you last distribute\nthe Product.\n                6.   NEW LICENSE VERSIONS\n                TAPR may publish updated versions of the OHL which retain the same\ngeneral provisions as the present version, but differ in detail to\naddress new problems or concerns, and carry a distinguishing version\nnumber.  If the Documentation specifies a version number which applies\nto it and \"any later version\", you may choose either that version or any\nlater version published by TAPR.  If the Documentation does not specify\na version number, you may choose any version ever published by TAPR.\nTAPR owns the copyright to the OHL, but grants permission to any person\nto copy, distribute, and use it in unmodified form.\n                7.   WARRANTY AND LIABILITY LIMITATIONS\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.1"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  THE DOCUMENTATION IS PROVIDED ON AN\"AS-IS\" BASIS WITHOUT\nWARRANTY OF ANY KIND, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  ALL\nWARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND\nTITLE, ARE HEREBY EXPRESSLY DISCLAIMED.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.2"}, "pattern": ".{0,20}"}, {"type": "text", "content": " IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW WILL ANY LICENSOR\nBE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, CONSEQUENTIAL, PUNITIVE, OR EXEMPLARY DAMAGES ARISING OUT OF\nTHE USE OF, OR INABILITY TO USE, THE DOCUMENTATION OR PRODUCTS,\nINCLUDING BUT NOT LIMITED TO CLAIMS OF INTELLECTUAL PROPERTY\nINFRINGEMENT OR LOSS OF DATA, EVEN IF THAT PARTY HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.3"}, "pattern": ".{0,20}"}, {"type": "text", "content": " You agree that the foregoing limitations are reasonable due to\nthe non-financial nature of the transaction represented by this\nAgreement, and acknowledge that were it not for these limitations, the\nLicensor(s) would not be willing to make the Documentation available to\nyou.\n                    "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7.4"}, "pattern": ".{0,20}"}, {"type": "text", "content": "  You agree to defend, indemnify, and hold each Licensor harmless\nfrom any claim brought by a third party alleging any defect in the\ndesign, manufacture, or operation of any Product which you make, have\nmade, or distribute pursuant to this Agreement.\n                ####"}]