[{"type": "text", "content": "  "}, {"type": "optional", "content": {"type": "text", "content": " \nThe TMate Open Source License.\n\n      "}}, {"type": "text", "content": "\n       "}, {"type": "optional", "content": {"type": "text", "content": " \nThis license applies to all portions of TMate SVNKit library, which are not externally-maintained\n         libraries (e.g. Ganymed SSH library).\n\n          \nAll the source code and compiled classes in package org.tigris.subversion.javahl except SvnClient class\n         are covered by the license in JAVAHL-LICENSE file\n\n      "}}, {"type": "text", "content": "\n       "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": " \nCopyright (c) 2004-2012 TMate Software. All rights reserved.\n\n      "}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n       \nRedistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n\n       \n "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions of source code must retain the above copyright notice, this list of conditions\n             and the following disclaimer.\n        \n        \n "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of conditions\n             and the following disclaimer in the documentation and/or other materials provided with the\n             distribution.\n        \n        \n "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in any form must be accompanied by information on how to obtain complete source\n             code for the software that uses SVNKit and any accompanying software that uses the software\n             that uses SVNKit. The source code must either be included in the distribution or be available\n             for no more than the cost of distribution plus a nominal fee, and must be freely\n             redistributable under reasonable conditions. For an executable file, complete source code\n             means the source code for all modules it contains. It does not include source code for modules\n             or files that typically accompany the major components of the operating system on which the\n             executable file runs.\n        \n        \n "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "*"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistribution in any form without redistributing source code for software that uses SVNKit is\n             possible only when such redistribution is explictly permitted by TMate Software. Please,\n             contact TMate Software at support@svnkit.com to get such permission.\n        \n      \n       \nTHIS SOFTWARE IS PROVIDED BY TMATE SOFTWARE ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,\n         BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\n         NON-INFRINGEMENT, ARE DISCLAIMED.\n\n       \nIN NO EVENT SHALL TMATE SOFTWARE BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n         CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n         LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n         LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\n         IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n    "}]