[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nTORQUE v2.5+ Software License v1.1\n"}]}, {"type": "text", "content": "\n"}, {"type": "var", "name": "copyright", "content": [{"type": "text", "content": "\nCopyright (c) 2010-2011 Adaptive Computing Enterprises, Inc. All rights reserved.\n"}], "pattern": ".{0,5000}"}, {"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nUse this license to use or redistribute the TORQUE software v2.5+ and later versions. For free support for\nTORQUE users, questions should be emailed to the community of TORQUE users at\ntorqueusers@supercluster.org. Users can also subscribe to the user mailing list at\nhttp://www.supercluster.org/mailman/listinfo/torqueusers. Customers using TORQUE that also are licensed\nusers of Moab branded software from Adaptive Computing Inc. can get TORQUE support from Adaptive Computing\nvia:\nEmail: torque-support@adaptivecomputing.com.\nPhone: (801) 717-3700\nWeb: www.adaptivecomputing.com www.clusterresources.com\n"}]}, {"type": "text", "content": "\nThis license covers use of the TORQUE v2.5 software (the \"Software\") at your site or location, and, for\ncertain users, redistribution of the Software to other sites and locations1. Later versions of TORQUE are\nalso covered by this license. Use and redistribution of TORQUE v2.5 in source and binary forms, with or\nwithout modification, are permitted provided that all of the following conditions are met.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny Redistribution of source code must retain the above copyright notice and the acknowledgment\ncontained in paragraph 5, this list of conditions and the disclaimer contained in paragraph 5.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny Redistribution in binary form must reproduce the above copyright notice and the acknowledgment\ncontained in paragraph 4, this list of conditions and the disclaimer contained in paragraph 5 in\nthe documentation and/or other materials provided with the distribution.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRedistributions in any form must be accompanied by information on how to obtain complete source code\nfor TORQUE and any modifications and/or additions to TORQUE. The source code must either be\nincluded in the distribution or be available for no more than the cost of distribution plus a\nnominal fee, and all modifications and additions to the Software must be freely redistributable by\nany party (including Licensor) without restriction.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAll advertising materials mentioning features or use of the Software must display the following\nacknowledgment:\n\"TORQUE is a modification of OpenPBS which was developed by NASA Ames Research Center, Lawrence\nLivermore National Laboratory, and Veridian TORQUE Open Source License v1.1. 1 Information\nSolutions, Inc. Visit www.clusterresources.com/products/ for more information about TORQUE\nand to download TORQUE. For information about Moab branded products and so receive support\nfrom Adaptive Computing for TORQUE, see www.adaptivecomputing.com.”\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nDISCLAIMER OF WARRANTY THIS SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND. ANY EXPRESS OR\nIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT ARE EXPRESSLY DISCLAIMED. IN NO EVENT SHALL\nADAPTIVE COMPUTING ENTERPRISES, INC. CORPORATION, ITS AFFILIATED COMPANIES, OR THE U.S. GOVERNMENT\nOR ANY OF ITS AGENCIES BE LIABLE FOR ANY DIRECT OR INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\nCONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\nARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH\nDAMAGE.\nThis license will be governed by the laws of Utah, without reference to its choice of law rules.\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nNote 1: TORQUE is developed from an earlier version v2.3 of OpenPBS. TORQUE has been developed beyond OpenPBS\nv2.3. The OpenPBS v2.3 license and OpenPBS software can be obtained at:\nhttp://www.pbsworks.com/ResLibSearchResult.aspx?keywords=openpbs&industry=All&pro\nduct_service=All&category=Free%20Software%20Downloads&order_by=title. Users of TORQUE\nshould comply with the TORQUE license as well as the OpenPBS license.\n"}]}, {"type": "text", "content": "\n"}]