[{"type": "optional", "content": {"type": "text", "content": "UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE"}}, {"type": "text", "content": "\n            Unicode Data Files include all data files under the directories\n         http://www.unicode.org/Public/,\n         http://www.unicode.org/reports/,\n         http://www.unicode.org/cldr/data/,\n         http://source.icu-project.org/repos/icu/,\n                "}, {"type": "optional", "content": {"type": "text", "content": "http://www.unicode.org/ivd/data/,"}}, {"type": "text", "content": " and\n         http://www.unicode.org/utility/trac/browser/.\n            Unicode Data Files do not include PDF online code charts under\n         the directory http://www.unicode.org/Public/.\n            Software includes any source code published in the Unicode\n         Standard or under the directories\n         http://www.unicode.org/Public/,\n         http://www.unicode.org/reports/,\n         http://www.unicode.org/cldr/data/,\n         http://source.icu-project.org/repos/icu/, and\n         http://www.unicode.org/utility/trac/browser/.\n            NOTICE TO USER: Carefully read the following legal agreement. BY\n         DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE\n         INC.'S DATA FILES (\"DATA FILES\"), AND/OR SOFTWARE\n         (\"SOFTWARE\"), YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND\n         BY, ALL OF THE TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU\n         DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR\n         USE THE DATA FILES OR SOFTWARE.\n            COPYRIGHT AND PERMISSION NOTICE\n            "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright © 1991-2016 Unicode, Inc. All rights reserved.\n         Distributed under the Terms of Use in\n         http://www.unicode.org/copyright.html."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n            Permission is hereby granted, free of charge, to any person\n         obtaining a copy of the Unicode data files and any associated\n         documentation (the \"Data Files\") or Unicode software and any\n         associated documentation (the \"Software\") to deal in the Data\n         Files or Software without restriction, including without\n         limitation the rights to use, copy, modify, merge, publish,\n         distribute, and/or sell copies of the Data Files or Software,\n         and to permit persons to whom the Data Files or Software are\n         furnished to do so, provided that either\n            "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(a)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          this copyright and permission notice appear with all\n             copies of the Data Files or Software, or\n                "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "(b)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          this copyright and permission notice appear in associated\n             Documentation.\n            THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT\n         WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT\n         LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A\n         PARTICULAR PURPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS.\n         IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN\n         THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT\n         OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING\n         FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF\n         CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF\n         OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA FILES\n         OR SOFTWARE.\n            Except as contained in this notice, the name of a copyright\n         holder shall not be used in advertising or otherwise to\n         promote the sale, use or other dealings in these Data Files or\n         Software without prior written authorization of the copyright\n         holder."}]