[{"type": "text", "content": "\n"}, {"type": "optional", "content": [{"type": "text", "content": "\nUnicode Terms of Use\n"}]}, {"type": "text", "content": "\nFor the general privacy policy governing access to this site, see the Unicode Privacy Policy. For\ntrademark usage, see the Unicode® Consortium Name and Trademark Usage Policy.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "A."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nUnicode Copyright.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCopyright © 1991-2014 Unicode, Inc. All rights reserved.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nCertain documents and files on this website contain a legend indicating that \"Modification is\npermitted.\" Any person is hereby authorized, without fee, to modify such documents and files\nto create derivative works conforming to the Unicode® Standard, subject to Terms and\nConditions herein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAny person is hereby authorized, without fee, to view, use, reproduce, and distribute all\ndocuments and files solely for informational purposes in the creation of products supporting\nthe Unicode Standard, subject to the Terms and Conditions herein.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nFurther specifications of rights and restrictions pertaining to the use of the particular set of\ndata files known as the \"Unicode Character Database\" can be found in Exhibit 1.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEach version of the Unicode Standard has further specifications of rights and restrictions of\nuse. For the book editions (Unicode 5.0 and earlier), these are found on the back of the title\npage. The online code charts carry specific restrictions. All other files, including online\ndocumentation of the core specification for Unicode 6.0 and later, are covered under these\ngeneral Terms of Use.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "6."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nNo license is granted to \"mirror\" the Unicode website where a fee is charged for access to the\n\"mirror\" site.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "7."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nModification is not permitted with respect to this document. All copies of this document must be\nverbatim.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "B."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nRestricted Rights Legend. Any technical data or software which is licensed to the United States\nof America, its agencies and/or instrumentalities under this Agreement is commercial technical\ndata or commercial computer software developed exclusively at private expense as defined in\nFAR 2.101, or DFARS 252.227-7014 (June 1995), as applicable. For technical data, use,\nduplication, or disclosure by the Government is subject to restrictions as set forth in DFARS\n202.227-7015 Technical Data, Commercial and Items (Nov 1995) and this Agreement. For Software,\nin accordance with FAR 12-212 or DFARS 227-7202, as applicable, use, duplication or disclosure\nby the Government is subject to the restrictions set forth in this Agreement.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "C."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nWarranties and Disclaimers.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThis publication and/or website may include technical or typographical errors or other\ninaccuracies . Changes are periodically added to the information herein; these changes will be\nincorporated in new editions of the publication and/or website. Unicode may make improvements\nand/or changes in the product(s) and/or program(s) described in this publication and/or\nwebsite at any time.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nIf this file has been purchased on magnetic or optical media from Unicode, Inc. the sole and\nexclusive remedy for any claim will be exchange of the defective media within ninety (90) days\nof original purchase.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEXCEPT AS PROVIDED IN SECTION C.2, THIS PUBLICATION AND/OR SOFTWARE IS PROVIDED \"AS IS\" WITHOUT\nWARRANTY OF ANY KIND EITHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. UNICODE\nAND ITS LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR OMISSIONS IN THIS PUBLICATION AND/OR\nSOFTWARE OR OTHER DOCUMENTS WHICH ARE REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE\nUNICODE WEBSITE.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "D."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nWaiver of Damages. In no event shall Unicode or its licensors be liable for any special,\nincidental, indirect or consequential damages of any kind, or any damages whatsoever, whether\nor not Unicode was advised of the possibility of the damage, including, without limitation,\nthose resulting from the following: loss of use, data or profits, in connection with the use,\nmodification or distribution of this information or its derivatives.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "E."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTrademarks & Logos.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Unicode Word Mark and the Unicode Logo are trademarks of Unicode, Inc. “The Unicode\nConsortium” and “Unicode, Inc.” are trade names of Unicode, Inc. Use of the information and\nmaterials found on this website indicates your acknowledgement of Unicode, Inc.’s exclusive\nworldwide rights in the Unicode Word Mark, the Unicode Logo, and the Unicode trade names.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nThe Unicode Consortium Name and Trademark Usage Policy (“Trademark Policy”) are incorporated\nherein by reference and you agree to abide by the provisions of the Trademark Policy, which\nmay be changed from time to time in the sole discretion of Unicode, Inc.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nAll third party trademarks referenced herein are the property of their respective owners.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "F."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nMiscellaneous.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "1."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nJurisdiction and Venue. This server is operated from a location in the State of California,\nUnited States of America. Unicode makes no representation that the materials are appropriate\nfor use in other locations. If you access this server from other locations, you are\nresponsible for compliance with local laws. This Agreement, all use of this site and any\nclaims and damages resulting from use of this site are governed solely by the laws of the\nState of California without regard to any principles which would apply the laws of a different\njurisdiction. The user agrees that any disputes regarding this site shall be resolved solely\nin the courts located in Santa Clara County, California. The user agrees said courts have\npersonal jurisdiction and agree to waive any right to transfer the dispute to any other\nforum.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "2."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nModification by Unicode Unicode shall have the right to modify this Agreement at any time by\nposting it to this site. The user may not assign any part of this Agreement without Unicode’s\nprior written consent.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "3."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nTaxes. The user agrees to pay any taxes arising from access to this website or use of the\ninformation herein, except for those based on Unicode’s net income.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "4."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nSeverability. If any provision of this Agreement is declared invalid or unenforceable, the\nremaining provisions of this Agreement shall remain in effect.\n"}, {"type": "var", "name": "bullet", "content": [{"type": "text", "content": "5."}], "pattern": ".{0,20}"}, {"type": "text", "content": "\nEntire Agreement. This Agreement constitutes the entire agreement between the parties.\n"}]