[{"type": "optional", "content": {"type": "text", "content": "VOSTROM Public License for Open Source"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 2007 VOSTROM Holdings, Inc."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      This VOSTROM Holdings, Inc. (VOSTROM) Distribution (code and documentation) is made available to the open\n         source community as a public service by VOSTROM. Contact VOSTROM at license@vostrom.com for\n         information on other licensing arrangements (e.g. for use in proprietary applications).\n      Under this license, this Distribution may be modified and the original version and modified versions may\n         be copied, distributed, publicly displayed and performed provided that the following conditions are\n         met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Modified versions are distributed with source code and documentation and with permission for\n             others to use any code and documentation (whether in original or modified versions) as granted\n             under this license;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          if modified, the source code, documentation, and user run-time elements should be clearly labeled\n             by placing an identifier of origin (such as a name, initial, or other tag) after the version\n             number;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          users, modifiers, distributors, and others coming into possession or using the Distribution in\n             original or modified form accept the entire risk as to the possession, use, and performance of\n             the Distribution;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          this copyright management information (software identifier and version number, copyright notice\n             and license) shall be retained in all versions of the Distribution;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          VOSTROM may make modifications to the Distribution that are substantially similar to modified\n             versions of the Distribution, and may make, use, sell, copy, distribute, publicly display, and\n             perform such modifications, including making such modifications available under this or other\n             licenses, without obligation or restriction;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          modifications incorporating code, libraries, and/or documentation subject to any other open\n             source license may be made, and the resulting work may be distributed under the terms of such\n             open source license if required by that open source license, but doing so will not affect this\n             Distribution, other modifications made under this license or modifications made under other\n             VOSTROM licensing arrangements;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "7."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          no permission is granted to distribute, publicly display, or publicly perform modifications to\n             the Distribution made using proprietary materials that cannot be released in source format\n             under conditions of this license;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "8."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          the name of VOSTROM may not be used in advertising or publicity pertaining to Distribution of the\n             software without specific, prior written permission.\n      This software is made available \"as is\", and\n      VOSTROM DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, WITH REGARD TO THIS SOFTWARE, INCLUDING WITHOUT\n         LIMITATION ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE, AND IN NO\n         EVENT SHALL VOSTROM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\n         WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, TORT\n         (INCLUDING NEGLIGENCE) OR STRICT LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n         PERFORMANCE OF THIS SOFTWARE."}]