[{"type": "text", "content": "This work is being provided by the copyright holders under the\n         following license.\n      License\n        By obtaining and/or copying this work, you (the licensee)\n             agree that you have read, understood, and will comply\n             with the following terms and conditions.\n      Permission to copy, modify, and distribute this work, with or\n         without modification, for any purpose and without fee or\n         royalty is hereby granted, provided that you include the\n         following on ALL copies of the work or portions thereof,\n         including modifications:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The full text of this NOTICE in a location viewable to\n             users of the redistributed or derivative work.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Any pre-existing intellectual property disclaimers,\n             notices, or terms and conditions. If none exist, the\n             W3C Software and Document Short Notice should be\n             included.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "•"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Notice of any changes or modifications, through a\n             copyright statement on the new code or document such\n             as \"This software or document includes material copied\n             from or derived from [title and URI of the W3C\n             document]. Copyright (c) [YEAR] W3C® (MIT, ERCIM,\n             Keio, Beihang).\"\n      Disclaimers\n        THIS WORK IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE\n             NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED,\n             INCLUDING BUT NOT LIMITED TO, WARRANTIES OF\n             MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE\n             OR THAT THE USE OF THE SOFTWARE OR DOCUMENT WILL NOT\n             INFRINGE ANY THIRD PARTY PATENTS, COPYRIGHTS,\n             TRADEMARKS OR OTHER RIGHTS.\n      COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT,\n         SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THE\n         SOFTWARE OR DOCUMENT.\n      The name and trademarks of copyright holders may NOT be used in\n         advertising or publicity pertaining to the work without\n         specific, written prior permission. Title to copyright in this\n         work will at all times remain with copyright holders."}]