[{"type": "optional", "content": {"type": "text", "content": "W3C SOFTWARE NOTICE AND LICENSE"}}, {"type": "text", "content": "\n\n      This work (and included software, documentation such as READMEs, or other related items) is being\n         provided by the copyright holders under the following license.\n      License\n      By obtaining, using and/or copying this work, you (the licensee) agree that you have read, understood,\n         and will comply with the following terms and conditions.\n      Permission to copy, modify, and distribute this software and its documentation, with or without\n         modification, for any purpose and without fee or royalty is hereby granted, provided that you include\n         the following on ALL copies of the software and documentation or portions thereof, including\n         modifications:\n      The full text of this NOTICE in a location viewable to users of the redistributed or derivative work.\n      Any pre-existing intellectual property disclaimers, notices, or terms and conditions. If none exist, the\n         W3C Software Short Notice should be included (hypertext is preferred, text is permitted) within the\n         body of any redistributed or derivative code.\n      Notice of any changes or modifications to the files, including the date changes were made. (We recommend\n         you provide URIs to the location from which the code is derived.)\n      Disclaimers\n      THIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR\n         WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS\n         FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENTATION WILL NOT INFRINGE ANY\n         THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n      COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING\n         OUT OF ANY USE OF THE SOFTWARE OR DOCUMENTATION.\n      The name and trademarks of copyright holders may NOT be used in advertising or publicity pertaining to\n         the software without specific, written prior permission. Title to copyright in this software and any\n         associated documentation will at all times remain with copyright holders.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "Notes\n         This version: http://www.w3.org/Consortium/Legal/2002/copyright-software-20021231\n         This formulation of W3C's notice and license became active on December 31 2002. This version removes the\n         copyright ownership notice such that this license can be used with materials other than those owned by\n         the W3C, reflects that ERCIM is now a host of the W3C, includes references to this specific dated\n         version of the license, and removes the ambiguous grant of \"use\". Otherwise, this version is the same\n         as the previous version and is written so as to preserve the Free Software Foundation's assessment of\n         GPL compatibility and OSI's certification under the Open Source Definition."}}]