[{"type": "optional", "content": {"type": "text", "content": "W3C® SOFTWARE NOTICE AND LICENSE"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 1994-2002 World Wide Web Consortium, (Massachusetts Institute of Technology, Institut\n         National de Recherche en Informatique et en Automatique, Keio University). All Rights Reserved.\n         http://www.w3.org/Consortium/Legal/"}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      This W3C work (including software, documents, or other related items) is being provided by the copyright\n         holders under the following license. By obtaining, using and/or copying this work, you (the licensee)\n         agree that you have read, understood, and will comply with the following terms and conditions:\n      Permission to use, copy, modify, and distribute this software and its documentation, with or without\n         modification, for any purpose and without fee or royalty is hereby granted, provided that you include\n         the following on ALL copies of the software and documentation or portions thereof, including\n         modifications, that you make:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The full text of this NOTICE in a location viewable to users of the redistributed or derivative work.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Any pre-existing intellectual property disclaimers, notices, or terms and conditions. If none\n             exist, a short notice of the following form (hypertext is preferred, text is permitted) should\n             be used within the body of any redistributed or derivative code: \"Copyright ©\n             [$date-of-software] World Wide Web Consortium, (Massachusetts Institute of Technology,\n             Institut National de Recherche en Informatique et en Automatique, Keio University). All Rights\n             Reserved. http://www.w3.org/Consortium/Legal/\"\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Notice of any changes or modifications to the W3C files, including the date changes were made.\n             (We recommend you provide URIs to the location from which the code is derived.)\n      THIS SOFTWARE AND DOCUMENTATION IS PROVIDED \"AS IS,\" AND COPYRIGHT HOLDERS MAKE NO REPRESENTATIONS OR\n         WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO, WARRANTIES OF MERCHANTABILITY OR FITNESS\n         FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE OR DOCUMENTATION WILL NOT INFRINGE ANY\n         THIRD PARTY PATENTS, COPYRIGHTS, TRADEMARKS OR OTHER RIGHTS.\n      COPYRIGHT HOLDERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING\n         OUT OF ANY USE OF THE SOFTWARE OR DOCUMENTATION.\n      The name and trademarks of copyright holders may NOT be used in advertising or publicity pertaining to\n         the software without specific, written prior permission. Title to copyright in this software and any\n         associated documentation will at all times remain with copyright holders.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "____________________________________\n         This formulation of W3C's notice and license became active on August 14 1998 so as to improve\n         compatibility with GPL. This version ensures that W3C software licensing terms are no more restrictive\n         than GPL and consequently W3C software may be distributed in GPL packages. See the older formulation\n         for the policy prior to this date. Please see our Copyright FAQ for common questions about using\n         materials from our site, including specific terms and conditions for packages like libwww, Amaya, and\n         Jigsaw. Other questions about this notice can be directed to site-policy@w3.org."}}]