[{"tag": "text", "content": "\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nSybase Open Watcom Public License version 1.0\n"}]}, {"tag": "text", "content": "\nUSE OF THE SYBASE OPEN WATCOM SOFTWARE DESCRIBED BELOW (\"SOFTWARE\") IS SUBJECT TO THE TERMS AND\nCONDITIONS SET FORTH IN THE SYBASE OPEN WATCOM PUBLIC LICENSE SET FORTH BELOW (\"LICENSE\"). YOU MAY NOT\nUSE THE SOFTWARE IN ANY MANNER UNLESS YOU ACCEPT THE TERMS AND CONDITIONS OF THE LICENSE. YOU INDICATE\nYOUR ACCEPTANCE BY IN ANY MANNER USING (INCLUDING WITHOUT LIMITATION BY REPRODUCING, MODIFYING OR\nDISTRIBUTING) THE SOFTWARE. IF YOU DO NOT ACCEPT ALL OF THE TERMS AND CONDITIONS OF THE LICENSE, DO\nNOT USE THE SOFTWARE IN ANY MANNER.\nSybase Open Watcom Public License version 1.0\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGeneral; Definitions. This License applies only to the following software programs: the open\nsource versions of Sybase's Watcom C/C++ and Fortran compiler products (\"Software\"), which are\nmodified versions of, with significant changes from, the last versions made commercially\navailable by Sybase. As used in this License:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Applicable Patent Rights\" mean: (a) in the case where Sybase is the grantor of rights, (i)\nclaims of patents that are now or hereafter acquired, owned by or assigned to Sybase and (ii)\nthat cover subject matter contained in the Original Code, but only to the extent necessary to\nuse, reproduce and/or distribute the Original Code without infringement; and (b) in the case\nwhere You are the grantor of rights, (i) claims of patents that are now or hereafter acquired,\nowned by or assigned to You and (ii) that cover subject matter in Your Modifications, taken\nalone or in combination with Original Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Contributor\" means any person or entity that creates or contributes to the creation of Modifications.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Covered Code\" means the Original Code, Modifications, the combination of Original Code and any\nModifications, and/or any respective portions thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Deploy\" means to use, sublicense or distribute Covered Code other than for Your internal\nresearch and development (R&D) and/or Personal Use, and includes without limitation, any\nand all internal use or distribution of Covered Code within Your business or organization\nexcept for R&D use and/or Personal Use, as well as direct or indirect sublicensing or\ndistribution of Covered Code by You to any third party in any form or manner.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Larger Work\" means a work which combines Covered Code or portions thereof with code not governed\nby the terms of this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.6"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Modifications\" mean any addition to, deletion from, and/or change to, the substance and/or\nstructure of the Original Code, any previous Modifications, the combination of Original Code\nand any previous Modifications, and/or any respective portions thereof. When code is released\nas a series of files, a Modification is: (a) any addition to or deletion from the contents of\na file containing Covered Code; and/or (b) any new file or other representation of computer\nprogram statements that contains any part of Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.7"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Original Code\" means (a) the Source Code of a program or other work as originally made available\nby Sybase under this License, including the Source Code of any updates or upgrades to such\nprograms or works made available by Sybase under this License, and that has been expressly\nidentified by Sybase as such in the header file(s) of such work; and (b) the object code\ncompiled from such Source Code and originally made available by Sybase under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.8"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Personal Use\" means use of Covered Code by an individual solely for his or her personal, private\nand non-commercial purposes. An individual's use of Covered Code in his or her capacity as an\nofficer, employee, member, independent contractor or agent of a corporation, business or\norganization (commercial or non-commercial) does not qualify as Personal Use.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.9"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"Source Code\" means the human readable form of a program or other work that is suitable for\nmaking modifications to it, including all modules it contains, plus any associated interface\ndefinition files, scripts used to control compilation and installation of an executable\n(object code).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "1.10"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\n\"You\" or \"Your\" means an individual or a legal entity exercising rights under this License. For\nlegal entities, \"You\" or \"Your\" includes any entity which controls, is controlled by, or is\nunder common control with, You, where \"control\" means (a) the power, direct or indirect, to\ncause the direction or management of such entity, whether by contract or otherwise, or (b)\nownership of fifty percent (50%) or more of the outstanding shares or beneficial ownership of\nsuch entity.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nPermitted Uses; Conditions & Restrictions.Subject to the terms and conditions of this\nLicense, Sybase hereby grants You, effective on the date You accept this License and download\nthe Original Code, a world-wide, royalty-free, non-exclusive license, to the extent of\nSybase's Applicable Patent Rights and copyrights covering the Original Code, to do the\nfollowing:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may use, reproduce, display, perform, modify and distribute Original Code, with or without\nModifications, solely for Your internal research and development and/or Personal Use, provided\nthat in each instance:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must retain and reproduce in all copies of Original Code the copyright and other proprietary\nnotices and disclaimers of Sybase as they appear in the Original Code, and keep intact all\nnotices in the Original Code that refer to this License; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must retain and reproduce a copy of this License with every copy of Source Code of Covered\nCode and documentation You distribute, and You may not offer or impose any terms on such\nSource Code that alter or restrict this License or the recipients' rights hereunder, except as\npermitted under Section 6.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWhenever reasonably feasible you should include the copy of this License in a click-wrap format,\nwhich requires affirmative acceptance by clicking on an \"I accept\" button or similar\nmechanism. If a click-wrap format is not included, you must include a statement that any use\n(including without limitation reproduction, modification or distribution) of the Software, and\nany other affirmative act that you define, constitutes acceptance of the License, and\ninstructing the user not to use the Covered Code in any manner if the user does not accept all\nof the terms and conditions of the License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou may use, reproduce, display, perform, modify and Deploy Covered Code, provided that in each\ninstance:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must satisfy all the conditions of Section 2.1 with respect to the Source Code of the Covered Code;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must duplicate, to the extent it does not already exist, the notice in Exhibit A in each file\nof the Source Code of all Your Modifications, and cause the modified files to carry prominent\nnotices stating that You changed the files and the date of any change;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou must make Source Code of all Your Deployed Modifications publicly available under the terms\nof this License, including the license grants set forth in Section 3 below, for as long as you\nDeploy the Covered Code or twelve (12) months from the date of initial Deployment, whichever\nis longer. You should preferably distribute the Source Code of Your Deployed Modifications\nelectronically (e.g. download from a web site);\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(d)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nif You Deploy Covered Code in object code, executable form only, You must include a prominent\nnotice, in the code itself as well as in related documentation, stating that Source Code of\nthe Covered Code is available under the terms of this License with information on how and\nwhere to obtain such Source Code; and\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(e)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nthe object code form of the Covered Code may be distributed under Your own license agreement,\nprovided that such license agreement contains terms no less protective of Sybase and each\nContributor than the terms of this License, and stating that any provisions which differ from\nthis License are offered by You alone and not by any other party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "2.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYou expressly acknowledge and agree that although Sybase and each Contributor grants the licenses\nto their respective portions of the Covered Code set forth herein, no assurances are provided\nby Sybase or any Contributor that the Covered Code does not infringe the patent or other\nintellectual property rights of any other entity. Sybase and each Contributor disclaim any\nliability to You for claims brought by any other entity based on infringement of intellectual\nproperty rights or otherwise. As a condition to exercising the rights and licenses granted\nhereunder, You hereby assume sole responsibility to secure any other intellectual property\nrights needed, if any. For example, if a third party patent license is required to allow You\nto distribute the Covered Code, it is Your responsibility to acquire that license before\ndistributing the Covered Code.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "3."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nYour Grants. In consideration of, and as a condition to, the licenses granted to You under this\nLicense, You hereby grant to Sybase and all third parties a non-exclusive, royalty-free\nlicense, under Your Applicable Patent Rights and other intellectual property rights (other\nthan patent) owned or controlled by You, to use, reproduce, display, perform, modify,\ndistribute and Deploy Your Modifications of the same scope and extent as Sybase's licenses\nunder Sections 2.1 and 2.2.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "4."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLarger Works. You may create a Larger Work by combining Covered Code with other code not governed\nby the terms of this License and distribute the Larger Work as a single product. In each such\ninstance, You must make sure the requirements of this License are fulfilled for the Covered\nCode or any portion thereof.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "5."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLimitations on Patent License. Except as expressly stated in Section 2, no other patent rights,\nexpress or implied, are granted by Sybase herein. Modifications and/or Larger Works may\nrequire additional patent licenses from Sybase which Sybase may grant in its sole\ndiscretion.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "6."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nAdditional Terms. You may choose to offer, and to charge a fee for, warranty, support, indemnity\nor liability obligations and/or other rights consistent with this License (\"Additional Terms\")\nto one or more recipients of Covered Code. However, You may do so only on Your own behalf and\nas Your sole responsibility, and not on behalf of Sybase or any Contributor. You must obtain\nthe recipient's agreement that any such Additional Terms are offered by You alone, and You\nhereby agree to indemnify, defend and hold Sybase and every Contributor harmless for any\nliability incurred by or claims asserted against Sybase or such Contributor by reason of any\nsuch Additional Terms.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "7."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nVersions of the License. Sybase may publish revised and/or new versions of this License from time\nto time. Each version will be given a distinguishing version number. Once Original Code has\nbeen published under a particular version of this License, You may continue to use it under\nthe terms of that version. You may also choose to use such Original Code under the terms of\nany subsequent version of this License published by Sybase. No one other than Sybase has the\nright to modify the terms applicable to Covered Code created under this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "8."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nNO WARRANTY OR SUPPORT. The Covered Code may contain in whole or in part pre-release, untested,\nor not fully tested works. The Covered Code may contain errors that could cause failures or\nloss of data, and may be incomplete or contain inaccuracies. You expressly acknowledge and\nagree that use of the Covered Code, or any portion thereof, is at Your sole and entire risk.\nTHE COVERED CODE IS PROVIDED \"AS IS\" AND WITHOUT WARRANTY, UPGRADES OR SUPPORT OF ANY KIND AND\nSYBASE AND SYBASE'S LICENSOR(S) (COLLECTIVELY REFERRED TO AS \"SYBASE\" FOR THE PURPOSES OF\nSECTIONS 8 AND 9) AND ALL CONTRIBUTORS EXPRESSLY DISCLAIM ALL WARRANTIES AND/OR CONDITIONS,\nEXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES AND/OR CONDITIONS OF\nMERCHANTABILITY, OF SATISFACTORY QUALITY, OF FITNESS FOR A PARTICULAR PURPOSE, OF ACCURACY, OF\nQUIET ENJOYMENT, AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. SYBASE AND EACH CONTRIBUTOR DOES\nNOT WARRANT AGAINST INTERFERENCE WITH YOUR ENJOYMENT OF THE COVERED CODE, THAT THE FUNCTIONS\nCONTAINED IN THE COVERED CODE WILL MEET YOUR REQUIREMENTS, THAT THE OPERATION OF THE COVERED\nCODE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE COVERED CODE WILL BE\nCORRECTED. NO ORAL OR WRITTEN INFORMATION OR ADVICE GIVEN BY SYBASE, A SYBASE AUTHORIZED\nREPRESENTATIVE OR ANY CONTRIBUTOR SHALL CREATE A WARRANTY. You acknowledge that the Covered\nCode is not intended for use in the operation of nuclear facilities, aircraft navigation,\ncommunication systems, or air traffic control machines in which case the failure of the\nCovered Code could lead to death, personal injury, or severe physical or environmental\ndamage.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "9."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nLIMITATION OF LIABILITY. TO THE EXTENT NOT PROHIBITED BY LAW, IN NO EVENT SHALL SYBASE OR ANY\nCONTRIBUTOR BE LIABLE FOR ANY DIRECT, INCIDENTAL, SPECIAL, INDIRECT, CONSEQUENTIAL OR OTHER\nDAMAGES OF ANY KIND ARISING OUT OF OR RELATING TO THIS LICENSE OR YOUR USE OR INABILITY TO USE\nTHE COVERED CODE, OR ANY PORTION THEREOF, WHETHER UNDER A THEORY OF CONTRACT, WARRANTY, TORT\n(INCLUDING NEGLIGENCE), PRODUCTS LIABILITY OR OTHERWISE, EVEN IF SYBASE OR SUCH CONTRIBUTOR\nHAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, AND NOTWITHSTANDING THE FAILURE OF\nESSENTIAL PURPOSE OF ANY REMEDY. SOME JURISDICTIONS DO NOT ALLOW THE LIMITATION OF LIABILITY\nOF INCIDENTAL OR CONSEQUENTIAL OR OTHER DAMAGES OF ANY KIND, SO THIS LIMITATION MAY NOT APPLY\nTO YOU. In no event shall Sybase's or any Contributor's total liability to You for all damages\n(other than as may be required by applicable law) under this License exceed the amount of five\nhundred dollars ($500.00).\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "10."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTrademarks. This License does not grant any rights to use the trademarks or trade names \"Sybase\"\nor any other trademarks or trade names belonging to Sybase (collectively \"Sybase Marks\") or to\nany trademark or trade name belonging to any Contributor(\"Contributor Marks\"). No Sybase Marks\nor Contributor Marks may be used to endorse or promote products derived from the Original Code\nor Covered Code other than with the prior written consent of Sybase or the Contributor, as\napplicable.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "11."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nOwnership. Subject to the licenses granted under this License, each Contributor retains all\nrights, title and interest in and to any Modifications made by such Contributor. Sybase\nretains all rights, title and interest in and to the Original Code and any Modifications made\nby or on behalf of Sybase (\"Sybase Modifications\"), and such Sybase Modifications will not be\nautomatically subject to this License. Sybase may, at its sole discretion, choose to license\nsuch Sybase Modifications under this License, or on different terms from those contained in\nthis License or may choose not to license them at all.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nTermination. This License and the rights granted hereunder will terminate:\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(a)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nautomatically without notice if You fail to comply with any term(s) of this License and fail to\ncure such breach within 30 days of becoming aware of such breach;\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(b)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nimmediately in the event of the circumstances described in Section 13.5(b); or\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "(c)"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nautomatically without notice if You, at any time during the term of this License, commence an\naction for patent infringement (including as a cross claim or counterclaim) against Sybase or\nany Contributor.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "12.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEffect of Termination. Upon termination, You agree to immediately stop any further use,\nreproduction, modification, sublicensing and distribution of the Covered Code and to destroy\nall copies of the Covered Code that are in your possession or control. All sublicenses to the\nCovered Code that have been properly granted prior to termination shall survive any\ntermination of this License. Provisions which, by their nature, should remain in effect beyond\nthe termination of this License shall survive, including but not limited to Sections 3, 5, 8,\n9, 10, 11, 12.2 and 13. No party will be liable to any other for compensation, indemnity or\ndamages of any sort solely as a result of terminating this License in accordance with its\nterms, and termination of this License will be without prejudice to any other right or remedy\nof any party.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13."}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nMiscellaneous.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.1"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nGovernment End Users. The Covered Code is a \"commercial item\" as defined in FAR 2.101. Government\nsoftware and technical data rights in the Covered Code include only those rights customarily\nprovided to the public as defined in this License. This customary commercial license in\ntechnical data and software is provided in accordance with FAR 12.211 (Technical Data) and\n12.212 (Computer Software) and, for Department of Defense purchases, DFAR 252.227-7015\n(Technical Data -- Commercial Items) and 227.7202-3 (Rights in Commercial Computer Software or\nComputer Software Documentation). Accordingly, all U.S. Government End Users acquire Covered\nCode with only those rights set forth herein.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.2"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nRelationship of Parties. This License will not be construed as creating an agency, partnership,\njoint venture or any other form of legal association between or among you, Sybase or any\nContributor, and You will not represent to the contrary, whether expressly, by implication,\nappearance or otherwise.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.3"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nIndependent Development. Nothing in this License will impair Sybase's or any Contributor's right\nto acquire, license, develop, have others develop for it, market and/or distribute technology\nor products that perform the same or similar functions as, or otherwise compete with,\nModifications, Larger Works, technology or products that You may develop, produce, market or\ndistribute.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.4"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nWaiver; Construction. Failure by Sybase or any Contributor to enforce any provision of this\nLicense will not be deemed a waiver of future enforcement of that or any other provision. Any\nlaw or regulation which provides that the language of a contract shall be construed against\nthe drafter will not apply to this License.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.5"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nSeverability. (a) If for any reason a court of competent jurisdiction finds any provision of this\nLicense, or portion thereof, to be unenforceable, that provision of the License will be\nenforced to the maximum extent permissible so as to effect the economic benefits and intent of\nthe parties, and the remainder of this License will continue in full force and effect. (b)\nNotwithstanding the foregoing, if applicable law prohibits or restricts You from fully and/or\nspecifically complying with Sections 2 and/or 3 or prevents the enforceability of either of\nthose Sections, this License will immediately terminate and You must immediately discontinue\nany use of the Covered Code and destroy all copies of it that are in your possession or\ncontrol.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.6"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nDispute Resolution. Any litigation or other dispute resolution between You and Sybase relating to\nthis License shall take place in the Northern District of California, and You and Sybase\nhereby consent to the personal jurisdiction of, and venue in, the state and federal courts\nwithin that District with respect to this License. The application of the United Nations\nConvention on Contracts for the International Sale of Goods is expressly excluded.\n"}, {"tag": "var", "name": "bullet", "content": [{"tag": "text", "content": "13.7"}], "pattern": ".{0,20}"}, {"tag": "text", "content": "\nEntire Agreement; Governing Law. This License constitutes the entire agreement between the\nparties with respect to the subject matter hereof. This License shall be governed by the laws\nof the United States and the State of California, except that body of California law\nconcerning conflicts of law.\nWhere You are located in the province of Quebec, Canada, the following clause applies: The parties hereby\nconfirm that they have requested that this License and all related documents be drafted in English.\nLes parties ont exigè que le prèsent contrat et tous les documents connexes soient rèdiès en\nanglais.\n"}, {"tag": "optional", "content": [{"tag": "text", "content": "\nEXHIBIT A.\n\"Portions Copyright (c) 1983-2002 Sybase, Inc. All Rights Reserved.\nThis file contains Original Code and/or Modifications of Original Code as defined in and that are\nsubject to the Sybase Open Watcom Public License version 1.0 (the 'License'). You may not use\nthis file except in compliance with the License. BY USING THIS FILE YOU AGREE TO ALL TERMS AND\nCONDITIONS OF THE LICENSE. A copy of the License is provided with the Original Code and\nModifications, and is also available at www.sybase.com/developer/opensource.\nThe Original Code and all software distributed under the License are distributed on an 'AS IS' basis,\nWITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, AND SYBASE AND ALL CONTRIBUTORS HEREBY\nDISCLAIM ALL SUCH WARRANTIES, INCLUDING WITHOUT LIMITATION, ANY WARRANTIES OF MERCHANTABILITY, FITNESS\nFOR A PARTICULAR PURPOSE, QUIET ENJOYMENT OR NON-INFRINGEMENT. Please see the License for the specific\nlanguage governing rights and limitations under the License.\"\n"}]}, {"tag": "text", "content": "\n"}]