[{"type": "text", "content": "EXCEPTION NOTICE\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          As a special exception, the copyright holders of this\n             library give permission for additional uses of the\n             text contained in this release of the library as\n             licenced under the wxWindows Library Licence, applying\n             either version 3.1 of the Licence, or (at your option)\n             any later version of the Licence as published by the\n             copyright holders of version 3.1 of the Licence\n             document.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The exception is that you may use, copy, link, modify and\n             distribute under your own terms, binary object code\n             versions of works based on the Library.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If you copy code from files distributed under the terms\n             of the GNU General Public Licence or the GNU Library\n             General Public Licence into a copy of this library, as\n             this licence permits, the exception does not apply to\n             the code that you add in this way. To avoid misleading\n             anyone as to the status of such modified files, you\n             must delete this exception notice from such code\n             and/or adjust the licensing conditions notice\n             accordingly.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          If you write modifications of your own for this library,\n             it is your choice whether to permit this exception to\n             apply to your modifications. If you do not wish that,\n             you must delete the exception notice from such code\n             and/or adjust the licensing conditions notice\n             accordingly."}]