[{"type": "optional", "content": {"type": "text", "content": "LICENSE FOR THE Extreme! Lab PullParser"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) 2002 The Trustees of Indiana University. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All redistributions of source code must retain the above copyright notice, the list of authors in\n             the original source code, this list of conditions and the disclaimer listed in this\n             license;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All redistributions in binary form must reproduce the above copyright notice, this list of\n             conditions and the disclaimer listed in this license in the documentation and/or other\n             materials provided with the distribution;\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Any documentation included with all redistributions must include the following acknowledgement:\n          \"This product includes software developed by the Indiana University Extreme! Lab. For further\n             information please visit http://www.extreme.indiana.edu/\"\n            Alternatively, this acknowledgment may appear in the software itself, and wherever such\n             third-party acknowledgments normally appear.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          The name \"Indiana Univeristy\" and \"Indiana Univeristy Extreme! Lab\" shall not be used to endorse\n             or promote products derived from this software without prior written permission from Indiana\n             University. For written permission, please contact http://www.extreme.indiana.edu/.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5)"}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Products derived from this software may not use \"Indiana Univeristy\" name nor may \"Indiana\n             Univeristy\" appear in their name, without prior written permission of the Indiana University.\n             Indiana University provides no reassurances that the source code provided does not infringe\n             the patent or any other intellectual property rights of any other entity. Indiana University\n             disclaims any liability to any recipient for claims brought by any other entity based on\n             infringement of intellectual property rights or otherwise.\n      LICENSEE UNDERSTANDS THAT SOFTWARE IS PROVIDED \"AS IS\" FOR WHICH NO WARRANTIES AS TO CAPABILITIES OR\n         ACCURACY ARE MADE. INDIANA UNIVERSITY GIVES NO WARRANTIES AND MAKES NO REPRESENTATION THAT SOFTWARE IS\n         FREE OF INFRINGEMENT OF THIRD PARTY PATENT, COPYRIGHT, OR OTHER PROPRIETARY RIGHTS. INDIANA UNIVERSITY\n         MAKES NO WARRANTIES THAT SOFTWARE IS FREE FROM \"BUGS\", \"VIRUSES\", \"TROJAN HORSES\", \"TRAP DOORS\",\n         \"WORMS\", OR OTHER HARMFUL CODE. LICENSEE ASSUMES THE ENTIRE RISK AS TO THE PERFORMANCE OF SOFTWARE\n         AND/OR ASSOCIATED MATERIALS, AND TO THE PERFORMANCE AND VALIDITY OF INFORMATION GENERATED USING\n         SOFTWARE."}]