[{"type": "optional", "content": {"type": "text", "content": "Zope Public License (ZPL) Version 1.1"}}, {"type": "text", "content": "\n      "}, {"type": "var", "name": "copyright", "content": {"type": "text", "content": "Copyright (c) Zope Corporation. All rights reserved."}, "pattern": ".{0,5000}"}, {"type": "text", "content": "\n      "}, {"type": "optional", "content": {"type": "text", "content": "This license has been certified as open source."}}, {"type": "text", "content": "\n\n      Redistribution and use in source and binary forms, with or without modification, are permitted provided\n         that the following conditions are met:\n      "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "1."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in source code must retain the above copyright notice, this list of conditions,\n             and the following disclaimer.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "2."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Redistributions in binary form must reproduce the above copyright notice, this list of\n             conditions, and the following disclaimer in the documentation and/or other materials provided\n             with the distribution.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "3."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          All advertising materials and documentation mentioning features derived from or use of this\n             software must display the following acknowledgement:\n          \"This product includes software developed by Zope Corporation for use in the Z Object Publishing\n             Environment (http://www.zope.com/).\"\n            In the event that the product being advertised includes an intact Zope distribution (with\n             copyright and license included) then this clause is waived.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "4."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Names associated with Zope or Zope Corporation must not be used to endorse or promote products\n             derived from this software without prior written permission from Zope Corporation.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "5."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Modified redistributions of any form whatsoever must retain the following acknowledgment:\n          \"This product includes software developed by Zope Corporation for use in the Z Object Publishing\n             Environment (http://www.zope.com/).\"\n            Intact (re-)distributions of any official Zope release do not require an external acknowledgement.\n        "}, {"type": "var", "name": "bullet", "content": {"type": "text", "content": "6."}, "pattern": ".{0,20}"}, {"type": "text", "content": "\n          Modifications are encouraged but must be packaged separately as patches to official Zope\n             releases. Distributions that do not clearly separate the patches from the original work must\n             be clearly labeled as unofficial distributions. Modifications which do not carry the name Zope\n             may be packaged in any form, as long as they conform to all of the clauses above.\n      Disclaimer\n      THIS SOFTWARE IS PROVIDED BY ZOPE CORPORATION ``AS IS'' AND ANY EXPRESSED OR IMPLIED WARRANTIES,\n         INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n         PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL ZOPE CORPORATION OR ITS CONTRIBUTORS BE LIABLE FOR ANY\n         DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n         TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n         INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n         TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\n         ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n      "}, {"type": "optional", "content": {"type": "text", "content": "This software consists of contributions made by Zope Corporation and many individuals on behalf of Zope\n         Corporation. Specific attributions are listed in the accompanying credits file."}}]